{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "72280096-b928-46a2-a19e-b074cee5a8c1",
   "metadata": {},
   "source": [
    "## To-Do:\n",
    "- consider using Bayesian probabilities instead of odds ratio"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "promotional-helicopter",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "pd.set_option('display.max_colwidth', None)\n",
    "import time\n",
    "from datetime import datetime\n",
    "import re\n",
    "import pprint\n",
    "import numpy as np\n",
    "import multiprocessing\n",
    "from multiprocessing import  Pool"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "satisfied-kitty",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Please enter the Neo4j database password to continue \n",
      " ············\n"
     ]
    }
   ],
   "source": [
    "# Runing this cell will ask you to provide the database password. If you need the password, email Tim McLerran at tmclerran@gmail.com to provide evidence \n",
    "# that you have been granted access to MIMIC-III data by physionet. If you are unsure how to proceed, just ask the #nlp channel on Slack\n",
    "import getpass\n",
    "password = getpass.getpass(\"\\nPlease enter the Neo4j database password to continue \\n\")\n",
    "\n",
    "# Create a connection to the working group's Neo4j database of MIMIC-III data\n",
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://76.251.77.235:7687\", auth=('neo4j',password))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b7666cf-a578-4708-9907-c343dfdde0c9",
   "metadata": {},
   "source": [
    "# Input known information to develop problem list\n",
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9cecac8-9bed-4cee-8d97-73118871be91",
   "metadata": {
    "tags": [],
    "toc-hr-collapsed": true
   },
   "source": [
    "## Input problems, output associated problems"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "84a3f5b0-e571-4aa9-820a-8e50bd7a1e2f",
   "metadata": {},
   "source": [
    "### Based on problem name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "strategic-speech",
   "metadata": {},
   "outputs": [],
   "source": [
    "def comorbidities_of(prob_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WHERE prob1.description in {prob_list}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (patients)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(prob_list=prob_list)\n",
    "    comorbidities = session.run(query)\n",
    "    comorbidities = pd.DataFrame([dict(record) for record in comorbidities])\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (excluded:Problem)\n",
    "    WHERE excluded.description in {prob_list}\n",
    "    WITH collect(excluded) as excluded\n",
    "    MATCH (pt:Patients)-[:HAS_PROBLEM]->(prob:Problem)\n",
    "    WITH excluded, pt, collect(prob) as problems\n",
    "    WHERE NONE (prob in problems where prob in excluded)\n",
    "    MATCH (pt)-[:HAS_PROBLEM]-(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(prob_list=prob_list)\n",
    "    gen_problems = session.run(query)\n",
    "    gen_problems = pd.DataFrame([dict(record) for record in gen_problems])\n",
    "    \n",
    "    gen_pop_total = sum(gen_problems['Number'])\n",
    "    gen_problems['Gen_pop_proportion'] = gen_problems['Number']/gen_pop_total\n",
    "    \n",
    "    gen_problems = gen_problems[gen_problems['Number'] > 50]\n",
    "    \n",
    "    comorb_total = sum(comorbidities['Number'])\n",
    "    comorbidities['Comorbidities_proportion'] = comorbidities['Number']/comorb_total\n",
    "    \n",
    "    comorbidities = comorbidities[comorbidities['Number'] > 200/len(prob_list)]\n",
    "    \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    comorbidities = pd.merge(comorbidities, gen_problems, on=['CUI', 'Description'])\n",
    "    \n",
    "    comorbidities['Odds_Ratio'] = (comorbidities['Comorbidities_proportion']/comorbidities['Gen_pop_proportion'])\n",
    "    \n",
    "  \n",
    "    comorbidities.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "    return comorbidities.head(20)\n",
    "    \n",
    "  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "c8a8d7da-2184-4e4c-917e-71c8605be7d6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 2.185105085372925 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Description</th>\n",
       "      <th>CUI</th>\n",
       "      <th>Number_x</th>\n",
       "      <th>Comorbidities_proportion</th>\n",
       "      <th>Number_y</th>\n",
       "      <th>Gen_pop_proportion</th>\n",
       "      <th>Odds_Ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>150</th>\n",
       "      <td>Restless Legs Syndrome</td>\n",
       "      <td>C0035258</td>\n",
       "      <td>130</td>\n",
       "      <td>0.000989</td>\n",
       "      <td>70</td>\n",
       "      <td>0.000115</td>\n",
       "      <td>8.637903</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>178</th>\n",
       "      <td>Dyspnea on exertion</td>\n",
       "      <td>C0231807</td>\n",
       "      <td>111</td>\n",
       "      <td>0.000845</td>\n",
       "      <td>79</td>\n",
       "      <td>0.000129</td>\n",
       "      <td>6.535200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>118</th>\n",
       "      <td>Postherpetic neuralgia</td>\n",
       "      <td>C0032768</td>\n",
       "      <td>181</td>\n",
       "      <td>0.001377</td>\n",
       "      <td>140</td>\n",
       "      <td>0.000229</td>\n",
       "      <td>6.013310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>183</th>\n",
       "      <td>Superinfection</td>\n",
       "      <td>C0038826</td>\n",
       "      <td>109</td>\n",
       "      <td>0.000829</td>\n",
       "      <td>87</td>\n",
       "      <td>0.000142</td>\n",
       "      <td>5.827339</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>Parkinson Disease</td>\n",
       "      <td>C0030567</td>\n",
       "      <td>249</td>\n",
       "      <td>0.001895</td>\n",
       "      <td>203</td>\n",
       "      <td>0.000332</td>\n",
       "      <td>5.705140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145</th>\n",
       "      <td>Heart Diseases</td>\n",
       "      <td>C0018799</td>\n",
       "      <td>136</td>\n",
       "      <td>0.001035</td>\n",
       "      <td>126</td>\n",
       "      <td>0.000206</td>\n",
       "      <td>5.020320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>106</th>\n",
       "      <td>Osteomyelitis</td>\n",
       "      <td>C0029443</td>\n",
       "      <td>210</td>\n",
       "      <td>0.001598</td>\n",
       "      <td>205</td>\n",
       "      <td>0.000335</td>\n",
       "      <td>4.764622</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>Neuropathy</td>\n",
       "      <td>C0442874</td>\n",
       "      <td>254</td>\n",
       "      <td>0.001933</td>\n",
       "      <td>266</td>\n",
       "      <td>0.000435</td>\n",
       "      <td>4.441351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>188</th>\n",
       "      <td>Vascular Diseases</td>\n",
       "      <td>C0042373</td>\n",
       "      <td>106</td>\n",
       "      <td>0.000807</td>\n",
       "      <td>133</td>\n",
       "      <td>0.000218</td>\n",
       "      <td>3.706954</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Diabetes</td>\n",
       "      <td>C0011847</td>\n",
       "      <td>1030</td>\n",
       "      <td>0.007838</td>\n",
       "      <td>1343</td>\n",
       "      <td>0.002197</td>\n",
       "      <td>3.567174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>165</th>\n",
       "      <td>Fungemia</td>\n",
       "      <td>C0085082</td>\n",
       "      <td>117</td>\n",
       "      <td>0.000890</td>\n",
       "      <td>153</td>\n",
       "      <td>0.000250</td>\n",
       "      <td>3.556784</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Hepatitis B</td>\n",
       "      <td>C0019163</td>\n",
       "      <td>166</td>\n",
       "      <td>0.001263</td>\n",
       "      <td>242</td>\n",
       "      <td>0.000396</td>\n",
       "      <td>3.190478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>108</th>\n",
       "      <td>Chronic Kidney Insufficiency</td>\n",
       "      <td>C0403447</td>\n",
       "      <td>205</td>\n",
       "      <td>0.001560</td>\n",
       "      <td>303</td>\n",
       "      <td>0.000496</td>\n",
       "      <td>3.146837</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Gallstone pancreatitis</td>\n",
       "      <td>C0521614</td>\n",
       "      <td>165</td>\n",
       "      <td>0.001256</td>\n",
       "      <td>245</td>\n",
       "      <td>0.000401</td>\n",
       "      <td>3.132426</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Chronic respiratory failure</td>\n",
       "      <td>C0264492</td>\n",
       "      <td>811</td>\n",
       "      <td>0.006171</td>\n",
       "      <td>1219</td>\n",
       "      <td>0.001994</td>\n",
       "      <td>3.094427</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>Heart Failure, Diastolic</td>\n",
       "      <td>C1135196</td>\n",
       "      <td>191</td>\n",
       "      <td>0.001453</td>\n",
       "      <td>289</td>\n",
       "      <td>0.000473</td>\n",
       "      <td>3.073962</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>Pressure Ulcer</td>\n",
       "      <td>C0011127</td>\n",
       "      <td>470</td>\n",
       "      <td>0.003576</td>\n",
       "      <td>738</td>\n",
       "      <td>0.001207</td>\n",
       "      <td>2.962133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Diabetes Mellitus, Non-Insulin-Dependent</td>\n",
       "      <td>C0011860</td>\n",
       "      <td>665</td>\n",
       "      <td>0.005060</td>\n",
       "      <td>1052</td>\n",
       "      <td>0.001721</td>\n",
       "      <td>2.940146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>Obesity</td>\n",
       "      <td>C0028754</td>\n",
       "      <td>307</td>\n",
       "      <td>0.002336</td>\n",
       "      <td>499</td>\n",
       "      <td>0.000816</td>\n",
       "      <td>2.861547</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>139</th>\n",
       "      <td>Gastroparesis</td>\n",
       "      <td>C0152020</td>\n",
       "      <td>148</td>\n",
       "      <td>0.001126</td>\n",
       "      <td>243</td>\n",
       "      <td>0.000398</td>\n",
       "      <td>2.832817</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  Description       CUI  Number_x  \\\n",
       "150                    Restless Legs Syndrome  C0035258       130   \n",
       "178                       Dyspnea on exertion  C0231807       111   \n",
       "118                    Postherpetic neuralgia  C0032768       181   \n",
       "183                            Superinfection  C0038826       109   \n",
       "95                          Parkinson Disease  C0030567       249   \n",
       "145                            Heart Diseases  C0018799       136   \n",
       "106                             Osteomyelitis  C0029443       210   \n",
       "92                                 Neuropathy  C0442874       254   \n",
       "188                         Vascular Diseases  C0042373       106   \n",
       "25                                   Diabetes  C0011847      1030   \n",
       "165                                  Fungemia  C0085082       117   \n",
       "123                               Hepatitis B  C0019163       166   \n",
       "108              Chronic Kidney Insufficiency  C0403447       205   \n",
       "125                    Gallstone pancreatitis  C0521614       165   \n",
       "33                Chronic respiratory failure  C0264492       811   \n",
       "115                  Heart Failure, Diastolic  C1135196       191   \n",
       "57                             Pressure Ulcer  C0011127       470   \n",
       "45   Diabetes Mellitus, Non-Insulin-Dependent  C0011860       665   \n",
       "81                                    Obesity  C0028754       307   \n",
       "139                             Gastroparesis  C0152020       148   \n",
       "\n",
       "     Comorbidities_proportion  Number_y  Gen_pop_proportion  Odds_Ratio  \n",
       "150                  0.000989        70            0.000115    8.637903  \n",
       "178                  0.000845        79            0.000129    6.535200  \n",
       "118                  0.001377       140            0.000229    6.013310  \n",
       "183                  0.000829        87            0.000142    5.827339  \n",
       "95                   0.001895       203            0.000332    5.705140  \n",
       "145                  0.001035       126            0.000206    5.020320  \n",
       "106                  0.001598       205            0.000335    4.764622  \n",
       "92                   0.001933       266            0.000435    4.441351  \n",
       "188                  0.000807       133            0.000218    3.706954  \n",
       "25                   0.007838      1343            0.002197    3.567174  \n",
       "165                  0.000890       153            0.000250    3.556784  \n",
       "123                  0.001263       242            0.000396    3.190478  \n",
       "108                  0.001560       303            0.000496    3.146837  \n",
       "125                  0.001256       245            0.000401    3.132426  \n",
       "33                   0.006171      1219            0.001994    3.094427  \n",
       "115                  0.001453       289            0.000473    3.073962  \n",
       "57                   0.003576       738            0.001207    2.962133  \n",
       "45                   0.005060      1052            0.001721    2.940146  \n",
       "81                   0.002336       499            0.000816    2.861547  \n",
       "139                  0.001126       243            0.000398    2.832817  "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "prob_list = ['Diabetes Mellitus', 'Peripheral Vascular Diseases']\n",
    "watch_out_for_these = comorbidities_of(prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "# watch_out_for_these.loc[:,['Description', 'CUI', 'Odds_Ratio']]\n",
    "watch_out_for_these"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "65c0f42c-0313-4af4-b5d8-d76a964b45f6",
   "metadata": {},
   "source": [
    "### Based on problem CUI"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "302d3bfe-5fa1-4bf5-9b70-b8b973afa44a",
   "metadata": {},
   "source": [
    "#### Find CUIs for the problem(s) of interest"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "04d0e330-2e5d-480b-a45b-f8c04494f7c0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function that conducts a fuzzy fulltext search on an index of UMLS strings\n",
    "\n",
    "def string_umls_search_problems(target):\n",
    "    query = '''\n",
    "    CALL db.index.fulltext.queryNodes(\"Pt_Problems\", 'description:{target}') YIELD node, score\n",
    "    RETURN node.description as Description, node.cui AS cui, count(node) as freq, score\n",
    "    LIMIT 10'''.format(target=target)\n",
    "    data = session.run(query)\n",
    "    return pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "31f81819-13e9-4d33-99dc-cd755588a558",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.04702615737915039 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Description</th>\n",
       "      <th>cui</th>\n",
       "      <th>freq</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Diabetes Mellitus</td>\n",
       "      <td>C0011849</td>\n",
       "      <td>4865</td>\n",
       "      <td>3.926992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Diabetes Mellitus, Insulin-Dependent</td>\n",
       "      <td>C0011854</td>\n",
       "      <td>1412</td>\n",
       "      <td>2.766761</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Diabetes Mellitus, Non-Insulin-Dependent</td>\n",
       "      <td>C0011860</td>\n",
       "      <td>1717</td>\n",
       "      <td>2.410647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Gastroparesis due to diabetes mellitus</td>\n",
       "      <td>C0267176</td>\n",
       "      <td>13</td>\n",
       "      <td>2.410647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Diabetes</td>\n",
       "      <td>C0011847</td>\n",
       "      <td>2373</td>\n",
       "      <td>2.408763</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Diabetes Insipidus</td>\n",
       "      <td>C0011848</td>\n",
       "      <td>78</td>\n",
       "      <td>1.903710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Brittle diabetes</td>\n",
       "      <td>C0342302</td>\n",
       "      <td>4</td>\n",
       "      <td>1.903710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Central Diabetes Insipidus</td>\n",
       "      <td>C0687720</td>\n",
       "      <td>2</td>\n",
       "      <td>1.573739</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Diabetes with coma (disorder)</td>\n",
       "      <td>C1263960</td>\n",
       "      <td>1</td>\n",
       "      <td>1.341258</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                Description       cui  freq     score\n",
       "0                         Diabetes Mellitus  C0011849  4865  3.926992\n",
       "1      Diabetes Mellitus, Insulin-Dependent  C0011854  1412  2.766761\n",
       "2  Diabetes Mellitus, Non-Insulin-Dependent  C0011860  1717  2.410647\n",
       "3    Gastroparesis due to diabetes mellitus  C0267176    13  2.410647\n",
       "4                                  Diabetes  C0011847  2373  2.408763\n",
       "5                        Diabetes Insipidus  C0011848    78  1.903710\n",
       "6                          Brittle diabetes  C0342302     4  1.903710\n",
       "7                Central Diabetes Insipidus  C0687720     2  1.573739\n",
       "8             Diabetes with coma (disorder)  C1263960     1  1.341258"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let user type in free text the name of the problem\n",
    "start_time = time.time()\n",
    "result = string_umls_search_problems('Diabetes Mellitus')\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "\n",
    "# Return a list of terms that may match the problem the user has identified\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3031635c-45d4-4223-884d-cf668fca22c6",
   "metadata": {},
   "source": [
    "#### Find likely comorbidities of the problem"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "6c136820-5817-4895-8879-7581dff3b9fd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def comorbidities_of_CUI(cui_prob_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WHERE prob1.cui in {cui_prob_list}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (patients)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    comorbidities = session.run(query)\n",
    "    comorbidities = pd.DataFrame([dict(record) for record in comorbidities])\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (excluded:Problem)\n",
    "    WHERE excluded.cui in {cui_prob_list}\n",
    "    WITH collect(excluded) as excluded\n",
    "    MATCH (pt:Patients)-[:HAS_PROBLEM]->(prob:Problem)\n",
    "    WITH excluded, pt, collect(prob) as problems\n",
    "    WHERE NONE (prob in problems where prob in excluded)\n",
    "    MATCH (pt)-[:HAS_PROBLEM]-(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    gen_problems = session.run(query)\n",
    "    gen_problems = pd.DataFrame([dict(record) for record in gen_problems])\n",
    "    \n",
    "    gen_pop_total = sum(gen_problems['Number'])\n",
    "    gen_problems['Gen_pop_proportion'] = gen_problems['Number']/gen_pop_total\n",
    "    \n",
    "    gen_problems = gen_problems[gen_problems['Number'] > 50]\n",
    "    \n",
    "    comorb_total = sum(comorbidities['Number'])\n",
    "    comorbidities['Comorbidities_proportion'] = comorbidities['Number']/comorb_total\n",
    "    \n",
    "    comorbidities = comorbidities[comorbidities['Number'] > 200/len(cui_prob_list)]\n",
    "    \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    comorbidities = pd.merge(comorbidities, gen_problems, on=['CUI', 'Description'])\n",
    "    \n",
    "    comorbidities['Odds_Ratio'] = (comorbidities['Comorbidities_proportion']/comorbidities['Gen_pop_proportion'])\n",
    "    comorbidities.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "    return comorbidities.loc[:,['Description', 'Odds_Ratio']].head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "5ee4025b-e063-4030-acaa-e01a6c3fbc76",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Description</th>\n",
       "      <th>Odds_Ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>Pulmonary Hypertension</td>\n",
       "      <td>4.757166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>103</th>\n",
       "      <td>Heart Failure, Diastolic</td>\n",
       "      <td>4.475324</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Heart failure</td>\n",
       "      <td>4.147978</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>Aortic Valve Stenosis</td>\n",
       "      <td>3.972401</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>Obesity</td>\n",
       "      <td>3.316616</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>Cardiomyopathies</td>\n",
       "      <td>3.278133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Glaucoma</td>\n",
       "      <td>2.723645</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>Coronary Artery Disease</td>\n",
       "      <td>2.711165</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>Normocytic anemia</td>\n",
       "      <td>2.621233</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Chronic anemia</td>\n",
       "      <td>2.478086</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Shock, Cardiogenic</td>\n",
       "      <td>2.472483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>Coronary Arteriosclerosis</td>\n",
       "      <td>2.469501</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>Chronic Kidney Diseases</td>\n",
       "      <td>2.425610</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>Colitis</td>\n",
       "      <td>2.411671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>Peripheral Vascular Diseases</td>\n",
       "      <td>2.408711</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>Non STEMI</td>\n",
       "      <td>2.305686</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>104</th>\n",
       "      <td>Pneumonitis</td>\n",
       "      <td>2.279057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Gout</td>\n",
       "      <td>2.221754</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Urinary tract infection</td>\n",
       "      <td>2.096220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Dyspnea</td>\n",
       "      <td>2.057269</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      Description  Odds_Ratio\n",
       "69         Pulmonary Hypertension    4.757166\n",
       "103      Heart Failure, Diastolic    4.475324\n",
       "12                  Heart failure    4.147978\n",
       "67          Aortic Valve Stenosis    3.972401\n",
       "75                        Obesity    3.316616\n",
       "50               Cardiomyopathies    3.278133\n",
       "90                       Glaucoma    2.723645\n",
       "68        Coronary Artery Disease    2.711165\n",
       "79              Normocytic anemia    2.621233\n",
       "41                 Chronic anemia    2.478086\n",
       "62             Shock, Cardiogenic    2.472483\n",
       "60      Coronary Arteriosclerosis    2.469501\n",
       "47        Chronic Kidney Diseases    2.425610\n",
       "98                        Colitis    2.411671\n",
       "81   Peripheral Vascular Diseases    2.408711\n",
       "52                      Non STEMI    2.305686\n",
       "104                   Pneumonitis    2.279057\n",
       "40                           Gout    2.221754\n",
       "43        Urinary tract infection    2.096220\n",
       "21                        Dyspnea    2.057269"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cui_prob_list = ['C0018802']\n",
    "comorbidities_of_CUI(cui_prob_list)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "112aeeab-9041-45ef-a141-2829afa7987f",
   "metadata": {
    "tags": [],
    "toc-hr-collapsed": true
   },
   "source": [
    "## Input prescribed medications, output likely problems"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "ab2ce07a-0f85-452d-a862-4213bb182402",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f793d80d220>"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# # Create a fulltext index for the string property of the nodes labeled String_UMLS\n",
    "# command = '''CALL db.index.fulltext.createNodeIndex(\"Drug_Names\", [\"Prescriptions\"], [\"DRUG\"])'''\n",
    "# session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8e4ee3ba-291e-4c63-b339-fed24706143c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function that conducts a fuzzy fulltext search on an index of drug names\n",
    "\n",
    "def search_drug_names(target):\n",
    "    query = '''\n",
    "    CALL db.index.fulltext.queryNodes(\"Drug_Names\", 'DRUG:{target}') YIELD node, score\n",
    "    RETURN node.DRUG as Name, count(node.DRUG) as freq, score\n",
    "    ORDER BY freq DESC\n",
    "    LIMIT 10'''.format(target=target)\n",
    "    data = session.run(query)\n",
    "    return pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "012c0f31-3c23-439b-b1df-b1fd052e9508",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.23864102363586426 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>freq</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LeVETiracetam</td>\n",
       "      <td>6746</td>\n",
       "      <td>3.409550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Levetiracetam</td>\n",
       "      <td>2031</td>\n",
       "      <td>3.409550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>LeVETiracetam Oral Solution</td>\n",
       "      <td>234</td>\n",
       "      <td>2.196988</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>LeVETiracetam Solution</td>\n",
       "      <td>96</td>\n",
       "      <td>2.672145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>*NF* Levetiracetam</td>\n",
       "      <td>10</td>\n",
       "      <td>2.672145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Levetiracetam Solution</td>\n",
       "      <td>3</td>\n",
       "      <td>2.672145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>levetiracetam</td>\n",
       "      <td>1</td>\n",
       "      <td>3.409550</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                          Name  freq     score\n",
       "0                LeVETiracetam  6746  3.409550\n",
       "1                Levetiracetam  2031  3.409550\n",
       "2  LeVETiracetam Oral Solution   234  2.196988\n",
       "3       LeVETiracetam Solution    96  2.672145\n",
       "4           *NF* Levetiracetam    10  2.672145\n",
       "5       Levetiracetam Solution     3  2.672145\n",
       "6                levetiracetam     1  3.409550"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "result = search_drug_names('Levetiracetam~')\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "2398855a-4b26-4f48-bd7b-4cf755727344",
   "metadata": {},
   "outputs": [],
   "source": [
    "def prob_assoc_Rx(Rx_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (rx1:Prescriptions)-[:CHILD_OF]->(pt:Patients)\n",
    "    WHERE rx1.DRUG in {Rx_list}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (patients)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(Rx_list=Rx_list)\n",
    "    comorbidities = session.run(query)\n",
    "    comorbidities = pd.DataFrame([dict(record) for record in comorbidities])\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (excluded:Prescriptions)\n",
    "    WHERE excluded.DRUG in {Rx_list}\n",
    "    WITH collect(excluded) as excluded\n",
    "    MATCH (pt:Patients)<-[:CHILD_OF]-(rx:Prescriptions)\n",
    "    WITH excluded, pt, collect(rx) as prescriptions\n",
    "    WHERE NONE (rx in prescriptions where rx in excluded)\n",
    "    MATCH (pt)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(Rx_list=Rx_list)\n",
    "    gen_problems = session.run(query)\n",
    "    gen_problems = pd.DataFrame([dict(record) for record in gen_problems])\n",
    "    \n",
    "    gen_pop_total = sum(gen_problems['Number'])\n",
    "    gen_problems['Gen_pop_proportion'] = gen_problems['Number']/gen_pop_total\n",
    "    \n",
    "    gen_problems = gen_problems[gen_problems['Number'] > 50]\n",
    "    \n",
    "    comorb_total = sum(comorbidities['Number'])\n",
    "    comorbidities['Comorbidities_proportion'] = comorbidities['Number']/comorb_total\n",
    "    \n",
    "    comorbidities = comorbidities[comorbidities['Number'] > 50]\n",
    "    \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    comorbidities = pd.merge(comorbidities, gen_problems, on=['CUI', 'Description'])\n",
    "    \n",
    "    comorbidities['Odds_Ratio'] = (comorbidities['Comorbidities_proportion']/comorbidities['Gen_pop_proportion'])\n",
    "    comorbidities.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "       \n",
    "    return comorbidities.loc[:,['Description', 'Odds_Ratio']].head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "ec1d7e11-a00c-4c96-9be8-4659691223b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Description</th>\n",
       "      <th>Odds_Ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Status Epilepticus</td>\n",
       "      <td>23.713763</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>Anoxic Encephalopathy</td>\n",
       "      <td>16.514395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>135</th>\n",
       "      <td>Acute hepatitis</td>\n",
       "      <td>10.533267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Seizures</td>\n",
       "      <td>10.065789</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Epilepsy</td>\n",
       "      <td>9.750796</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>Encephalitis, St. Louis</td>\n",
       "      <td>9.142128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Hematoma, Subdural</td>\n",
       "      <td>8.543922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137</th>\n",
       "      <td>Cerebral Edema</td>\n",
       "      <td>7.543440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>152</th>\n",
       "      <td>Purpura, Thrombotic Thrombocytopenic</td>\n",
       "      <td>7.368499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>186</th>\n",
       "      <td>Thrombotic Microangiopathies</td>\n",
       "      <td>6.810465</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>177</th>\n",
       "      <td>Meningioma</td>\n",
       "      <td>6.003962</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Subarachnoid Hemorrhage</td>\n",
       "      <td>5.936691</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>119</th>\n",
       "      <td>Pancreatitis Necrotizing</td>\n",
       "      <td>5.747383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Meningitis</td>\n",
       "      <td>5.637732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>Ventricular Fibrillation</td>\n",
       "      <td>5.587021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Cerebral Hemorrhage</td>\n",
       "      <td>5.379808</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>182</th>\n",
       "      <td>bleeding/hemorrhage nos</td>\n",
       "      <td>5.164699</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Aneurysm</td>\n",
       "      <td>5.022923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150</th>\n",
       "      <td>Encephalitis</td>\n",
       "      <td>5.010941</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>161</th>\n",
       "      <td>Hydrocephalus</td>\n",
       "      <td>4.841905</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              Description  Odds_Ratio\n",
       "90                     Status Epilepticus   23.713763\n",
       "49                  Anoxic Encephalopathy   16.514395\n",
       "135                       Acute hepatitis   10.533267\n",
       "3                                Seizures   10.065789\n",
       "25                               Epilepsy    9.750796\n",
       "69                Encephalitis, St. Louis    9.142128\n",
       "28                     Hematoma, Subdural    8.543922\n",
       "137                        Cerebral Edema    7.543440\n",
       "152  Purpura, Thrombotic Thrombocytopenic    7.368499\n",
       "186          Thrombotic Microangiopathies    6.810465\n",
       "177                            Meningioma    6.003962\n",
       "39                Subarachnoid Hemorrhage    5.936691\n",
       "119              Pancreatitis Necrotizing    5.747383\n",
       "34                             Meningitis    5.637732\n",
       "168              Ventricular Fibrillation    5.587021\n",
       "42                    Cerebral Hemorrhage    5.379808\n",
       "182               bleeding/hemorrhage nos    5.164699\n",
       "87                               Aneurysm    5.022923\n",
       "150                          Encephalitis    5.010941\n",
       "161                         Hydrocephalus    4.841905"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_list = ['LeVETiracetam']\n",
    "prob_assoc_Rx(Rx_list)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "77d27ac5-448a-4326-a8ea-f4449fe3f243",
   "metadata": {},
   "source": [
    "## Input labs, output likely problems  \n",
    "\n",
    "To-do:  \n",
    "- Merge the LOINC codes and ITEMID numbers from the D_Labitems table with CUIs from UMLS concepts, using LOINC as primary key and LNC as foreign key\n",
    "- "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "71b87118-f77d-420d-a2af-6c122a324437",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f0639cdb1c0>"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# # Create a fulltext index for the string property of the nodes labeled String_UMLS\n",
    "# command = '''CALL db.index.fulltext.createNodeIndex(\"Labs\", [\"D_Labitems\"], [\"LABEL\"])'''\n",
    "# session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "4c06cb9e-0027-4600-8c42-22f525d3a186",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function that conducts a fuzzy fulltext search on an index of lab tests that have reference ranges\n",
    "\n",
    "def string_umls_search_labs(target):\n",
    "    query = '''\n",
    "    CALL db.index.fulltext.queryNodes(\"Labs\", 'LABEL:{target}') YIELD node, score\n",
    "    WHERE EXISTS(node.ref_range_lower)\n",
    "    RETURN node.LABEL as Label, node.FLUID AS Fluid, node.ITEMID as ITEMID, count(node) as Freq, score\n",
    "    ORDER BY Freq DESC'''.format(target=target)\n",
    "    data = session.run(query)\n",
    "    return pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "ef782d6d-579d-4000-8725-f956fb5d968a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.016495704650878906 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Label</th>\n",
       "      <th>Fluid</th>\n",
       "      <th>ITEMID</th>\n",
       "      <th>Freq</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Platelet Count</td>\n",
       "      <td>Blood</td>\n",
       "      <td>51265</td>\n",
       "      <td>1</td>\n",
       "      <td>2.385857</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Label  Fluid ITEMID  Freq     score\n",
       "0  Platelet Count  Blood  51265     1  2.385857"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "result = string_umls_search_labs('Platelet')\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b098c732-9e05-4435-8b9a-3f5faa07f0f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "abnl_labs_list = ['51265']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "aa8d53cc-f11e-48f4-be73-71ca132eb960",
   "metadata": {},
   "outputs": [],
   "source": [
    "def prob_assoc_abnl_lab(abnl_labs_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (lab:Labevents {{FLAG:'abnormal'}})-[:CHILD_OF]->(pt:Patients)\n",
    "    WHERE lab.ITEMID in {abnl_labs_list}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (patients)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(abnl_labs_list=abnl_labs_list)\n",
    "    comorbidities = session.run(query)\n",
    "    comorbidities = pd.DataFrame([dict(record) for record in comorbidities])\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (excluded:Prescriptions)\n",
    "    WHERE excluded.DRUG in {Rx_list}\n",
    "    WITH collect(excluded) as excluded\n",
    "    MATCH (pt:Patients)<-[:CHILD_OF]-(rx:Prescriptions)\n",
    "    WITH excluded, pt, collect(rx) as prescriptions\n",
    "    WHERE NONE (rx in prescriptions where rx in excluded)\n",
    "    MATCH (pt)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(Rx_list=Rx_list)\n",
    "    gen_problems = session.run(query)\n",
    "    gen_problems = pd.DataFrame([dict(record) for record in gen_problems])\n",
    "    \n",
    "    gen_pop_total = sum(gen_problems['Number'])\n",
    "    gen_problems['Gen_pop_proportion'] = gen_problems['Number']/gen_pop_total\n",
    "    \n",
    "    gen_problems = gen_problems[gen_problems['Number'] > 50]\n",
    "    \n",
    "    comorb_total = sum(comorbidities['Number'])\n",
    "    comorbidities['Comorbidities_proportion'] = comorbidities['Number']/comorb_total\n",
    "    \n",
    "    comorbidities = comorbidities[comorbidities['Number'] > 50]\n",
    "    \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    comorbidities = pd.merge(comorbidities, gen_problems, on=['CUI', 'Description'])\n",
    "    \n",
    "    comorbidities['Odds_Ratio'] = (comorbidities['Comorbidities_proportion']/comorbidities['Gen_pop_proportion'])\n",
    "    comorbidities.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "       \n",
    "    return comorbidities.loc[:,['Description', 'Odds_Ratio']].head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34242842-7422-468d-ae44-1ecc2612fdf7",
   "metadata": {},
   "source": [
    "---\n",
    "---  \n",
    "# Input problem list to develop plans for each problem\n",
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "750d0803-40f8-4e6f-95c1-c7fffbcf80e4",
   "metadata": {},
   "source": [
    "## Input problem, output labs likely to be abnormal  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "68f89903-456f-4297-b63a-ea71b2a7468b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def prob_assoc_abnl_lab(cui_prob_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WHERE prob1.cui in {cui_prob_list}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (d:D_Labitems)<-[:CHILD_OF]-(n:Labevents)-[:CHILD_OF]->(patients)\n",
    "    RETURN d.ITEMID AS ITEMID, d.LABEL as `Abnormal Lab`, d.FLUID as `Source`, COUNT(n.FLAG = 'abnormal') AS abnormal, COUNT(n) as total\n",
    "    ORDER BY total DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    with_prob_labs = session.run(query)\n",
    "    with_prob_labs = pd.DataFrame([dict(record) for record in with_prob_labs])\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (excluded:Problem)\n",
    "    WHERE excluded.cui in {cui_prob_list}\n",
    "    WITH collect(excluded) as excluded\n",
    "    MATCH (pt:Patients)-[:HAS_PROBLEM]->(prob:Problem)\n",
    "    WITH excluded, pt, collect(prob) as problems\n",
    "    WHERE NONE (prob in problems where prob in excluded)\n",
    "    MATCH (d:D_Labitems)<-[:CHILD_OF]-(n:Labevents)-[:CHILD_OF]->(pt)\n",
    "    RETURN d.ITEMID AS ITEMID, COUNT(n.FLAG = 'abnormal') AS abnormal, COUNT(n) as total\n",
    "    ORDER BY total DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    without_prob_labs = session.run(query)\n",
    "    without_prob_labs = pd.DataFrame([dict(record) for record in without_prob_labs])\n",
    "    \n",
    "    without_prob_labs = without_prob_labs[without_prob_labs['abnormal'] > 10]\n",
    "    without_prob_labs['without_prob_proportion_abnl'] = without_prob_labs['abnormal']/without_prob_labs['total']\n",
    "    \n",
    "    with_prob_labs = with_prob_labs[with_prob_labs['abnormal'] > 10]\n",
    "    with_prob_labs['with_prob_proportion_abnl'] = with_prob_labs['abnormal']/with_prob_labs['total']\n",
    "        \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    with_prob_labs = pd.merge(with_prob_labs, without_prob_labs, on=['ITEMID'])\n",
    "    \n",
    "    with_prob_labs['Odds_Ratio'] = (with_prob_labs['with_prob_proportion_abnl']/with_prob_labs['without_prob_proportion_abnl'])\n",
    "    with_prob_labs.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "    return with_prob_labs.loc[:,['Abnormal Lab', 'Source', 'Odds_Ratio']].head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "f7909486-a3a8-4499-9f08-91ed3f8e2662",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 7.1864094734191895 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Abnormal Lab</th>\n",
       "      <th>Source</th>\n",
       "      <th>Odds_Ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Magnesium</td>\n",
       "      <td>Blood</td>\n",
       "      <td>3.240132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Bilirubin, Total</td>\n",
       "      <td>Blood</td>\n",
       "      <td>2.982233</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>MCH</td>\n",
       "      <td>Blood</td>\n",
       "      <td>2.597554</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Platelet Count</td>\n",
       "      <td>Blood</td>\n",
       "      <td>2.577995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Sodium</td>\n",
       "      <td>Blood</td>\n",
       "      <td>2.408630</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>RDW</td>\n",
       "      <td>Blood</td>\n",
       "      <td>1.973703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Calculated Total CO2</td>\n",
       "      <td>Blood</td>\n",
       "      <td>1.965494</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Asparate Aminotransferase (AST)</td>\n",
       "      <td>Blood</td>\n",
       "      <td>1.816216</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>PTT</td>\n",
       "      <td>Blood</td>\n",
       "      <td>1.806141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>MCHC</td>\n",
       "      <td>Blood</td>\n",
       "      <td>1.782065</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Abnormal Lab Source  Odds_Ratio\n",
       "12                        Magnesium  Blood    3.240132\n",
       "21                 Bilirubin, Total  Blood    2.982233\n",
       "13                              MCH  Blood    2.597554\n",
       "10                   Platelet Count  Blood    2.577995\n",
       "0                            Sodium  Blood    2.408630\n",
       "11                              RDW  Blood    1.973703\n",
       "26             Calculated Total CO2  Blood    1.965494\n",
       "20  Asparate Aminotransferase (AST)  Blood    1.816216\n",
       "18                              PTT  Blood    1.806141\n",
       "14                             MCHC  Blood    1.782065"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "prob_CUI = ['C0023891']\n",
    "likely_abnormal_labs = prob_assoc_abnl_lab(prob_CUI)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "likely_abnormal_labs"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7f116cdc-8c36-4e29-966f-37519a244bd9",
   "metadata": {},
   "source": [
    "## Input problem, output likely prescriptions  \n",
    "  \n",
    "To-Do:\n",
    "- allow user to specify whether the patient has renal or hepatic impairment"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "f06a5aeb-0617-490a-baed-22523e4524e2",
   "metadata": {},
   "outputs": [],
   "source": [
    "def Rx_assoc_with_prob_CUI(prob_CUI):\n",
    "    \n",
    "    # Format the input problem CUI as a list\n",
    "    prob_CUI = [prob_CUI]\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WHERE prob1.cui in {prob_CUI}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (patients)<-[:CHILD_OF]-(rx:Prescriptions)\n",
    "    RETURN rx.DRUG AS Drug, count(rx.DRUG) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(prob_CUI=prob_CUI)\n",
    "    with_prob_Rx = session.run(query)\n",
    "    with_prob_Rx = pd.DataFrame([dict(record) for record in with_prob_Rx])\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WHERE NOT prob1.cui in {prob_CUI}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (patients)<-[:CHILD_OF]-(rx:Prescriptions)\n",
    "    RETURN rx.DRUG AS Drug, count(rx.DRUG) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(prob_CUI=prob_CUI)\n",
    "    without_prob_Rx = session.run(query)\n",
    "    without_prob_Rx = pd.DataFrame([dict(record) for record in without_prob_Rx])\n",
    "       \n",
    "    without_prob_total = sum(without_prob_Rx['Number'])\n",
    "    without_prob_Rx['without_prob_proportion'] = without_prob_Rx['Number']/without_prob_total\n",
    "    \n",
    "    without_prob_Rx = without_prob_Rx[without_prob_Rx['Number'] > 30]\n",
    "        \n",
    "    with_prob_total = sum(with_prob_Rx['Number'])\n",
    "    with_prob_Rx['with_prob_proportion'] = with_prob_Rx['Number']/with_prob_total\n",
    "        \n",
    "    with_prob_Rx = with_prob_Rx[with_prob_Rx['Number'] > 20]\n",
    "    \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    with_prob_Rx = pd.merge(with_prob_Rx, without_prob_Rx, on=['Drug'])\n",
    "    \n",
    "    with_prob_Rx['Odds_Ratio'] = (with_prob_Rx['with_prob_proportion']/with_prob_Rx['without_prob_proportion'])\n",
    "    with_prob_Rx.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "    return with_prob_Rx.loc[:,['Drug','Odds_Ratio']].head(10)\n",
    "#     return with_prob_Rx.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "af2c392e-9458-4b79-830c-a03104e1986c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 6.605773448944092 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Drug</th>\n",
       "      <th>Odds_Ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Tacrolimus</td>\n",
       "      <td>5.272193</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Lactulose</td>\n",
       "      <td>4.046340</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>0.9% Sodium Chloride (Mini Bag Plus)</td>\n",
       "      <td>3.276101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>MethylPREDNISolone Sodium Succ</td>\n",
       "      <td>3.169828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1/2 NS</td>\n",
       "      <td>3.122881</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Pantoprazole Sodium</td>\n",
       "      <td>2.010700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Vial</td>\n",
       "      <td>1.596330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>5% Dextrose</td>\n",
       "      <td>1.574014</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>D5W</td>\n",
       "      <td>1.423272</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Heparin Sodium</td>\n",
       "      <td>1.370536</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    Drug  Odds_Ratio\n",
       "9                             Tacrolimus    5.272193\n",
       "15                             Lactulose    4.046340\n",
       "13  0.9% Sodium Chloride (Mini Bag Plus)    3.276101\n",
       "24        MethylPREDNISolone Sodium Succ    3.169828\n",
       "18                                1/2 NS    3.122881\n",
       "22                   Pantoprazole Sodium    2.010700\n",
       "19                                  Vial    1.596330\n",
       "1                            5% Dextrose    1.574014\n",
       "5                                    D5W    1.423272\n",
       "16                        Heparin Sodium    1.370536"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "prob_CUI = 'C0348801'\n",
    "likely_Rx = Rx_assoc_with_prob_CUI(prob_CUI)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "likely_Rx"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5882ea48-fa2e-4b2d-b9e4-033a577f89b7",
   "metadata": {},
   "source": [
    "<a id='conditional_probability'></a>\n",
    "### Using Conditional Probability instead of Odds Ratio"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "2f55b9c6-b628-4a3c-9b3e-70d291b88ca8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Patients)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (probTotal:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(probTotal)) AS probTotal, ptTotal\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability\n",
    "WHERE probTotal > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "1fd22a07-7df7-426a-9cde-ec50417da7b8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each prescription in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Patients)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (RxTotal:Patients)-[:HAD]-(rx:Prescriptions)-[:INSTANCE_OF]->(b:Concept)\n",
    "WITH b.cui AS Rx_CUI, count(distinct(RxTotal)) AS RxTotal, ptTotal\n",
    "RETURN Rx_CUI, toFloat(RxTotal)/ptTotal AS RxProbability\n",
    "ORDER BY RxProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Rx_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "445bfb71-bfae-4b6e-9e8b-a3d0453bf4f0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of prescription and problem\n",
    "query = '''\n",
    "MATCH (ptTotal:Patients)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (p:Problem)<-[:HAD_PROBLEM]-(RxProbTotal:Patients)-[:HAD]-(rx:Prescriptions)-[:INSTANCE_OF]->(c:Concept)\n",
    "WITH p.cui AS Problem_CUI, c.cui AS Rx_CUI, count(distinct(RxProbTotal)) AS RxProbTotal, ptTotal\n",
    "WHERE RxProbTotal > 10\n",
    "RETURN Problem_CUI, Rx_CUI, toFloat(RxProbTotal)/ptTotal AS Rx_Problem_Probability\n",
    "ORDER BY Rx_Problem_Probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Rx_Problem_Probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "f80cd1d3-ac76-4f1e-9be6-651d070e23d2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C1321898</td>\n",
       "      <td>0.000881</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0497131</td>\n",
       "      <td>0.000494</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0013404</td>\n",
       "      <td>0.002580</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0018932</td>\n",
       "      <td>0.001913</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0002962</td>\n",
       "      <td>0.000623</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>460</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>0.001032</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>461</th>\n",
       "      <td>C1136033</td>\n",
       "      <td>0.000623</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>462</th>\n",
       "      <td>C0033036</td>\n",
       "      <td>0.000559</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>463</th>\n",
       "      <td>C0476474</td>\n",
       "      <td>0.000559</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>464</th>\n",
       "      <td>C0004626</td>\n",
       "      <td>0.000494</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>465 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Problem_CUI  problem_gen_pop_probability\n",
       "0      C1321898                     0.000881\n",
       "1      C0497131                     0.000494\n",
       "2      C0013404                     0.002580\n",
       "3      C0018932                     0.001913\n",
       "4      C0002962                     0.000623\n",
       "..          ...                          ...\n",
       "460    C0026771                     0.001032\n",
       "461    C1136033                     0.000623\n",
       "462    C0033036                     0.000559\n",
       "463    C0476474                     0.000559\n",
       "464    C0004626                     0.000494\n",
       "\n",
       "[465 rows x 2 columns]"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "problem_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "6a8d4832-6365-40e6-825c-a88c4ae07a3d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>RxProbability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C4282051</td>\n",
       "      <td>0.451763</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C4082777</td>\n",
       "      <td>0.432545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C4282061</td>\n",
       "      <td>0.384093</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C4282050</td>\n",
       "      <td>0.376182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C4281944</td>\n",
       "      <td>0.349205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1552</th>\n",
       "      <td>C0715607</td>\n",
       "      <td>0.000021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1553</th>\n",
       "      <td>C2954915</td>\n",
       "      <td>0.000021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1554</th>\n",
       "      <td>C1814207</td>\n",
       "      <td>0.000021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1555</th>\n",
       "      <td>C0715226</td>\n",
       "      <td>0.000021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1556</th>\n",
       "      <td>C0709173</td>\n",
       "      <td>0.000021</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1557 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        Rx_CUI  RxProbability\n",
       "0     C4282051       0.451763\n",
       "1     C4082777       0.432545\n",
       "2     C4282061       0.384093\n",
       "3     C4282050       0.376182\n",
       "4     C4281944       0.349205\n",
       "...        ...            ...\n",
       "1552  C0715607       0.000021\n",
       "1553  C2954915       0.000021\n",
       "1554  C1814207       0.000021\n",
       "1555  C0715226       0.000021\n",
       "1556  C0709173       0.000021\n",
       "\n",
       "[1557 rows x 2 columns]"
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "08511f50-e465-4b3c-ab46-79dbde9007e4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003697</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0009676</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003525</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C4282061</td>\n",
       "      <td>0.003482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29068</th>\n",
       "      <td>C0037088</td>\n",
       "      <td>C2955100</td>\n",
       "      <td>0.000236</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29069</th>\n",
       "      <td>C0037088</td>\n",
       "      <td>C0939651</td>\n",
       "      <td>0.000236</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29070</th>\n",
       "      <td>C0009676</td>\n",
       "      <td>C0690082</td>\n",
       "      <td>0.000236</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29071</th>\n",
       "      <td>C0034186</td>\n",
       "      <td>C2343627</td>\n",
       "      <td>0.000236</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29072</th>\n",
       "      <td>C0154286</td>\n",
       "      <td>C0691089</td>\n",
       "      <td>0.000236</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>29073 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability\n",
       "0        C0020517  C0977439                0.003805\n",
       "1        C0011860  C0977439                0.003783\n",
       "2        C0039239  C0977439                0.003697\n",
       "3        C0009676  C0977439                0.003525\n",
       "4        C0020517  C4282061                0.003482\n",
       "...           ...       ...                     ...\n",
       "29068    C0037088  C2955100                0.000236\n",
       "29069    C0037088  C0939651                0.000236\n",
       "29070    C0009676  C0690082                0.000236\n",
       "29071    C0034186  C2343627                0.000236\n",
       "29072    C0154286  C0691089                0.000236\n",
       "\n",
       "[29073 rows x 3 columns]"
      ]
     },
     "execution_count": 87,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "d3ad9ee1-1e93-44b9-bda2-c571ca634a82",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>RxProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003805</td>\n",
       "      <td>0.004364</td>\n",
       "      <td>0.314230</td>\n",
       "      <td>0.011943</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003783</td>\n",
       "      <td>0.004256</td>\n",
       "      <td>0.314230</td>\n",
       "      <td>0.011879</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003697</td>\n",
       "      <td>0.003934</td>\n",
       "      <td>0.314230</td>\n",
       "      <td>0.011621</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0009676</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003525</td>\n",
       "      <td>0.004084</td>\n",
       "      <td>0.314230</td>\n",
       "      <td>0.011075</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0600688</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.003418</td>\n",
       "      <td>0.003719</td>\n",
       "      <td>0.314230</td>\n",
       "      <td>0.010750</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26866</th>\n",
       "      <td>C0746883</td>\n",
       "      <td>C3887762</td>\n",
       "      <td>0.000258</td>\n",
       "      <td>0.000924</td>\n",
       "      <td>0.005288</td>\n",
       "      <td>0.041522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26867</th>\n",
       "      <td>C0746883</td>\n",
       "      <td>C0708786</td>\n",
       "      <td>0.000258</td>\n",
       "      <td>0.000924</td>\n",
       "      <td>0.003805</td>\n",
       "      <td>0.054545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26868</th>\n",
       "      <td>C0267963</td>\n",
       "      <td>C3887542</td>\n",
       "      <td>0.000258</td>\n",
       "      <td>0.000817</td>\n",
       "      <td>0.025107</td>\n",
       "      <td>0.009950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26869</th>\n",
       "      <td>C0019557</td>\n",
       "      <td>C2241233</td>\n",
       "      <td>0.000301</td>\n",
       "      <td>0.000817</td>\n",
       "      <td>0.016294</td>\n",
       "      <td>0.017588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26870</th>\n",
       "      <td>C0002395</td>\n",
       "      <td>C1329877</td>\n",
       "      <td>0.000301</td>\n",
       "      <td>0.000860</td>\n",
       "      <td>0.004729</td>\n",
       "      <td>0.053846</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>26871 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability  \\\n",
       "0        C0020517  C0977439                0.003805   \n",
       "1        C0011860  C0977439                0.003783   \n",
       "2        C0039239  C0977439                0.003697   \n",
       "3        C0009676  C0977439                0.003525   \n",
       "4        C0600688  C0977439                0.003418   \n",
       "...           ...       ...                     ...   \n",
       "26866    C0746883  C3887762                0.000258   \n",
       "26867    C0746883  C0708786                0.000258   \n",
       "26868    C0267963  C3887542                0.000258   \n",
       "26869    C0019557  C2241233                0.000301   \n",
       "26870    C0002395  C1329877                0.000301   \n",
       "\n",
       "       problem_gen_pop_probability  RxProbability  co_occurrance_probability  \n",
       "0                         0.004364       0.314230                   0.011943  \n",
       "1                         0.004256       0.314230                   0.011879  \n",
       "2                         0.003934       0.314230                   0.011621  \n",
       "3                         0.004084       0.314230                   0.011075  \n",
       "4                         0.003719       0.314230                   0.010750  \n",
       "...                            ...            ...                        ...  \n",
       "26866                     0.000924       0.005288                   0.041522  \n",
       "26867                     0.000924       0.003805                   0.054545  \n",
       "26868                     0.000817       0.025107                   0.009950  \n",
       "26869                     0.000817       0.016294                   0.017588  \n",
       "26870                     0.000860       0.004729                   0.053846  \n",
       "\n",
       "[26871 rows x 6 columns]"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability_merged = pd.merge(Rx_Problem_Probability, problem_gen_pop_probability, on=['Problem_CUI'])\n",
    "Rx_Problem_Probability_merged = pd.merge(Rx_Problem_Probability_merged, Rx_gen_pop_probability, on=['Rx_CUI'])\n",
    "Rx_Problem_Probability_merged['co_occurrance_probability'] = Rx_Problem_Probability_merged.Rx_Problem_Probability / (Rx_Problem_Probability_merged.problem_gen_pop_probability + Rx_Problem_Probability_merged.RxProbability)\n",
    "Rx_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "89c96900-2dcf-4709-9adc-f3cc4fe8c3aa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>RxProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>26667</th>\n",
       "      <td>C0746883</td>\n",
       "      <td>C0687786</td>\n",
       "      <td>0.000430</td>\n",
       "      <td>0.000924</td>\n",
       "      <td>0.002042</td>\n",
       "      <td>0.144928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25509</th>\n",
       "      <td>C0021400</td>\n",
       "      <td>C0875805</td>\n",
       "      <td>0.001311</td>\n",
       "      <td>0.002816</td>\n",
       "      <td>0.006621</td>\n",
       "      <td>0.138952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26535</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1584819</td>\n",
       "      <td>0.000946</td>\n",
       "      <td>0.002085</td>\n",
       "      <td>0.009652</td>\n",
       "      <td>0.080586</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25447</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.000795</td>\n",
       "      <td>0.003740</td>\n",
       "      <td>0.008856</td>\n",
       "      <td>0.063140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26805</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0690704</td>\n",
       "      <td>0.000451</td>\n",
       "      <td>0.002085</td>\n",
       "      <td>0.005267</td>\n",
       "      <td>0.061404</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3693</th>\n",
       "      <td>C0232493</td>\n",
       "      <td>C4082777</td>\n",
       "      <td>0.000236</td>\n",
       "      <td>0.000516</td>\n",
       "      <td>0.432545</td>\n",
       "      <td>0.000546</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3641</th>\n",
       "      <td>C0001418</td>\n",
       "      <td>C4082777</td>\n",
       "      <td>0.000236</td>\n",
       "      <td>0.000537</td>\n",
       "      <td>0.432545</td>\n",
       "      <td>0.000546</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3594</th>\n",
       "      <td>C0085281</td>\n",
       "      <td>C4082777</td>\n",
       "      <td>0.000236</td>\n",
       "      <td>0.000559</td>\n",
       "      <td>0.432545</td>\n",
       "      <td>0.000546</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3639</th>\n",
       "      <td>C0038663</td>\n",
       "      <td>C4082777</td>\n",
       "      <td>0.000236</td>\n",
       "      <td>0.000580</td>\n",
       "      <td>0.432545</td>\n",
       "      <td>0.000546</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2763</th>\n",
       "      <td>C0438696</td>\n",
       "      <td>C4282051</td>\n",
       "      <td>0.000236</td>\n",
       "      <td>0.000473</td>\n",
       "      <td>0.451763</td>\n",
       "      <td>0.000523</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>26871 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability  \\\n",
       "26667    C0746883  C0687786                0.000430   \n",
       "25509    C0021400  C0875805                0.001311   \n",
       "26535    C0085605  C1584819                0.000946   \n",
       "25447    C0022661  C1951501                0.000795   \n",
       "26805    C0085605  C0690704                0.000451   \n",
       "...           ...       ...                     ...   \n",
       "3693     C0232493  C4082777                0.000236   \n",
       "3641     C0001418  C4082777                0.000236   \n",
       "3594     C0085281  C4082777                0.000236   \n",
       "3639     C0038663  C4082777                0.000236   \n",
       "2763     C0438696  C4282051                0.000236   \n",
       "\n",
       "       problem_gen_pop_probability  RxProbability  co_occurrance_probability  \n",
       "26667                     0.000924       0.002042                   0.144928  \n",
       "25509                     0.002816       0.006621                   0.138952  \n",
       "26535                     0.002085       0.009652                   0.080586  \n",
       "25447                     0.003740       0.008856                   0.063140  \n",
       "26805                     0.002085       0.005267                   0.061404  \n",
       "...                            ...            ...                        ...  \n",
       "3693                      0.000516       0.432545                   0.000546  \n",
       "3641                      0.000537       0.432545                   0.000546  \n",
       "3594                      0.000559       0.432545                   0.000546  \n",
       "3639                      0.000580       0.432545                   0.000546  \n",
       "2763                      0.000473       0.451763                   0.000523  \n",
       "\n",
       "[26871 rows x 6 columns]"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability_merged.sort_values(by='co_occurrance_probability', ascending=False, inplace=True)\n",
    "Rx_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "55dbba4b-658d-4949-a2b3-ba6f53d83643",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "Rx_Problem_Probability_merged.loc[:,['Problem_CUI', 'Rx_CUI', 'co_occurrance_probability']].to_csv('Rx_Problem_co_occurrance_probability_2021_12_06.csv', index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c81db019-e521-48b2-ac08-1092effa065d",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "f0bfd770-e7d0-4281-b9fd-1c4ee9108cea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f0c33e0ab80>"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H-%M-%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///Rx_Problem_co_occurrance_probability_2021_12_06.csv\" AS COLUMN\n",
    "MATCH (prob:Concept)\n",
    "WHERE prob.cui = COLUMN.Problem_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "MATCH (rx:Concept)\n",
    "WHERE rx.cui = COLUMN.Rx_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "CREATE (prob)<-[:OCCURS_WITH {{co_occurrance_probability:COLUMN.co_occurrance_probability, source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(rx)\n",
    "'''.format(timestamp=timestamp)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0d32a41c-ddc5-49b3-9679-da317e54a98e",
   "metadata": {},
   "source": [
    "## (insufficient data) Input problem, output consults likely to be needed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "bfe99344-569a-4e3d-8db4-55b086c69fa1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# def consults_assoc_with_prob_CUI(prob_CUI):\n",
    "    \n",
    "#     # Format the input problem CUI as a list\n",
    "#     prob_CUI = [prob_CUI]\n",
    "    \n",
    "#     query = '''\n",
    "#     MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "#     WHERE prob1.cui in {prob_CUI}\n",
    "#     WITH distinct(pt) AS patients\n",
    "#     MATCH (patients)<-[:CHILD_OF]-(c:Cptevents)\n",
    "#     WHERE c.SECTIONHEADER IN [\"Evaluation and management\",\"Medicine\"]\n",
    "#     RETURN c.SUBSECTIONHEADER as Consult, COUNT(c) as Number\n",
    "#     ORDER BY Number DESC\n",
    "#     '''.format(prob_CUI=prob_CUI)\n",
    "#     with_prob_consults = session.run(query)\n",
    "#     with_prob_consults = pd.DataFrame([dict(record) for record in with_prob_consults])\n",
    "    \n",
    "#     query = '''\n",
    "#     MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "#     WHERE NOT prob1.cui in {prob_CUI}\n",
    "#     WITH distinct(pt) AS patients\n",
    "#     MATCH (patients)<-[:CHILD_OF]-(c:Cptevents)\n",
    "#     WHERE c.SECTIONHEADER IN [\"Evaluation and management\",\"Medicine\"]\n",
    "#     RETURN c.SUBSECTIONHEADER as Consult, COUNT(c) as Number\n",
    "#     ORDER BY Number DESC\n",
    "#     '''.format(prob_CUI=prob_CUI)\n",
    "#     without_prob_consults = session.run(query)\n",
    "#     without_prob_consults = pd.DataFrame([dict(record) for record in without_prob_consults])\n",
    "       \n",
    "#     without_prob_total = sum(without_prob_consults['Number'])\n",
    "#     without_prob_consults['without_prob_proportion'] = without_prob_consults['Number']/without_prob_total\n",
    "    \n",
    "#     without_prob_consults = without_prob_consults[without_prob_consults['Number'] > 5]\n",
    "        \n",
    "#     with_prob_total = sum(with_prob_consults['Number'])\n",
    "#     with_prob_consults['with_prob_proportion'] = with_prob_consults['Number']/with_prob_total\n",
    "        \n",
    "#     with_prob_consults = with_prob_consults[with_prob_consults['Number'] > 5]\n",
    "    \n",
    "#     # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "#     with_prob_consults = pd.merge(with_prob_consults, without_prob_consults, on=['Consult'])\n",
    "    \n",
    "#     with_prob_consults['Odds_Ratio'] = (with_prob_consults['with_prob_proportion']/with_prob_consults['without_prob_proportion'])\n",
    "#     with_prob_consults.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "#     return with_prob_consults.loc[:,['Consult','Odds_Ratio']].head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "e00e56f0-54f7-40c2-bd57-e3cb65432cc9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.56453537940979 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Consult</th>\n",
       "      <th>Number</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Pulmonary</td>\n",
       "      <td>204</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Critical care services</td>\n",
       "      <td>82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hospital inpatient services</td>\n",
       "      <td>55</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Consultations</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Consult  Number\n",
       "0                    Pulmonary     204\n",
       "1       Critical care services      82\n",
       "2  Hospital inpatient services      55\n",
       "3                Consultations       8"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# start_time = time.time()\n",
    "\n",
    "# prob_CUI = 'C0036341'\n",
    "# likely_consults = consults_assoc_with_prob_CUI(prob_CUI)\n",
    "\n",
    "# print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "# likely_consults"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ccb5b0d-67a0-4f56-beb8-19bf811602e9",
   "metadata": {},
   "source": [
    "## (insufficient data) Input problem, output likely imaging/procedures"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "30d005e7-43e9-414b-a65f-488820fbe1f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# def Imaging_assoc_with_prob_CUI(prob_CUI):\n",
    "    \n",
    "#     # Format the input problem CUI as a list\n",
    "#     prob_CUI = [prob_CUI]\n",
    "    \n",
    "#     query = '''\n",
    "#     MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "#     WHERE prob1.cui in {prob_CUI}\n",
    "#     WITH distinct(pt) AS patients\n",
    "#     MATCH (n:Noteevents {{CATEGORY:'Radiology'}})-[:CHILD_OF]->(patients)\n",
    "#     RETURN n.DESCRIPTION as `Imaging study`, count(n) AS Number\n",
    "#     ORDER BY Number DESC\n",
    "#     '''.format(prob_CUI=prob_CUI)\n",
    "#     with_prob_imaging = session.run(query)\n",
    "#     with_prob_imaging = pd.DataFrame([dict(record) for record in with_prob_imaging])\n",
    "    \n",
    "#     query = '''\n",
    "#     MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "#     WHERE NOT prob1.cui in {prob_CUI}\n",
    "#     WITH distinct(pt) AS patients\n",
    "#     MATCH (n:Noteevents {{CATEGORY:'Radiology'}})-[:CHILD_OF]->(patients)\n",
    "#     RETURN n.DESCRIPTION as `Imaging study`, count(n) AS Number\n",
    "#     ORDER BY Number DESC\n",
    "#     '''.format(prob_CUI=prob_CUI)\n",
    "#     without_prob_imaging = session.run(query)\n",
    "#     without_prob_imaging = pd.DataFrame([dict(record) for record in without_prob_imaging])\n",
    "       \n",
    "#     without_prob_imaging = without_prob_imaging[without_prob_imaging['Number'] > 10]\n",
    "    \n",
    "#     without_prob_total = sum(without_prob_imaging['Number'])\n",
    "#     without_prob_imaging['without_prob_proportion'] = without_prob_imaging['Number']/without_prob_total\n",
    "    \n",
    "#     with_prob_imaging = with_prob_imaging[with_prob_imaging['Number'] > 20] \n",
    "    \n",
    "#     with_prob_total = sum(with_prob_imaging['Number'])\n",
    "#     with_prob_imaging['with_prob_proportion'] = with_prob_imaging['Number']/with_prob_total\n",
    "    \n",
    "#     # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "#     with_prob_imaging = pd.merge(with_prob_imaging, without_prob_imaging, on=['Imaging study'])\n",
    "    \n",
    "#     with_prob_imaging['Odds_Ratio'] = (with_prob_imaging['with_prob_proportion']/with_prob_imaging['without_prob_proportion'])\n",
    "#     with_prob_imaging = with_prob_imaging[with_prob_imaging['Odds_Ratio'] > 2] \n",
    "#     with_prob_imaging.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "#     return with_prob_imaging.loc[:,['Imaging study', 'Odds_Ratio']].head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "00acb073-28b9-4abc-bc39-f10b0bf60fc1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.5992767810821533 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Imaging study</th>\n",
       "      <th>Number</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CHEST (PORTABLE AP)</td>\n",
       "      <td>65</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>CHEST (PA &amp; LAT)</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CT HEAD W/O CONTRAST</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CHEST PORT. LINE PLACEMENT</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PARACENTESIS DIAG. OR THERAPEUTIC</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>P BILAT LOWER EXT VEINS PORT</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>INTRO CATH SVC/IVC</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>FEE ADJUSTED IN SPECIFIC SITUATION</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>O CHEST (PORTABLE AP) IN O.R.</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>L UNILAT UP EXT VEINS US LEFT</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>72 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                         Imaging study  Number\n",
       "0                  CHEST (PORTABLE AP)      65\n",
       "1                     CHEST (PA & LAT)      22\n",
       "2                 CT HEAD W/O CONTRAST      10\n",
       "3           CHEST PORT. LINE PLACEMENT      10\n",
       "4    PARACENTESIS DIAG. OR THERAPEUTIC       9\n",
       "..                                 ...     ...\n",
       "67        P BILAT LOWER EXT VEINS PORT       1\n",
       "68                  INTRO CATH SVC/IVC       1\n",
       "69  FEE ADJUSTED IN SPECIFIC SITUATION       1\n",
       "70       O CHEST (PORTABLE AP) IN O.R.       1\n",
       "71       L UNILAT UP EXT VEINS US LEFT       1\n",
       "\n",
       "[72 rows x 2 columns]"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# start_time = time.time()\n",
    "\n",
    "# prob_CUI = 'C0024050'\n",
    "# likely_imaging = Imaging_assoc_with_prob_CUI(prob_CUI)\n",
    "\n",
    "# print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "# likely_imaging"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "88140be8-0f72-418b-b32d-e9e9767e16e9",
   "metadata": {},
   "source": [
    "---\n",
    "---\n",
    "# Draft the Assessment and Plan\n",
    "---"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "decda520-ae49-4c79-87b8-32c8c7794527",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Spinal Fractures \n",
      "\n",
      "             Drug  Odds_Ratio\n",
      "        Methadone    8.326655\n",
      "Enoxaparin Sodium    5.389038\n",
      "        Diltiazem    3.334854\n",
      "      Haloperidol    3.163094\n",
      "       PredniSONE    2.961187 \n",
      "\n",
      "\n",
      "Acute toxic hepatitis \n",
      "\n",
      "                Drug  Odds_Ratio\n",
      "0.9% Sodium Chloride    2.489616\n",
      "                  LR    2.035663\n",
      "         5% Dextrose    1.828281\n",
      "Iso-Osmotic Dextrose    1.280549\n",
      "             Insulin    1.125812 \n",
      "\n",
      "\n",
      "Contusions \n",
      "\n",
      "           Drug  Odds_Ratio\n",
      "   Thiamine HCl   26.719770\n",
      "       Diazepam   18.963217\n",
      "Multivitamin IV    8.474071\n",
      "       Thiamine    6.154144\n",
      "     FoLIC Acid    4.959846 \n",
      "\n",
      "\n",
      "Acute hepatitis \n",
      "\n",
      "                Drug  Odds_Ratio\n",
      "         5% Dextrose    1.946517\n",
      "0.9% Sodium Chloride    1.932745\n",
      "           Lorazepam    1.612829\n",
      "   Calcium Gluconate    1.528417\n",
      "                  LR    1.316507 \n",
      "\n",
      "\n",
      "Liver Cirrhosis, Alcoholic \n",
      "\n",
      "                      Drug  Odds_Ratio\n",
      "            Spironolactone   11.951182\n",
      "                Tacrolimus    9.796584\n",
      "                 Lactulose    6.731906\n",
      "Albumin 25% (12.5g / 50mL)    6.543320\n",
      "                  Thiamine    5.409129 \n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# print('Problem list summary\\n\\n', watch_out_for_these['Description'].head().to_string(index=False), '\\n\\n\\n')\n",
    "\n",
    "for problem in watch_out_for_these.head().iterrows():\n",
    "    description = problem[1][0]\n",
    "    CUI = problem[1][1]\n",
    "    print(description, '\\n')\n",
    "    print(Rx_assoc_with_prob_CUI(CUI).to_string(index=False), '\\n\\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f5074528-bf6c-49bf-be85-236e94eb0553",
   "metadata": {},
   "outputs": [],
   "source": [
    "## Return likely problem list based on prescribed medications and known problems on the problem list  \n",
    "### Strategy 1: Use problem and prescription parameters in a combined query to define the patient population"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "eb20c9ea-1d10-4d80-81d3-c679ac372b10",
   "metadata": {},
   "outputs": [],
   "source": [
    "def probs_likely_with(prob_list, Rx_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WHERE prob1.description in {prob_list}\n",
    "    WITH distinct(pt) AS patients\n",
    "    MATCH (rx:Prescriptions)-[:CHILD_OF]->(patients)\n",
    "    WHERE rx.DRUG in {Rx_list}\n",
    "    WITH distinct(patients) AS patients\n",
    "    MATCH (patients)-[:HAS_PROBLEM]->(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(prob_list=prob_list, Rx_list=Rx_list)\n",
    "    comorbidities = session.run(query)\n",
    "    comorbidities = pd.DataFrame([dict(record) for record in comorbidities])\n",
    "\n",
    "    query = '''\n",
    "    MATCH (excluded_rx:Prescriptions)\n",
    "    WHERE excluded_rx.DRUG in ['Digoxin']\n",
    "    WITH collect(excluded_rx) as excluded_rx\n",
    "\n",
    "    MATCH (excluded_prob:Problem)\n",
    "    WHERE excluded_prob.description in ['Heart failure']\n",
    "    WITH collect(excluded_prob) as excluded_prob, excluded_rx\n",
    "\n",
    "    MATCH (prob:Problem)<-[:HAS_PROBLEM]-(pt:Patients)\n",
    "    WITH excluded_rx, excluded_prob, pt, collect(prob) as problems\n",
    "    WHERE NONE (prob in problems where prob in excluded_prob)\n",
    "\n",
    "    MATCH (pt)<-[:CHILD_OF]-(rx:Prescriptions)\n",
    "    WITH excluded_rx, pt, collect(rx) as prescriptions\n",
    "    WHERE NONE (rx in prescriptions where rx in excluded_rx)\n",
    "\n",
    "    MATCH (pt)-[:HAS_PROBLEM]-(prob2:Problem)\n",
    "    RETURN prob2.description as Description, prob2.cui AS CUI, count(prob2.description) as Number\n",
    "    ORDER BY Number DESC\n",
    "    '''.format(prob_list=prob_list, Rx_list=Rx_list)\n",
    "    gen_problems = session.run(query)\n",
    "    gen_problems = pd.DataFrame([dict(record) for record in gen_problems])\n",
    "       \n",
    "    gen_pop_total = sum(gen_problems['Number'])\n",
    "    gen_problems['Gen_pop_proportion'] = gen_problems['Number']/gen_pop_total\n",
    "    \n",
    "    comorb_total = sum(comorbidities['Number'])\n",
    "    comorbidities['Comorbidities_proportion'] = comorbidities['Number']/comorb_total\n",
    "    \n",
    "    input_parameter_count = len(prob_list)+len(Rx_list)\n",
    "    comorbidities = comorbidities[comorbidities['Number'] > 50/input_parameter_count]\n",
    "    \n",
    "    # Merge the \"Gen_pop_proportion\" column from gen_problems into comorbidities\n",
    "    comorbidities = pd.merge(comorbidities, gen_problems, on=['CUI', 'Description'])\n",
    "    \n",
    "    comorbidities['Odds_Ratio'] = (comorbidities['Comorbidities_proportion']/comorbidities['Gen_pop_proportion'])\n",
    "    comorbidities.sort_values(by='Odds_Ratio', ascending=False, inplace=True)\n",
    "    \n",
    "#     return comorbidities.loc[:,['Description', 'Odds_Ratio']].head(20)\n",
    "    return comorbidities.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "060e57d0-c1bf-41b3-9b32-b58e2f68f0f4",
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "'Number'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/pandas/core/indexes/base.py\u001b[0m in \u001b[0;36mget_loc\u001b[0;34m(self, key, method, tolerance)\u001b[0m\n\u001b[1;32m   3079\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 3080\u001b[0;31m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_engine\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_loc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcasted_key\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   3081\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mKeyError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32mpandas/_libs/index.pyx\u001b[0m in \u001b[0;36mpandas._libs.index.IndexEngine.get_loc\u001b[0;34m()\u001b[0m\n",
      "\u001b[0;32mpandas/_libs/index.pyx\u001b[0m in \u001b[0;36mpandas._libs.index.IndexEngine.get_loc\u001b[0;34m()\u001b[0m\n",
      "\u001b[0;32mpandas/_libs/hashtable_class_helper.pxi\u001b[0m in \u001b[0;36mpandas._libs.hashtable.PyObjectHashTable.get_item\u001b[0;34m()\u001b[0m\n",
      "\u001b[0;32mpandas/_libs/hashtable_class_helper.pxi\u001b[0m in \u001b[0;36mpandas._libs.hashtable.PyObjectHashTable.get_item\u001b[0;34m()\u001b[0m\n",
      "\u001b[0;31mKeyError\u001b[0m: 'Number'",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[0;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-15-07ffad701b9e>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0mstart_time\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mtime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtime\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 6\u001b[0;31m \u001b[0mprobs_predicted_strategy_1\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mprobs_likely_with\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprob_list\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mRx_list\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      7\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      8\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Total runtime:\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtime\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m-\u001b[0m \u001b[0mstart_time\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"seconds\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m<ipython-input-4-6c9b662a99eb>\u001b[0m in \u001b[0;36mprobs_likely_with\u001b[0;34m(prob_list, Rx_list)\u001b[0m\n\u001b[1;32m     42\u001b[0m     \u001b[0mgen_problems\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'Gen_pop_proportion'\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgen_problems\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'Number'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m/\u001b[0m\u001b[0mgen_pop_total\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     43\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 44\u001b[0;31m     \u001b[0mcomorb_total\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msum\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcomorbidities\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'Number'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     45\u001b[0m     \u001b[0mcomorbidities\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'Comorbidities_proportion'\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcomorbidities\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'Number'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m/\u001b[0m\u001b[0mcomorb_total\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     46\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/pandas/core/frame.py\u001b[0m in \u001b[0;36m__getitem__\u001b[0;34m(self, key)\u001b[0m\n\u001b[1;32m   3022\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcolumns\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mnlevels\u001b[0m \u001b[0;34m>\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   3023\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_getitem_multilevel\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mkey\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 3024\u001b[0;31m             \u001b[0mindexer\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcolumns\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_loc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mkey\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   3025\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mis_integer\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mindexer\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   3026\u001b[0m                 \u001b[0mindexer\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m[\u001b[0m\u001b[0mindexer\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/pandas/core/indexes/base.py\u001b[0m in \u001b[0;36mget_loc\u001b[0;34m(self, key, method, tolerance)\u001b[0m\n\u001b[1;32m   3080\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_engine\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_loc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcasted_key\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   3081\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mKeyError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 3082\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mKeyError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mkey\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mfrom\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   3083\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   3084\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtolerance\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyError\u001b[0m: 'Number'"
     ]
    }
   ],
   "source": [
    "prob_list = ['Diabetes Mellitus']\n",
    "Rx_list = ['']\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "probs_predicted_strategy_1 = probs_likely_with(prob_list, Rx_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "\n",
    "probs_predicted_strategy_1"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a4261047-e6ff-4c2f-a46b-04639afa2b65",
   "metadata": {},
   "source": [
    "### Strategy 2: Generate problem lists separately for comorbidities and medication-associated problems, then combine the lists"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "34745a93-7e7b-469a-b2b5-92e8fc6d79a2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 12.874289989471436 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Description</th>\n",
       "      <th>Odds_Ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>Acute toxic hepatitis</td>\n",
       "      <td>66.102276</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>Spinal Fractures</td>\n",
       "      <td>51.071877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>244</th>\n",
       "      <td>Abdominal Compartment Syndrome</td>\n",
       "      <td>46.373070</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>251</th>\n",
       "      <td>Fungemia</td>\n",
       "      <td>44.698952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Acute hepatitis</td>\n",
       "      <td>22.258930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>Liver Cirrhosis, Alcoholic</td>\n",
       "      <td>21.708253</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Alcoholic Intoxication, Chronic</td>\n",
       "      <td>19.289289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Alcohol withdrawal syndrome</td>\n",
       "      <td>13.774875</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>Pancreatitis Necrotizing</td>\n",
       "      <td>12.536638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>300</th>\n",
       "      <td>Staphylococcal Infections</td>\n",
       "      <td>11.272395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>245</th>\n",
       "      <td>Hypoalbuminemia</td>\n",
       "      <td>7.108563</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>212</th>\n",
       "      <td>Encephalitis, St. Louis</td>\n",
       "      <td>6.794950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Pancreatitis Necrotizing</td>\n",
       "      <td>6.567694</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>241</th>\n",
       "      <td>Atrial tachycardia</td>\n",
       "      <td>5.859413</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Pressure Ulcer</td>\n",
       "      <td>5.825931</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>222</th>\n",
       "      <td>Osteomyelitis</td>\n",
       "      <td>5.744868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>200</th>\n",
       "      <td>Febrile Neutropenia</td>\n",
       "      <td>5.444523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>Hepatorenal Syndrome</td>\n",
       "      <td>5.246594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>239</th>\n",
       "      <td>Compartment syndromes</td>\n",
       "      <td>4.987110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>153</th>\n",
       "      <td>Hepatorenal Syndrome</td>\n",
       "      <td>4.901446</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         Description  Odds_Ratio\n",
       "65             Acute toxic hepatitis   66.102276\n",
       "61                  Spinal Fractures   51.071877\n",
       "244   Abdominal Compartment Syndrome   46.373070\n",
       "251                         Fungemia   44.698952\n",
       "64                   Acute hepatitis   22.258930\n",
       "71        Liver Cirrhosis, Alcoholic   21.708253\n",
       "35   Alcoholic Intoxication, Chronic   19.289289\n",
       "9        Alcohol withdrawal syndrome   13.774875\n",
       "66          Pancreatitis Necrotizing   12.536638\n",
       "300        Staphylococcal Infections   11.272395\n",
       "245                  Hypoalbuminemia    7.108563\n",
       "212          Encephalitis, St. Louis    6.794950\n",
       "261         Pancreatitis Necrotizing    6.567694\n",
       "241               Atrial tachycardia    5.859413\n",
       "90                    Pressure Ulcer    5.825931\n",
       "222                    Osteomyelitis    5.744868\n",
       "200              Febrile Neutropenia    5.444523\n",
       "52              Hepatorenal Syndrome    5.246594\n",
       "239            Compartment syndromes    4.987110\n",
       "153             Hepatorenal Syndrome    4.901446"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "problems_predicted_strategy_2 = pd.concat([comorbidities_of(prob_list), prob_assoc_Rx(Rx_list)])\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "problems_predicted_strategy_2.sort_values('Odds_Ratio', ascending=False).head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f7a47bc2-cf60-459a-bb7a-26658a9d1aad",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
