{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Importing MIMIC-III v1.4 data into a graph database\n",
    "\n",
    "### About the data  \n",
    "The data were obtaind from multiple repositories on Physionet. The main body of data comes from the MIMIC-III v1.4 Clinical Database. \n",
    "\n",
    "#### MIMIC-III Clinical Database  \n",
    "Description:\n",
    "MIMIC-III is a large, freely-available database comprising deidentified health-related data associated with over forty thousand patients who stayed in critical care units of the Beth Israel Deaconess Medical Center between 2001 and 2012. The database includes information such as demographics, vital sign measurements made at the bedside (~1 data point per hour), laboratory test results, procedures, medications, caregiver notes, imaging reports, and mortality (including post-hospital discharge).   \n",
    "Published: Sept. 4, 2016. Version: 1.4  \n",
    "Data downloaded 13 February 2021 at https://physionet.org/content/mimiciii/1.4/\n",
    "\n",
    "#### Phenotype Annotations for Patient Notes in the MIMIC-III Database  \n",
    "Description:  \n",
    "\"A dataset of patient notes, all in the English language, with a focus on frequently readmitted patients, labeled with 15 clinical patient phenotypes believed to be associated with risk of recurrent Intensive Care Unit (ICU) readmission per our domain experts (co-authors LAC, PAT, DAG) as well as the literature [5-7]. Each entry in this database consists of a MIMIC-III derived Subject Identifier (\"SUBJECT_ID\", integer), a Hospital Admission Identifier (\"HADM_ID\", integer), the index from MIMIC-III v1.4 NOTEEVENTS table (\"ROW_ID\", integer), 15 Phenotypes (binary) including \"None'' and \"Unsure'', and Operator (string).\"  \n",
    "Published: March 5, 2020. Version: 1.20.03  \n",
    "Data downloaded 13 February 2021 at https://physionet.org/content/phenotype-annotations-mimic/1.20.03/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import Data into a graph database\n",
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The downloaded data consisted of the following 27 CSV files, which collectively used 46.6 GB of memory:\n",
    "- ADMISSIONS.csv\n",
    "- CALLOUT.csv\n",
    "- CAREGIVERS.csv\n",
    "- CHARTEVENTS.csv\n",
    "- CPTEVENTS.csv\n",
    "- DATETIMEEVENTS.csv\n",
    "- D_CPT.csv\n",
    "- DIAGNOSES_ICD.csv\n",
    "- D_ICD_DIAGNOSES.csv\n",
    "- D_ICD_PROCEDURES.csv\n",
    "- D_ITEMS.csv\n",
    "- D_LABITEMS.csv\n",
    "- DRGCODES.csv\n",
    "- ICUSTAYS.csv\n",
    "- INPUTEVENTS_CV.csv\n",
    "- INPUTEVENTS_MV.csv\n",
    "- LABEVENTS.csv\n",
    "- MICROBIOLOGYEVENTS.csv\n",
    "- NOTEEVENTS_ANNOTATION.csv\n",
    "- NOTEEVENTS.csv\n",
    "- OUTPUTEVENTS.csv\n",
    "- PATIENTS.csv\n",
    "- PRESCRIPTIONS.csv\n",
    "- PROCEDUREEVENTS_MV.csv\n",
    "- PROCEDURES_ICD.csv\n",
    "- SERVICES.csv\n",
    "- TRANSFERS.csv\n",
    "\n",
    "These files were placed in the Import folder of the MIMIC-III Neo4j database to make them readily available for import into the graph. The name of the file containing phenotype annotations was changed from ACTdb102003.csv to NOTEEVENTS_ANNOTATIONS.csv to improve readability."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from progressbar import ProgressBar\n",
    "pd.set_option('display.max_colwidth', None)\n",
    "import time\n",
    "import re\n",
    "import pprint\n",
    "import numpy as np\n",
    "import multiprocessing\n",
    "from multiprocessing import  Pool"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# import getpass\n",
    "# password = getpass.getpass(\"\\nPlease enter the Neo4j database password to continue \\n\")\n",
    "password = 'NikeshIsCool'\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j',password))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['ROW_ID', 'SUBJECT_ID', 'HADM_ID', 'ADMITTIME', 'DISCHTIME', 'DEATHTIME', 'ADMISSION_TYPE', 'ADMISSION_LOCATION', 'DISCHARGE_LOCATION', 'INSURANCE', 'LANGUAGE', 'RELIGION', 'MARITAL_STATUS', 'ETHNICITY', 'EDREGTIME', 'EDOUTTIME', 'DIAGNOSIS', 'HOSPITAL_EXPIRE_FLAG', 'HAS_CHARTEVENTS_DATA']\n"
     ]
    }
   ],
   "source": [
    "# Specify the location of the CSV files to import. This is the path to the /import folder in your Neo4j database. \n",
    "# Make sure your path ends with a backslash\n",
    "path = '/home/tim/.config/Neo4j Desktop/Application/relate-data/dbmss/dbms-8b11ca35-a988-4add-ac4e-3397432fb55a/import/'\n",
    "\n",
    "# Create a list of all CSV files to import\n",
    "csv_files = ['ADMISSIONS.csv', 'CALLOUT.csv', 'CAREGIVERS.csv', 'CHARTEVENTS.csv', 'CPTEVENTS.csv', 'DATETIMEEVENTS.csv', 'D_CPT.csv', 'DIAGNOSES_ICD.csv', 'D_ICD_DIAGNOSES.csv', 'D_ICD_PROCEDURES.csv', 'D_ITEMS.csv', 'D_LABITEMS.csv', 'DRGCODES.csv', 'ICUSTAYS.csv', 'INPUTEVENTS_CV.csv', 'INPUTEVENTS_MV.csv', 'LABEVENTS.csv', 'MICROBIOLOGYEVENTS.csv', 'NOTEEVENTS_ANNOTATION.csv', 'NOTEEVENTS.csv', 'OUTPUTEVENTS.csv', 'PATIENTS.csv', 'PRESCRIPTIONS.csv', 'PROCEDUREEVENTS_MV.csv', 'PROCEDURES_ICD.csv', 'SERVICES.csv', 'TRANSFERS.csv']\n",
    "\n",
    "# Create a dictionary with file names as keys and the list of headers for each file as values \n",
    "headers_dict = {}\n",
    "for file in csv_files:\n",
    "    headers = pd.read_csv(path+file, nrows=1)\n",
    "    headers = headers.columns.tolist()\n",
    "    if not file in headers_dict:\n",
    "        headers_dict[file] = headers\n",
    "        \n",
    "# Inspect an example item in the dictionary\n",
    "print(headers_dict['ADMISSIONS.csv'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'USING PERIODIC COMMIT 100000 LOAD CSV FROM \"file:///NOTEEVENTS_ANNOTATION.csv\" AS column CREATE (n:Noteevents_Annotation {hadm_id:column[0], subject_id:column[1], row_id:column[2], advanced_cancer:column[3], advanced_heart_disease:column[4], advanced_lung_disease:column[5], alcohol_abuse:column[6], batch_id:column[7], chronic_neurological_dystrophies:column[8], chronic_pain_fibromyalgia:column[9], dementia:column[10], depression:column[11], developmental_delay_retardation:column[12], non_adherence:column[13], none:column[14], obesity:column[15], operator:column[16], other_substance_abuse:column[17], schizophrenia_and_other_psychiatric_disorders:column[18], unsure:column[19]})'"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a function that writes the string for a cypher command\n",
    "# to create nodes from each CSV file\n",
    "\n",
    "def csv_to_node(csv_file):\n",
    "    \n",
    "    # Create the node label based on the CSV file name. Place it in title case and remove the '.csv' suffix\n",
    "    label= csv_file[:-4].title() \n",
    "    \n",
    "    # Convert the CSV's headers into node properties\n",
    "    properties = '{'\n",
    "    col_index = 0\n",
    "    for header in headers_dict[csv_file]:\n",
    "        properties = properties+header+':column['+str(col_index)+'], '\n",
    "        properties = properties.replace('.','_')\n",
    "        properties = properties.lower()\n",
    "        col_index += 1\n",
    "    properties = properties[:-2]+'}' # Delete last comma of the list and add the ending curly bracket\n",
    "    \n",
    "    # Compile the complete cypher command\n",
    "    cypher = '''USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{csv_file}\" AS column CREATE (n:{label} {properties})'''.format(csv_file=csv_file, label=label, properties=properties)\n",
    "    return cypher\n",
    "\n",
    "# Generate the cypher code for a single csv file to test in the Neo4j browser\n",
    "csv_to_node('NOTEEVENTS_ANNOTATION.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create all nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# Create all nodes\n",
    "for csv_name in csv_files:\n",
    "    query = csv_to_node(csv_name)\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This operation created 397,846,346 nodes."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Re-format all datetime stamps to be recognized as datetime by Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Table</th>\n",
       "      <th>Column</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>admittime</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>deathtime</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>dischtime</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>edouttime</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>edregtime</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Table     Column\n",
       "0  Admissions  admittime\n",
       "1  Admissions  deathtime\n",
       "2  Admissions  dischtime\n",
       "3  Admissions  edouttime\n",
       "4  Admissions  edregtime"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Identify all the time fields in MIMIC-III. Note that chartdate was omitted because it's redundant\n",
    "# and it's formatted differently than all the other datetimes\n",
    "time_fields = pd.read_csv('MIMIC-III_timestamp_fields.csv')\n",
    "time_fields.loc[:,'Table'] = time_fields.loc[:,'Table'].str.title()\n",
    "time_fields.loc[:,'Column'] = time_fields.loc[:,'Column'].str.lower()\n",
    "time_fields.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set all the datetime strings as Neo4j temporal instant types\n",
    "for index, row in time_fields.iterrows():\n",
    "    Label = row[0]\n",
    "    prop = row[1]\n",
    "    query = '''\n",
    "    'MATCH (n:{Label})\n",
    "    WHERE EXISTS(n.{prop})\n",
    "    RETURN n',\n",
    "    'SET n.{prop} = datetime(REPLACE(n.{prop}, \" \", \"T\"))'\n",
    "    '''.format(Label=Label, prop=prop)\n",
    "    \n",
    "    command = 'CALL apoc.periodic.iterate('+query+', {batchSize:1000, parallel: true, iterateList:true})'\n",
    "    session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create relationships"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Prepare a CSV of the tables and foreign keys from the original MIMIC III schema:\n",
    "- Obtain foreign key constraints from https://mit-lcp.github.io/mimic-schema-spy/constraints.html\n",
    "- Copy the table into a CSV file. \n",
    "- In a spreadsheet editor, keep only the columns \"Child Column\" and \"Parent Column.\" \n",
    "- Split each of these columns on \".\" into node and foreign key columns. \n",
    "- Add a \"RELATIONSHIP_NAME\" column and create a short but descriptive relationship name for each parent-child pair\n",
    "- Save as \"mimic3_MI1_relational_schema.csv\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Child Node</th>\n",
       "      <th>Child Foreign Key</th>\n",
       "      <th>Parent Node</th>\n",
       "      <th>Parent Foreign Key</th>\n",
       "      <th>RELATIONSHIP_NAME</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>callout</td>\n",
       "      <td>hadm_id</td>\n",
       "      <td>admissions</td>\n",
       "      <td>hadm_id</td>\n",
       "      <td>OCCURRED_DURING</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>caregivers</td>\n",
       "      <td>cgid</td>\n",
       "      <td>chartevents</td>\n",
       "      <td>cgid</td>\n",
       "      <td>CHARTED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>caregivers</td>\n",
       "      <td>cgid</td>\n",
       "      <td>datetimeevents</td>\n",
       "      <td>cgid</td>\n",
       "      <td>CHARTED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>caregivers</td>\n",
       "      <td>cgid</td>\n",
       "      <td>inputevents_cv</td>\n",
       "      <td>cgid</td>\n",
       "      <td>CHARTED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>caregivers</td>\n",
       "      <td>cgid</td>\n",
       "      <td>inputevents_mv</td>\n",
       "      <td>cgid</td>\n",
       "      <td>CHARTED</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Child Node Child Foreign Key     Parent Node Parent Foreign Key  \\\n",
       "0     callout           hadm_id      admissions            hadm_id   \n",
       "1  caregivers              cgid     chartevents               cgid   \n",
       "2  caregivers              cgid  datetimeevents               cgid   \n",
       "3  caregivers              cgid  inputevents_cv               cgid   \n",
       "4  caregivers              cgid  inputevents_mv               cgid   \n",
       "\n",
       "  RELATIONSHIP_NAME  \n",
       "0   OCCURRED_DURING  \n",
       "1           CHARTED  \n",
       "2           CHARTED  \n",
       "3           CHARTED  \n",
       "4           CHARTED  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Read the CSV into a dataframe\n",
    "sql_schema = pd.read_csv('mimic3_MI1_relational_schema.csv')\n",
    "\n",
    "# Examine the first five rows\n",
    "sql_schema.iloc[:5,:]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note that the normal cypher command to create these relationships would attempt to load too much into RAM at the same time, so the computer can't run the command unless you utilize periodic execution.  \n",
    "See the Neo4j documentation for periodic execution at https://neo4j.com/labs/apoc/4.1/graph-updates/periodic-execution/ to understand the cypher command in the following cell.  \n",
    "\n",
    "Note also that we avoid creating a cartesian product with our MATCH query, which would be very computationally expensive. See Stefan Armbruster's description of how to avoid creating a cartesian product in this scenario at https://community.neo4j.com/t/reliably-create-relationships-on-12million-nodes/22223."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 of 63: Callout\n",
      "2 of 63: Caregivers\n",
      "3 of 63: Caregivers\n",
      "4 of 63: Caregivers\n",
      "5 of 63: Caregivers\n",
      "6 of 63: Caregivers\n",
      "7 of 63: Caregivers\n",
      "8 of 63: Caregivers\n",
      "9 of 63: Chartevents\n",
      "10 of 63: Chartevents\n",
      "11 of 63: Cptevents\n",
      "12 of 63: D_Icd_Diagnoses\n",
      "13 of 63: D_Icd_Procedures\n",
      "14 of 63: D_Items\n",
      "15 of 63: D_Items\n",
      "16 of 63: D_Items\n",
      "17 of 63: D_Items\n",
      "18 of 63: D_Items\n",
      "19 of 63: D_Items\n",
      "20 of 63: D_Items\n",
      "21 of 63: D_Items\n",
      "22 of 63: D_Labitems\n",
      "23 of 63: Datetimeevents\n",
      "24 of 63: Datetimeevents\n",
      "25 of 63: Diagnoses_Icd\n",
      "26 of 63: Drgcodes\n",
      "27 of 63: Icustays\n",
      "28 of 63: Inputevents_Cv\n",
      "29 of 63: Inputevents_Cv\n",
      "30 of 63: Inputevents_Mv\n",
      "31 of 63: Inputevents_Mv\n",
      "32 of 63: Labevents\n",
      "33 of 63: Microbiologyevents\n",
      "34 of 63: Noteevents\n",
      "35 of 63: Outputevents\n",
      "36 of 63: Outputevents\n",
      "37 of 63: Patients\n",
      "38 of 63: Patients\n",
      "39 of 63: Patients\n",
      "40 of 63: Patients\n",
      "41 of 63: Patients\n",
      "42 of 63: Patients\n",
      "43 of 63: Patients\n",
      "44 of 63: Patients\n",
      "45 of 63: Patients\n",
      "46 of 63: Patients\n",
      "47 of 63: Patients\n",
      "48 of 63: Patients\n",
      "49 of 63: Patients\n",
      "50 of 63: Patients\n",
      "51 of 63: Patients\n",
      "52 of 63: Patients\n",
      "53 of 63: Patients\n",
      "54 of 63: Patients\n",
      "55 of 63: Patients\n",
      "56 of 63: Prescriptions\n",
      "57 of 63: Prescriptions\n",
      "58 of 63: Procedureevents_Mv\n",
      "59 of 63: Procedureevents_Mv\n",
      "60 of 63: Procedures_Icd\n",
      "61 of 63: Services\n",
      "62 of 63: Transfers\n",
      "63 of 63: Transfers\n"
     ]
    }
   ],
   "source": [
    "# Write a cypher command for each relationship specified in the original\n",
    "# MIMIC III schema\n",
    "count = 0\n",
    "for index, row in sql_schema.iterrows():\n",
    "    child_node = row['Child Node'].title()\n",
    "    child_fk = row['Child Foreign Key'].lower()\n",
    "    parent_node = row['Parent Node'].title()\n",
    "    parent_fk = row['Parent Foreign Key'].lower()\n",
    "    RELATIONSHIP_NAME = row['RELATIONSHIP_NAME']\n",
    "\n",
    "    command = 'CALL apoc.periodic.iterate(\\\"MATCH (cn:{child_node}) MATCH (pn:{parent_node} {{{parent_fk}:cn.{child_fk}}}) RETURN cn, pn\\\", \\\"CREATE (cn)-[:{RELATIONSHIP_NAME}]->(pn)\\\", {{batchSize:10000, parallel: true, iterateList:true}})'.format(child_node=child_node, parent_node=parent_node, child_fk=child_fk, parent_fk=parent_fk, RELATIONSHIP_NAME=RELATIONSHIP_NAME)\n",
    "    session.run(command)\n",
    "    count += 1\n",
    "    print(str(count)+' of 63: '+child_node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The above code created 1,881,913,850 relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 of 3: Patients\n",
      "2 of 3: Noteevents_Annotation\n",
      "3 of 3: Noteevents_Annotation\n"
     ]
    }
   ],
   "source": [
    "# Create relationshipS for Noteevents_Annotation table\n",
    "nea_schema = [\n",
    "    ['Child Node', 'Child Foreign Key', 'Parent Node', 'Parent Foreign Key', 'RELATIONSHIP_NAME'],\n",
    "    ['Patients', 'subject_id', 'Noteevents_Annotation', 'subject_id', 'HAD'],\n",
    "    ['Noteevents_Annotation', 'hadm_id', 'Admissions', 'hadm_id', 'OCCURRED_DURING'],\n",
    "    ['Noteevents_Annotation', 'row_id', 'Noteevents', 'row_id', 'BASED_ON']\n",
    "]\n",
    "\n",
    "count = 0\n",
    "for row in nea_schema[1:]:\n",
    "    child_node = row[0].title()\n",
    "    child_fk = row[1].lower()\n",
    "    parent_node = row[2].title()\n",
    "    parent_fk = row[3].lower()\n",
    "    RELATIONSHIP_NAME = row[4]\n",
    "\n",
    "    command = 'CALL apoc.periodic.iterate(\\\"MATCH (cn:{child_node}) MATCH (pn:{parent_node} {{{parent_fk}:cn.{child_fk}}}) RETURN cn, pn\\\", \\\"CREATE (cn)-[:{RELATIONSHIP_NAME}]->(pn)\\\", {{batchSize:10000, parallel: true, iterateList:true}})'.format(child_node=child_node, parent_node=parent_node, child_fk=child_fk, parent_fk=parent_fk, RELATIONSHIP_NAME=RELATIONSHIP_NAME)\n",
    "    session.run(command)\n",
    "    count += 1\n",
    "    print(str(count)+' of 3: '+child_node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The relationship-building commands above operated on 397,848,371 nodes, creating a total of 1,881,920,681 relationships. These relationships used a total of 149GB of disk space."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<a id='UMLS_problem_creation'></a>\n",
    "### Create problem nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To-do:\n",
    "- Add CUIs to all problems"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_notes(query):\n",
    "\n",
    "    # Execute the cypher query to obtain physician notes in a Neo4j object\n",
    "    data = session.run(query)\n",
    "\n",
    "    # Convert the neo4j object into a dataframe\n",
    "    df = pd.DataFrame([dict(record) for record in data])\n",
    "\n",
    "    # Define a function that takes a full physician's note and returns only the Assessment and Plan portion\n",
    "    def isolate_AP(note):\n",
    "        # Define a regex pattern to isolate the Assessment and Plan portion of each note\n",
    "        try:\n",
    "            pattern = re.compile(r'(Assessment and Plan.*)ICU Care', re.DOTALL)\n",
    "            return re.search(pattern, note).group(1)\n",
    "        except:\n",
    "            pattern = re.compile(r'(Assessment and Plan.*)ICU \\[\\*\\*', re.DOTALL)\n",
    "            if re.search(pattern, note) != None:\n",
    "                return re.search(pattern, note).group(1)\n",
    "            else:\n",
    "                return 'No AP isolated'\n",
    "\n",
    "    # Apply the function that isolates AP to the column of the dataframe containing notes\n",
    "    df['note'] = df['note'].apply(isolate_AP)\n",
    "\n",
    "    # Check the output\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 17.153480768203735 seconds\n",
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 141624 entries, 0 to 141623\n",
      "Data columns (total 4 columns):\n",
      " #   Column      Non-Null Count   Dtype \n",
      "---  ------      --------------   ----- \n",
      " 0   note        141624 non-null  object\n",
      " 1   storetime   141624 non-null  object\n",
      " 2   subject_id  141624 non-null  object\n",
      " 3   note_id     141624 non-null  object\n",
      "dtypes: object(4)\n",
      "memory usage: 4.3+ MB\n"
     ]
    }
   ],
   "source": [
    "# Cypher query to obtain all physician notes for a patient with a given subject_id\n",
    "query = '''\n",
    "MATCH (n:Noteevents)\n",
    "WHERE n.category = \"Physician \"\n",
    "RETURN DISTINCT(n.text) AS note, n.storetime as storetime, n.subject_id as subject_id, n.row_id as note_id\n",
    "ORDER BY subject_id, storetime'''\n",
    "\n",
    "start_time = time.time()\n",
    "df = get_notes(query)\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "df.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>storetime</th>\n",
       "      <th>subject_id</th>\n",
       "      <th>note_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2142-06-02T10:22:01.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2142-06-02T12:13:26.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2142-06-03T06:53:24.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377425</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2142-06-03T06:57:49.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2142-06-03T10:35:24.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377448</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             storetime subject_id note_id\n",
       "0  2142-06-02T10:22:01.000000000+00:00      10134  377333\n",
       "1  2142-06-02T12:13:26.000000000+00:00      10134  377338\n",
       "2  2142-06-03T06:53:24.000000000+00:00      10134  377425\n",
       "3  2142-06-03T06:57:49.000000000+00:00      10134  377428\n",
       "4  2142-06-03T10:35:24.000000000+00:00      10134  377448"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (n:Noteevents)\n",
    "WHERE n.category = \"Physician \"\n",
    "RETURN n.storetime as storetime, n.subject_id as subject_id, n.row_id as note_id\n",
    "ORDER BY subject_id, storetime\n",
    "LIMIT 5'''\n",
    "\n",
    "# Execute the cypher query to obtain physician notes in a Neo4j object\n",
    "data = session.run(query)\n",
    "\n",
    "# Convert the neo4j object into a dataframe\n",
    "df = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "neo4j.time.DateTime"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(df.iloc[0].storetime)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>AUI</th>\n",
       "      <th>STR</th>\n",
       "      <th>STY</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A26634265</td>\n",
       "      <td>(131)I-Macroaggregated Albumin</td>\n",
       "      <td>Amino Acid, Peptide, or Protein</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>A26634265</td>\n",
       "      <td>(131)I-Macroaggregated Albumin</td>\n",
       "      <td>Pharmacologic Substance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>A26634265</td>\n",
       "      <td>(131)I-Macroaggregated Albumin</td>\n",
       "      <td>Indicator, Reagent, or Diagnostic Aid</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>A26634266</td>\n",
       "      <td>(131)I-MAA</td>\n",
       "      <td>Amino Acid, Peptide, or Protein</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>A26634266</td>\n",
       "      <td>(131)I-MAA</td>\n",
       "      <td>Pharmacologic Substance</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         AUI                             STR  \\\n",
       "0  A26634265  (131)I-Macroaggregated Albumin   \n",
       "1  A26634265  (131)I-Macroaggregated Albumin   \n",
       "2  A26634265  (131)I-Macroaggregated Albumin   \n",
       "3  A26634266                      (131)I-MAA   \n",
       "4  A26634266                      (131)I-MAA   \n",
       "\n",
       "                                     STY  \n",
       "0        Amino Acid, Peptide, or Protein  \n",
       "1                Pharmacologic Substance  \n",
       "2  Indicator, Reagent, or Diagnostic Aid  \n",
       "3        Amino Acid, Peptide, or Protein  \n",
       "4                Pharmacologic Substance  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "str_to_aui = pd.read_csv('MRCONSO_for_import.csv', usecols=['AUI', 'STR', 'STY'], encoding='utf-8')\n",
    "str_to_aui.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 11679703 entries, 0 to 11679702\n",
      "Data columns (total 3 columns):\n",
      " #   Column  Dtype \n",
      "---  ------  ----- \n",
      " 0   AUI     object\n",
      " 1   STR     object\n",
      " 2   STY     object\n",
      "dtypes: object(3)\n",
      "memory usage: 267.3+ MB\n"
     ]
    }
   ],
   "source": [
    "str_to_aui.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "include_types = ['Disease or Syndrome', 'Pathologic Function', 'Neoplastic Process', 'Sign or Symptom', 'Injury or Poisoning', 'Mental or Behavioral Dysfunction']\n",
    "str_to_aui = str_to_aui[str_to_aui.STY.isin(include_types)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 1338294 entries, 4491 to 11679528\n",
      "Data columns (total 3 columns):\n",
      " #   Column  Non-Null Count    Dtype \n",
      "---  ------  --------------    ----- \n",
      " 0   AUI     1338294 non-null  object\n",
      " 1   STR     1338294 non-null  object\n",
      " 2   STY     1338294 non-null  object\n",
      "dtypes: object(3)\n",
      "memory usage: 40.8+ MB\n"
     ]
    }
   ],
   "source": [
    "str_to_aui.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>AUI</th>\n",
       "      <th>STR</th>\n",
       "      <th>STY</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>5173269</th>\n",
       "      <td>A23028193</td>\n",
       "      <td>#Ankle</td>\n",
       "      <td>Injury or Poisoning</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5173270</th>\n",
       "      <td>A22851845</td>\n",
       "      <td>#Ankle</td>\n",
       "      <td>Injury or Poisoning</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5173274</th>\n",
       "      <td>A22973018</td>\n",
       "      <td>#Ankle (&amp; [tibia])</td>\n",
       "      <td>Injury or Poisoning</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5173273</th>\n",
       "      <td>A4983548</td>\n",
       "      <td>#Ankle (&amp; [tibia])</td>\n",
       "      <td>Injury or Poisoning</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5173272</th>\n",
       "      <td>A4983547</td>\n",
       "      <td>#Ankle (&amp; [tibia])</td>\n",
       "      <td>Injury or Poisoning</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2015936</th>\n",
       "      <td>A31182206</td>\n",
       "      <td>{DRINK}</td>\n",
       "      <td>Mental or Behavioral Dysfunction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1454962</th>\n",
       "      <td>A3806061</td>\n",
       "      <td>État marbré</td>\n",
       "      <td>Disease or Syndrome</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5362742</th>\n",
       "      <td>A31510015</td>\n",
       "      <td>α-gal allergy</td>\n",
       "      <td>Pathologic Function</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11410947</th>\n",
       "      <td>A31501148</td>\n",
       "      <td>α-gal sensitization</td>\n",
       "      <td>Pathologic Function</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5362744</th>\n",
       "      <td>A31515359</td>\n",
       "      <td>α-gal syndrome</td>\n",
       "      <td>Pathologic Function</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1338294 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                AUI                  STR                               STY\n",
       "5173269   A23028193               #Ankle               Injury or Poisoning\n",
       "5173270   A22851845               #Ankle               Injury or Poisoning\n",
       "5173274   A22973018   #Ankle (& [tibia])               Injury or Poisoning\n",
       "5173273    A4983548   #Ankle (& [tibia])               Injury or Poisoning\n",
       "5173272    A4983547   #Ankle (& [tibia])               Injury or Poisoning\n",
       "...             ...                  ...                               ...\n",
       "2015936   A31182206              {DRINK}  Mental or Behavioral Dysfunction\n",
       "1454962    A3806061          État marbré               Disease or Syndrome\n",
       "5362742   A31510015        α-gal allergy               Pathologic Function\n",
       "11410947  A31501148  α-gal sensitization               Pathologic Function\n",
       "5362744   A31515359       α-gal syndrome               Pathologic Function\n",
       "\n",
       "[1338294 rows x 3 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "str_to_aui.sort_values(by='STR', inplace=True)\n",
    "str_to_aui"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function that conducts a fast binary search on a sorted column of a dataframe, returning only full match results.\n",
    "\n",
    "def binary_search(dataframe, column, target):\n",
    "    range_start = 0\n",
    "    range_end = len(dataframe)-1\n",
    "    while range_start < range_end:\n",
    "        range_middle = (range_end + range_start) // 2\n",
    "        value = dataframe.iloc[range_middle][column]\n",
    "        if value == target:\n",
    "            return dataframe.iloc[range_middle]\n",
    "        elif value < target:\n",
    "            # Discard the first half of the range\n",
    "            range_start = range_middle + 1\n",
    "        else:\n",
    "            # Discard the second half of the range\n",
    "            range_end = range_middle - 1\n",
    "    # At this point range_start = range_end\n",
    "    value = dataframe.iloc[range_start][column]\n",
    "#     return value\n",
    "    if value == target:\n",
    "        return dataframe.iloc[range_start]\n",
    "    else:\n",
    "        return 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function which takes a string and returns the problem identified at the start of the string\n",
    "\n",
    "def text_to_AUIs(text):\n",
    "    \n",
    "    # Remove any non-alphanumeric characters, set the encodning to unicode, and split the text into a list of words\n",
    "    text = re.sub('[\\W_]+', ' ', text, flags=re.UNICODE)\n",
    "    text = text.strip()\n",
    "    text = text.split(' ')\n",
    "    \n",
    "    aui = None\n",
    "    \n",
    "    # Iterate through the beginning of the list of words to find the largest set of consecutive words that match aui-associated strings\n",
    "    \n",
    "    for i in reversed(range(1,7)):\n",
    "        term = ' '.join(text[:i])\n",
    "        frame = binary_search(dataframe = str_to_aui, column = 'STR', target = term)\n",
    "        \n",
    "        if type(frame) == int:\n",
    "            frame = binary_search(dataframe = str_to_aui, column = 'STR', target = term.lower())\n",
    "            if type(frame) == int:\n",
    "                frame = binary_search(dataframe = str_to_aui, column = 'STR', target = term.upper())\n",
    "                if type(frame) == int:\n",
    "                    frame = binary_search(dataframe = str_to_aui, column = 'STR', target = term.title())\n",
    "                    if type(frame) == int:\n",
    "                        pass\n",
    "                      \n",
    "                    else:\n",
    "                        return frame['AUI']\n",
    "                else:\n",
    "                    return frame['AUI']\n",
    "            else:\n",
    "                return frame['AUI']\n",
    "        else:\n",
    "            return frame['AUI']\n",
    "        \n",
    "            break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function that accepts an Assessment and Plan and extracts the problems listed\n",
    "def AP_to_problems(AP):\n",
    "    problem_set = set([])\n",
    "    if AP != 'No AP isolated':\n",
    "        rows_list = AP.split('\\n')\n",
    "        for row in rows_list:\n",
    "            aui = text_to_AUIs(row)\n",
    "            if aui != None:\n",
    "                problem_set.add(aui)\n",
    "        return problem_set\n",
    "    else:\n",
    "        return problem_set\n",
    "        \n",
    "# Define a function that applies the AP_to_problems function to the note column of a \n",
    "# dataframe and adds the result as a new \"problem\" column to the dataframe\n",
    "def add_problems_col(AP_series):\n",
    "    AUIs_series = AP_series.apply(AP_to_problems)\n",
    "    return AUIs_series\n",
    "\n",
    "# Define a function that uses parallel processing to perform a given function \n",
    "# on a given dataframe\n",
    "def parallelize_dataframe(AP_series, func):\n",
    "#     n_cores = multiprocessing.cpu_count()\n",
    "    n_cores = 11\n",
    "    series_split = np.array_split(AP_series, n_cores)\n",
    "    pool = Pool(n_cores)\n",
    "    AUIs_series = pd.concat(pool.map(func, series_split))\n",
    "    pool.close()\n",
    "    pool.join()\n",
    "    return AUIs_series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 38891.607382535934 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "AP_series = df['note']\n",
    "\n",
    "# Run the function that adds a \"problems\" column to the dataframe, using the \n",
    "# parallel processing function\n",
    "AUI_series = parallelize_dataframe(AP_series, add_problems_col)\n",
    "df['aui'] = AUI_series\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>storetime</th>\n",
       "      <th>subject_id</th>\n",
       "      <th>note_id</th>\n",
       "      <th>aui</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2142-06-02T10:22:01.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377333</td>\n",
       "      <td>A27377006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2142-06-02T10:22:01.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377333</td>\n",
       "      <td>A23970434</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2142-06-02T10:22:01.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377333</td>\n",
       "      <td>A31604611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2142-06-02T10:22:01.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377333</td>\n",
       "      <td>A1307145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2142-06-02T10:22:01.000000000+00:00</td>\n",
       "      <td>10134</td>\n",
       "      <td>377333</td>\n",
       "      <td>A0482736</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             storetime subject_id note_id        aui\n",
       "0  2142-06-02T10:22:01.000000000+00:00      10134  377333  A27377006\n",
       "0  2142-06-02T10:22:01.000000000+00:00      10134  377333  A23970434\n",
       "0  2142-06-02T10:22:01.000000000+00:00      10134  377333  A31604611\n",
       "0  2142-06-02T10:22:01.000000000+00:00      10134  377333   A1307145\n",
       "0  2142-06-02T10:22:01.000000000+00:00      10134  377333   A0482736"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Keep only the rows that have Assessment and Plan isolated\n",
    "df = df[df['note'] != 'No AP isolated']\n",
    "df = df[['storetime', 'subject_id', 'note_id', 'aui']].explode(column='aui')\n",
    "df.dropna(inplace=True)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 1033880 entries, 0 to 141623\n",
      "Data columns (total 4 columns):\n",
      " #   Column      Non-Null Count    Dtype \n",
      "---  ------      --------------    ----- \n",
      " 0   storetime   1033880 non-null  object\n",
      " 1   subject_id  1033880 non-null  object\n",
      " 2   note_id     1033880 non-null  object\n",
      " 3   aui         1033880 non-null  object\n",
      "dtypes: object(4)\n",
      "memory usage: 39.4+ MB\n"
     ]
    }
   ],
   "source": [
    "df.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "df.to_csv('problem_AUIs_from_notes_3Nov2021.csv', index=False, encoding='utf-8')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Move the CSV file to the import file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f3be4733370>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a constraint and index the Patients subject_id property\n",
    "command = '''\n",
    "CREATE CONSTRAINT Patient_subject_id IF NOT EXISTS\n",
    "ON (n:Patients)\n",
    "ASSERT n.subject_id IS UNIQUE\n",
    "'''\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f3c145ef250>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create an index on the Concepts aui property\n",
    "command = '''\n",
    "CREATE INDEX Concept_AUI IF NOT EXISTS FOR (c:Concept) ON (c.aui) \n",
    "'''\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 32.99302959442139 seconds\n"
     ]
    }
   ],
   "source": [
    "# Batch import the CSV into the database\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 1000 LOAD CSV WITH HEADERS FROM \"file:///problem_AUIs_from_notes_3Nov2021.csv\" AS csvLine\n",
    "MATCH (pt:Patients {subject_id:csvLine.subject_id})\n",
    "CREATE (prob:Problem {aui:csvLine.aui, datetime_reported:datetime(csvLine.storetime)})\n",
    "CREATE (pt)-[:HAD_PROBLEM]->(prob)\n",
    "WITH prob\n",
    "MATCH (c:Concept)\n",
    "WHERE prob.aui = c.aui\n",
    "SET prob.description = c.term\n",
    "'''\n",
    "session.run(command)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                             p.description      p.aui  number\n",
      "0                                    Renal  A14225102   37759\n",
      "1                                   Wounds  A26663781   25728\n",
      "2                       Infectious Disease   A0073713   25615\n",
      "3                      respiratory failure   A1192377   18838\n",
      "4                                   Anemia  A24094711   16117\n",
      "5                                     Pain  A29591172   11500\n",
      "6                                      HTN   A1307145   10200\n",
      "7                                       ID  A27371099    9822\n",
      "8                                      DVT  A21144946    9709\n",
      "9                                     PLAN  A16611948    9002\n",
      "10                   altered mental status  A18655171    8927\n",
      "11                                     IVF  A28801973    8925\n",
      "12                                  sepsis  A23895141    8881\n",
      "13                                     CAD  A23970434    8263\n",
      "14                     Respiratory failure  A28745064    8031\n",
      "15                     renal failure acute  A18610897    7852\n",
      "16                                    PAIN  A19383980    7752\n",
      "17                            Hypertension   A0070978    7601\n",
      "18                                     ARF  A13816495    7523\n",
      "19                                      IS  A12006040    6994\n",
      "20                               infection   A4386825    6851\n",
      "21                                      AS  A12021952    6844\n",
      "22                               pneumonia  A14157210    6830\n",
      "23                                      DM  A27377006    6804\n",
      "24                                   Blood  A14224321    6717\n",
      "25                            Leukocytosis  A22867195    6576\n",
      "26                                     PER  A11932691    5855\n",
      "27                                   fever  A18609992    5724\n",
      "28                                     but  A18579364    5713\n",
      "29                          Hypothyroidism  A23528966    5464\n",
      "30                        Thrombocytopenia  A24241108    5380\n",
      "31                     atrial fibrillation   A4386595    5198\n",
      "32                                   Fever  A29584879    5172\n",
      "33                                     WAS  A12030424    5165\n",
      "34                                    pain   A0485822    5065\n",
      "35                                 disease  A18683747    4932\n",
      "36                           renal failure   A0488302    4675\n",
      "37                                      AT  A29953164    4641\n",
      "38                                    COPD  A26607816    4600\n",
      "39                     Acute renal failure   A4717422    4563\n",
      "40                                    Endo  A21144178    4534\n",
      "41                              Aspiration   A0027134    4465\n",
      "42                               secondary  A18607948    4421\n",
      "43                                     May   A4398409    4364\n",
      "44                           Hypernatremia   A0070806    4351\n",
      "45                          Hyperlipidemia  A23870114    4341\n",
      "46                                  Sepsis  A26465055    4314\n",
      "47                                      BE   A7582387    4200\n",
      "48                   Altered mental status  A10862922    4081\n",
      "49                              Depression  A29589209    4064\n",
      "50                     Respiratory Failure   A7573409    4047\n",
      "51                                    ESRD  A26628261    3989\n",
      "52                            leukocytosis   A0482736    3937\n",
      "53                                 Hypoxia  A11976213    3936\n",
      "54                            Hyponatremia   A7560299    3912\n",
      "55                                    Afib  A14149011    3864\n",
      "56                                   Liver   A0080667    3780\n",
      "57                                     CVS  A11986985    3738\n",
      "58                                  ANEMIA   A0386218    3723\n",
      "59                                     ADD  A20241488    3664\n",
      "60                                     CAN   A7586352    3626\n",
      "61                                bleeding   A9336549    3621\n",
      "62                                     CHF  A21143454    3490\n",
      "63                                     UTI  A23976089    3487\n",
      "64                  gastrointestinal bleed  A18665935    3482\n",
      "65                                Resolved  A10815965    3470\n",
      "66                       diabetes mellitus   A9333234    3422\n",
      "67                     hypertension benign  A18636125    3335\n",
      "68                           heart failure   A4386746    3228\n",
      "69                                   shock   A0489073    3085\n",
      "70              electrolyte fluid disorder  A18617680    3043\n",
      "71                                    GERD  A26601017    3036\n",
      "72                                      HD  A12034590    2961\n",
      "73                                      MS  A21143537    2867\n",
      "74                     Atrial fibrillation   A2924254    2795\n",
      "75                    fever unknown origin  A18572778    2756\n",
      "76                                    Resp  A14224635    2726\n",
      "77                            Coagulopathy  A28805993    2719\n",
      "78                            hypertension  A23880907    2717\n",
      "79                           HYPERGLYCEMIA   A0419324    2654\n",
      "80                                  Fevers   A0059004    2639\n",
      "81                              bacteremia  A18682875    2634\n",
      "82                                delirium   A4345306    2598\n",
      "83                                     DM2  A20245139    2503\n",
      "84                                  cancer  A18590340    2397\n",
      "85                                Diabetes  A23951385    2373\n",
      "86                                   Still   A4407692    2320\n",
      "87                                   edema  A18581519    2220\n",
      "88                        thrombocytopenia   A9333624    2207\n",
      "89                               Emergency   A0053699    2188\n",
      "90                                    ARDS  A21143602    2180\n",
      "91                           HYPERNATREMIA   A0419391    2179\n",
      "92                            pancreatitis  A23975342    2155\n",
      "93                                syndrome  A23966288    2116\n",
      "94                                   bleed  A18684659    2108\n",
      "95                                       I  A31596343    2043\n",
      "96                                   wound  A18576154    2032\n",
      "97                               Pneumonia  A29592163    2016\n",
      "98                          encephalopathy  A23890248    1989\n",
      "99                                 hypoxia  A18654352    1987\n",
      "100                    Acute Renal Failure  A26635466    1984\n",
      "101                             Infectious  A12800243    1984\n",
      "102                               ischemia  A23919729    1981\n",
      "103                                  Shock  A22828005    1979\n",
      "104                                    HIV   A7560241    1977\n",
      "105                          Hyperglycemia  A27874543    1965\n",
      "106                           coagulopathy  A18664515    1958\n",
      "107                                     ED  A21143411    1933\n",
      "108                    Atrial Fibrillation  A31606996    1919\n",
      "109                   Respiratory distress  A24668567    1906\n",
      "110                               acidosis  A18663954    1899\n",
      "111                   respiratory distress   A9334752    1896\n",
      "112                                   Gout  A25685130    1880\n",
      "113                                ANXIETY  A19293701    1867\n",
      "114                           stress ulcer  A18563955    1858\n",
      "115                                   Down   A4387334    1854\n",
      "116                                 anemia  A18571155    1852\n",
      "117                  Altered Mental Status  A30296236    1849\n",
      "118                           Stress ulcer   A1608988    1840\n",
      "119                                Hypoxic  A17687464    1827\n",
      "120                           constipation   A4386650    1801\n",
      "121                           anemia acute  A18660934    1788\n",
      "122                                 fevers  A18665791    1772\n",
      "123                    acute renal failure  A18685122    1772\n",
      "124            respiratory failure chronic  A18636116    1763\n",
      "125                    pneumonia bacterial  A18571427    1724\n",
      "126    acute respiratory distress syndrome  A28273069    1723\n",
      "127                                    OSA  A24606944    1683\n",
      "128                                    ALL  A21143682    1666\n",
      "129                                     PE   A0765396    1614\n",
      "130                                 NSTEMI  A27194079    1602\n",
      "131                                    AMS  A26952230    1590\n",
      "132                         anemia chronic  A18566414    1581\n",
      "133                                SEIZURE   A0454564    1573\n",
      "134                              Cirrhosis   A9375615    1557\n",
      "135                                    PAN  A25764965    1555\n",
      "136         Acute on chronic renal failure  A25708605    1544\n",
      "137                         hypothyroidism  A11920303    1512\n",
      "138                urinary tract infection  A13567688    1491\n",
      "139                          Renal failure  A22891430    1485\n",
      "140                  myocardial infarction  A18648641    1482\n",
      "141                            Dysfunction   A7589631    1476\n",
      "142                               effusion  A23899939    1473\n",
      "143                                Anxiety  A12011274    1454\n",
      "144  CHRONIC OBSTRUCTIVE PULMONARY DISEASE   A0397632    1440\n",
      "145                        pulmonary edema   A0487758    1428\n",
      "146                               GI bleed  A25735182    1406\n",
      "147                               symptoms  A21010092    1401\n",
      "148                               Diarrhea  A26465157    1385\n",
      "149                                 Asthma  A22895985    1341\n",
      "150                             infiltrate  A18637285    1340\n",
      "151                                   Back  A31610020    1337\n",
      "152                                Dyspnea   A9332822    1318\n",
      "153                   pneumonia aspiration  A18612089    1316\n",
      "154                                Seizure  A23969246    1301\n",
      "155                                    pvd  A18669657    1289\n",
      "156                                seizure  A13903404    1268\n",
      "157                     pulmonary embolism  A18630748    1243\n",
      "158                               diarrhea   A0477698    1236\n",
      "159                                    BPH   A4739180    1233\n",
      "160                                  Wound   A8380045    1231\n",
      "161                                    DIC  A25772054    1229\n",
      "162                         abdominal pain   A9334329    1223\n",
      "163                           HYPONATREMIA  A19285719    1198\n",
      "164                           fibrillation  A23363266    1191\n",
      "165                                    GTT   A7576188    1185\n",
      "166                                   afib  A18627212    1177\n",
      "167                                    CVA   A4709814    1174\n",
      "168                       pleural effusion  A18612080    1164\n",
      "169                              effusions  A18646908    1164\n",
      "170                             Withdrawal  A29586317    1154\n",
      "171                             acute pain  A14191998    1132\n",
      "172            Hypoxic respiratory failure  A25716385    1130\n",
      "173                              agitation   A9333097    1124\n",
      "174                        volume overload  A18584295    1120\n",
      "175                     alcohol withdrawal  A13816753    1110\n",
      "176                                   MEDS  A20270254    1104\n",
      "177                                     NS  A24607851    1104\n",
      "178                coronary artery disease  A14066171    1103\n",
      "179                           Pancytopenia  A24372641    1095\n",
      "180                              Agitation  A29581141    1079\n",
      "181                                 TRAUMA  A23523198    1073\n",
      "182                                    CKD  A21145343    1060\n",
      "183         acute on chronic renal failure  A18675339    1053\n",
      "184                             depression  A18572254    1047\n",
      "185                                    MAP  A20248713    1029\n",
      "186                             hemorrhage   A0480733    1029\n",
      "187                             chest pain   A9334560    1025\n",
      "188                                 nausea   A9333457    1022\n",
      "189                           Septic shock   A0583213    1021\n",
      "190                            hypothermia  A13982576    1020\n",
      "191                         cardiac arrest   A9333938    1015\n",
      "192                     depression anxiety  A18581737     999\n",
      "193                            hypotensive  A18698881     995\n",
      "194                                  cough   A4386654     986\n",
      "195               intracerebral hemorrhage  A18664797     985\n",
      "196                               Dementia  A23868175     984\n",
      "197                           Constipation  A29588039     983\n",
      "198                         Abdominal pain  A23508050     962\n",
      "199                           chronic pain  A23918777     951\n",
      "200                               DIARRHEA   A0404632     948\n",
      "201                                ascites   A4386587     946\n",
      "202                           Pancreatitis  A22978501     945\n",
      "203                                   rash  A14077312     944\n",
      "204                                   Rash  A29580735     943\n",
      "205                              cirrhosis  A18571938     942\n",
      "206                                    SOB   A0455490     941\n",
      "207                                     IP  A11944247     937\n",
      "208                             malignancy  A23936202     935\n",
      "209                   Respiratory Distress  A24382415     934\n",
      "210                SUBARACHNOID HEMORRHAGE   A0456132     927\n",
      "211                     Metabolic acidosis  A21230314     925\n",
      "212                           HYPOGLYCEMIA   A0419652     918\n",
      "213                                  Psych  A14224637     904\n",
      "214                 hepatic encephalopathy  A13567793     904\n",
      "215                            obstruction  A18574376     899\n",
      "216                                    HEP  A11933176     896\n",
      "217                              hemolysis  A27160393     895\n",
      "218                                    PCP  A27368640     894\n",
      "219                                   Skin   A0116910     893\n",
      "220                          Renal Failure  A29774006     893\n",
      "221                                 Nausea  A29586631     891\n",
      "222                           hyponatremia   A0481440     887\n",
      "223                                primary  A31614758     887\n",
      "224                             meningitis  A23929701     887\n",
      "225          Hypoxemic respiratory failure  A27169740     886\n",
      "226                     cirrhosis of liver  A18666890     878\n",
      "227                                Abdomen   A0017726     873\n",
      "228                                dyspnea   A9333249     872\n",
      "229                                     EP   A4740665     870\n",
      "230                            Pseudomonas  A31476131     866\n",
      "231                                 arrest  A18635468     859\n",
      "232                          cholecystitis  A18627692     854\n",
      "233                                hypoxic  A23906879     853\n",
      "234                               oliguria  A18630244     849\n",
      "235                          failure acute  A18653519     847\n",
      "236                           Osteoporosis  A27932828     846\n",
      "237                              Hematuria  A27392698     846\n",
      "238                                     MG  A12031612     838\n",
      "239                                 injury  A18559323     833\n",
      "240                          hypernatremia   A0481340     829\n",
      "241                               seizures  A18556850     824\n",
      "242                               weakness  A18552946     824\n",
      "243                           Septic Shock  A21143201     809\n",
      "244                             Chest pain  A26466166     809\n",
      "245                 deep venous thrombosis  A18614422     804\n",
      "246                     acidosis metabolic  A18597358     793\n",
      "247                              hepatitis   A4386759     790\n",
      "248                                abscess  A23931356     788\n",
      "249                          alcohol abuse   A0473064     779\n",
      "250                         atrial flutter  A13733668     778\n",
      "251                                    HIT  A27929945     778\n",
      "252                                    CIS  A23906077     766\n",
      "253                           Hypoglycemia  A23873542     761\n",
      "254                    subdural hemorrhage  A18554725     754\n",
      "255                     metabolic acidosis  A13567566     752\n",
      "256                            infiltrates  A18637286     747\n",
      "257                               drainage  A12925722     743\n",
      "258                               Delirium  A29588333     743\n",
      "259                               dementia  A23974002     738\n",
      "260                                 asthma   A9333129     735\n",
      "261                  Tracheobronchomalacia  A12059929     734\n",
      "262                           endocarditis  A18591177     730\n",
      "263                                 wounds  A18650620     729\n",
      "264                              alkalosis   A4386555     726\n",
      "265                                  psych  A18626616     720\n",
      "266                            Hypothyroid   A3032655     713\n",
      "267                                    ATN  A12003991     711\n",
      "268                                DYSPNEA   A0405330     709\n",
      "269                                   AFib  A10771863     698\n",
      "270                             Bacteremia   A0028738     698\n",
      "271                            cholangitis   A9333978     691\n",
      "272                        decubitus ulcer   A0477355     690\n",
      "273                             cellulitis  A18683259     686\n",
      "274                            atelectasis   A4386592     685\n",
      "275                   Hypercholesterolemia  A23044150     684\n",
      "276                               diabetes  A29941792     682\n",
      "277                                     AF   A1577346     682\n",
      "278                               Glaucoma  A17800324     676\n",
      "279                               Seizures   A0115076     675\n",
      "280                         cardiomyopathy   A0594281     674\n",
      "281                            neutropenia   A0600646     671\n",
      "282                                anxiety   A9333116     670\n",
      "283                                    HCV  A21144217     670\n",
      "284                             Metastatic  A31606777     664\n",
      "285                         hyperlipidemia   A4386788     662\n",
      "286                                    DKA  A27933310     660\n",
      "287                           complication  A23909347     654\n",
      "288                                  Ileus  A22994818     650\n",
      "289            peripheral vascular disease  A13825005     642\n",
      "290                          Hypercalcemia  A29751790     642\n",
      "291                               stenosis  A18625398     640\n",
      "292                        PULMONARY EDEMA   A0444131     638\n",
      "293                               hematoma   A1306971     635\n",
      "294                   pericardial effusion  A14065805     635\n",
      "295                               Thoracic  A20879869     632\n",
      "296                            pneumonitis   A9334137     630\n",
      "297                               FRACTURE  A28596453     618\n",
      "298                                     DR  A10869090     607\n",
      "299                           septic shock  A18649774     600\n",
      "300                                    mrs  A18667142     595\n",
      "301                                varices   A1204292     595\n",
      "302                            dehydration   A9334005     594\n",
      "303                obstructive sleep apnea  A18565548     594\n",
      "304                                colitis  A23922143     593\n",
      "305                                febrile   A1306354     588\n",
      "306                             Legionella  A23006461     586\n",
      "307                                   MRSA  A15575275     586\n",
      "308                                   SIRS  A23946580     584\n",
      "309                      cardiogenic shock  A15199527     579\n",
      "310                                illness  A18578820     577\n",
      "311                              Methadone   A0014162     576\n",
      "312                             Klebsiella   A4386452     576\n",
      "313                                    ACS  A28606725     570\n",
      "314                   hepatorenal syndrome  A18573218     569\n",
      "315                       Seizure disorder  A26465596     569\n",
      "316                           malnutrition  A11915109     569\n",
      "317                           hyperthermia  A18647217     565\n",
      "318                                  Staph  A21145207     563\n",
      "319                                   Mass  A29381615     563\n",
      "320                           inflammation  A32069312     560\n",
      "321                             HEMORRHAGE  A25768308     558\n",
      "322                               GI Bleed  A23909831     556\n",
      "323                 pulmonary hypertension  A14065793     554\n",
      "324                           hypoglycemia   A4343693     553\n",
      "325                               fracture  A13650757     551\n",
      "326                                    CMV  A21145368     550\n",
      "327                                     HL  A29949948     547\n",
      "328                          Schizophrenia  A12059163     543\n",
      "329                Coronary Artery Disease  A12989983     542\n",
      "330                        aortic stenosis   A9333934     541\n",
      "331                               lymphoma   A4386861     533\n",
      "332                                  Heart   A0066365     530\n",
      "333                           pancytopenia   A4387285     529\n",
      "334                                    PEA  A10791886     526\n",
      "335                         Encephalopathy   A2876123     520\n",
      "336                           Chronic pain  A26510259     517\n",
      "337                 hypertension malignant  A18647838     512\n",
      "338                               Weakness  A29585226     504\n",
      "339                              influenza   A4386826     500\n",
      "340                            Hepatitis C   A0067527     499\n",
      "341                                    AML   A4343458     498\n",
      "342                              Infection  A24361891     498\n",
      "343                              dysphagia  A11919503     497\n",
      "344                     Metabolic Acidosis  A17693105     493\n",
      "345                              EMPHYSEMA  A25772070     490\n",
      "346                         Abdominal Pain  A24773941     490\n",
      "347                              Discharge  A24367542     489\n",
      "348                               disorder  A23954713     488\n",
      "349                             Leukopenia  A21230357     486\n",
      "350                            Hypothermia  A21144647     483\n",
      "351                          hypoperfusion  A18639129     478\n",
      "352                           Dyslipidemia  A26626851     474\n",
      "353                    Acute Kidney Injury  A18451296     474\n",
      "354                             HEMOPTYSIS   A0418443     474\n",
      "355                      Diabetes mellitus  A25684434     472\n",
      "356                                Bladder   A0031267     464\n",
      "357                                     vt  A18576045     460\n",
      "358                                OBESITY  A11971374     460\n",
      "359                        INTUSSUSCEPTION  A27943916     460\n",
      "360                              fractures  A18554391     456\n",
      "361                Coronary artery disease  A22892158     456\n",
      "362                    cardiac dysrhythmia  A18608593     455\n",
      "363                small bowel obstruction  A18672388     454\n",
      "364                ventricular tachycardia   A9334493     453\n",
      "365                          Consolidation  A26707672     452\n",
      "366                                    ICD  A11960131     451\n",
      "367                             blood loss   A1883066     451\n",
      "368                      Immunosuppression   A2849400     450\n",
      "369                              Sensitive  A25761046     450\n",
      "370                         fluid overload  A18677284     448\n",
      "371                            Hematemesis  A16985729     445\n",
      "372                                   IDDM  A26665535     442\n",
      "373                   aspiration pneumonia   A9333947     439\n",
      "374                                    HCP  A11935479     438\n",
      "375                  adrenal insufficiency  A13611001     435\n",
      "376                                    SVT  A28255378     432\n",
      "377                      hypotension shock  A18641377     431\n",
      "378                                pyrexia  A13857067     431\n",
      "379                       EDEMA PERIPHERAL   A0408482     429\n",
      "380                               vomiting   A9334178     427\n",
      "381                                 Trauma   A8380163     425\n",
      "382                         Cardiomyopathy   A0001711     424\n",
      "383                      COPD exacerbation  A25742648     422\n",
      "384                         upper gi bleed  A18613278     420\n",
      "385                            peritonitis  A18556219     419\n",
      "386                               headache   A9333308     414\n",
      "387                                  tumor  A23934016     412\n",
      "388                              Dysphagia   A7570181     412\n",
      "389                                    TOX  A23892120     412\n",
      "390                    parkinson s disease  A18574568     410\n",
      "391                                 weight  A14023631     408\n",
      "392                                  STEMI  A27185796     408\n",
      "393                              gastritis  A13733190     406\n",
      "394                           Eosinophilia  A20115590     405\n",
      "395                                   GVHD  A23977808     405\n",
      "396                                    ASK  A31598403     405\n",
      "397                             Hemoptysis  A29586324     402\n",
      "398                                    SLE  A22992117     400\n",
      "399                        hypoventilation   A0481473     399\n"
     ]
    }
   ],
   "source": [
    "# Let's do a sanity check on the 400 most common problems in the database:\n",
    "command = '''MATCH (p:Problem)\n",
    "RETURN p.description, p.aui, count(*) AS number \n",
    "ORDER BY number DESC\n",
    "LIMIT 400'''\n",
    "data = session.run(command)\n",
    "\n",
    "pd.set_option(\"display.max_rows\", 400)\n",
    "\n",
    "top_problems = pd.DataFrame([dict(record) for record in data])\n",
    "print(top_problems)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.description</th>\n",
       "      <th>p.aui</th>\n",
       "      <th>number</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Renal</td>\n",
       "      <td>A14225102</td>\n",
       "      <td>37759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ID</td>\n",
       "      <td>A27371099</td>\n",
       "      <td>9822</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>PLAN</td>\n",
       "      <td>A16611948</td>\n",
       "      <td>9002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>IS</td>\n",
       "      <td>A12006040</td>\n",
       "      <td>6994</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>AS</td>\n",
       "      <td>A12021952</td>\n",
       "      <td>6844</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Blood</td>\n",
       "      <td>A14224321</td>\n",
       "      <td>6717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>PER</td>\n",
       "      <td>A11932691</td>\n",
       "      <td>5855</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>but</td>\n",
       "      <td>A18579364</td>\n",
       "      <td>5713</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>WAS</td>\n",
       "      <td>A12030424</td>\n",
       "      <td>5165</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>disease</td>\n",
       "      <td>A18683747</td>\n",
       "      <td>4932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>AT</td>\n",
       "      <td>A29953164</td>\n",
       "      <td>4641</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Endo</td>\n",
       "      <td>A21144178</td>\n",
       "      <td>4534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>secondary</td>\n",
       "      <td>A18607948</td>\n",
       "      <td>4421</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>May</td>\n",
       "      <td>A4398409</td>\n",
       "      <td>4364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>BE</td>\n",
       "      <td>A7582387</td>\n",
       "      <td>4200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>CVS</td>\n",
       "      <td>A11986985</td>\n",
       "      <td>3738</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>ADD</td>\n",
       "      <td>A20241488</td>\n",
       "      <td>3664</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>CAN</td>\n",
       "      <td>A7586352</td>\n",
       "      <td>3626</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>Resolved</td>\n",
       "      <td>A10815965</td>\n",
       "      <td>3470</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Resp</td>\n",
       "      <td>A14224635</td>\n",
       "      <td>2726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>Still</td>\n",
       "      <td>A4407692</td>\n",
       "      <td>2320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>Emergency</td>\n",
       "      <td>A0053699</td>\n",
       "      <td>2188</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>syndrome</td>\n",
       "      <td>A23966288</td>\n",
       "      <td>2116</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>I</td>\n",
       "      <td>A31596343</td>\n",
       "      <td>2043</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>101</th>\n",
       "      <td>Infectious</td>\n",
       "      <td>A12800243</td>\n",
       "      <td>1984</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>ED</td>\n",
       "      <td>A21143411</td>\n",
       "      <td>1933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>Down</td>\n",
       "      <td>A4387334</td>\n",
       "      <td>1854</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>128</th>\n",
       "      <td>ALL</td>\n",
       "      <td>A21143682</td>\n",
       "      <td>1666</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>135</th>\n",
       "      <td>PAN</td>\n",
       "      <td>A25764965</td>\n",
       "      <td>1555</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>141</th>\n",
       "      <td>Dysfunction</td>\n",
       "      <td>A7589631</td>\n",
       "      <td>1476</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>147</th>\n",
       "      <td>symptoms</td>\n",
       "      <td>A21010092</td>\n",
       "      <td>1401</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150</th>\n",
       "      <td>infiltrate</td>\n",
       "      <td>A18637285</td>\n",
       "      <td>1340</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>151</th>\n",
       "      <td>Back</td>\n",
       "      <td>A31610020</td>\n",
       "      <td>1337</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>165</th>\n",
       "      <td>GTT</td>\n",
       "      <td>A7576188</td>\n",
       "      <td>1185</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>176</th>\n",
       "      <td>MEDS</td>\n",
       "      <td>A20270254</td>\n",
       "      <td>1104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>177</th>\n",
       "      <td>NS</td>\n",
       "      <td>A24607851</td>\n",
       "      <td>1104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>185</th>\n",
       "      <td>MAP</td>\n",
       "      <td>A20248713</td>\n",
       "      <td>1029</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>IP</td>\n",
       "      <td>A11944247</td>\n",
       "      <td>937</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>213</th>\n",
       "      <td>Psych</td>\n",
       "      <td>A14224637</td>\n",
       "      <td>904</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>218</th>\n",
       "      <td>PCP</td>\n",
       "      <td>A27368640</td>\n",
       "      <td>894</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>220</th>\n",
       "      <td>Renal Failure</td>\n",
       "      <td>A29774006</td>\n",
       "      <td>893</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>223</th>\n",
       "      <td>primary</td>\n",
       "      <td>A31614758</td>\n",
       "      <td>887</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>229</th>\n",
       "      <td>EP</td>\n",
       "      <td>A4740665</td>\n",
       "      <td>870</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>231</th>\n",
       "      <td>arrest</td>\n",
       "      <td>A18635468</td>\n",
       "      <td>859</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>235</th>\n",
       "      <td>failure acute</td>\n",
       "      <td>A18653519</td>\n",
       "      <td>847</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>238</th>\n",
       "      <td>MG</td>\n",
       "      <td>A12031612</td>\n",
       "      <td>838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265</th>\n",
       "      <td>psych</td>\n",
       "      <td>A18626616</td>\n",
       "      <td>720</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>298</th>\n",
       "      <td>DR</td>\n",
       "      <td>A10869090</td>\n",
       "      <td>607</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>301</th>\n",
       "      <td>varices</td>\n",
       "      <td>A1204292</td>\n",
       "      <td>595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>332</th>\n",
       "      <td>Heart</td>\n",
       "      <td>A0066365</td>\n",
       "      <td>530</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>348</th>\n",
       "      <td>disorder</td>\n",
       "      <td>A23954713</td>\n",
       "      <td>488</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>369</th>\n",
       "      <td>Sensitive</td>\n",
       "      <td>A25761046</td>\n",
       "      <td>450</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>374</th>\n",
       "      <td>HCP</td>\n",
       "      <td>A11935479</td>\n",
       "      <td>438</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>388</th>\n",
       "      <td>Dysphagia</td>\n",
       "      <td>A7570181</td>\n",
       "      <td>412</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>391</th>\n",
       "      <td>weight</td>\n",
       "      <td>A14023631</td>\n",
       "      <td>408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>395</th>\n",
       "      <td>GVHD</td>\n",
       "      <td>A23977808</td>\n",
       "      <td>405</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     p.description      p.aui  number\n",
       "0            Renal  A14225102   37759\n",
       "7               ID  A27371099    9822\n",
       "9             PLAN  A16611948    9002\n",
       "19              IS  A12006040    6994\n",
       "21              AS  A12021952    6844\n",
       "24           Blood  A14224321    6717\n",
       "26             PER  A11932691    5855\n",
       "28             but  A18579364    5713\n",
       "33             WAS  A12030424    5165\n",
       "35         disease  A18683747    4932\n",
       "37              AT  A29953164    4641\n",
       "40            Endo  A21144178    4534\n",
       "42       secondary  A18607948    4421\n",
       "43             May   A4398409    4364\n",
       "47              BE   A7582387    4200\n",
       "57             CVS  A11986985    3738\n",
       "59             ADD  A20241488    3664\n",
       "60             CAN   A7586352    3626\n",
       "65        Resolved  A10815965    3470\n",
       "76            Resp  A14224635    2726\n",
       "86           Still   A4407692    2320\n",
       "89       Emergency   A0053699    2188\n",
       "93        syndrome  A23966288    2116\n",
       "95               I  A31596343    2043\n",
       "101     Infectious  A12800243    1984\n",
       "107             ED  A21143411    1933\n",
       "115           Down   A4387334    1854\n",
       "128            ALL  A21143682    1666\n",
       "135            PAN  A25764965    1555\n",
       "141    Dysfunction   A7589631    1476\n",
       "147       symptoms  A21010092    1401\n",
       "150     infiltrate  A18637285    1340\n",
       "151           Back  A31610020    1337\n",
       "165            GTT   A7576188    1185\n",
       "176           MEDS  A20270254    1104\n",
       "177             NS  A24607851    1104\n",
       "185            MAP  A20248713    1029\n",
       "207             IP  A11944247     937\n",
       "213          Psych  A14224637     904\n",
       "218            PCP  A27368640     894\n",
       "220  Renal Failure  A29774006     893\n",
       "223        primary  A31614758     887\n",
       "229             EP   A4740665     870\n",
       "231         arrest  A18635468     859\n",
       "235  failure acute  A18653519     847\n",
       "238             MG  A12031612     838\n",
       "265          psych  A18626616     720\n",
       "298             DR  A10869090     607\n",
       "301        varices   A1204292     595\n",
       "332          Heart   A0066365     530\n",
       "348       disorder  A23954713     488\n",
       "369      Sensitive  A25761046     450\n",
       "374            HCP  A11935479     438\n",
       "388      Dysphagia   A7570181     412\n",
       "391         weight  A14023631     408\n",
       "395           GVHD  A23977808     405"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Note all the problems which appear to be artifacts of the method of extraction\n",
    "top_problems.iloc[[0, 7, 9, 19, 21, 24, 26, 28, 33, 35, 37, 40, 42, 43, 47, 57, 59, 60, 65, 76, 86, 89, 93, 95, 101, 107, 115, 128, 135, 141, 147, 150, 151, 165, 176, 177, 185, 207, 213, 218, 220, 223, 229, 231, 235, 238, 265, 298, 301, 332, 348, 369, 374, 388, 391]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f5a0c282ac0>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a list of AUIs for deletion\n",
    "delete_list = top_problems['p.aui'].to_list()\n",
    "\n",
    "# Delete the extraneous \"problems\" in the delete_list\n",
    "command = '''\n",
    "MATCH (p:Problem)\n",
    "WHERE p.aui IN {delete_list}\n",
    "DETACH DELETE p'''.format(delete_list=delete_list)\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f3be47335e0>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create an index on the Problem aui property\n",
    "command = '''\n",
    "CREATE INDEX Problem_AUI IF NOT EXISTS FOR (c:Problem) ON (c.aui) \n",
    "'''\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 7.896453142166138 seconds\n"
     ]
    }
   ],
   "source": [
    "# Connect problem nodes with an INSTANCE_OF relationship to Concept nodes\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "query = '''\n",
    "\"MATCH (p:Problem)\n",
    "MATCH (c:Concept)\n",
    "WHERE p.aui = c.aui\n",
    "RETURN p, c\",\n",
    "\"CREATE (p)-[:INSTANCE_OF]->(c)\"'''\n",
    "command = 'CALL apoc.periodic.iterate('+query+', {batchSize:1000, parallel: true, iterateList:true})'\n",
    "session.run(command)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f2e7e178be0>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Add CUIs to all problems\n",
    "command = '''\n",
    "MATCH (p:Problem)-[:INSTANCE_OF]->(c:Concept)\n",
    "SET p.cui = c.cui\n",
    "'''\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 16.77986478805542 seconds\n"
     ]
    }
   ],
   "source": [
    "# Finally, let's connect our new problem nodes to the notes from which the problems were extracted\n",
    "start_time = time.time()\n",
    "\n",
    "command = '''\n",
    "MATCH (n:Noteevents)<-[:HAD]-(pt:Patients)-[:HAD_PROBLEM]->(p:Problem)\n",
    "WHERE p.datetime_reported = n.storetime\n",
    "MERGE (n)-[:REPORTED]->(p)\n",
    "'''\n",
    "session.run(command)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<a id='MIMIC_Rx_to_UMLS'></a>\n",
    "### Connect MIMIC-III's Prescription nodes with `INSTANCE_OF` relationships to Concept nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>RXAUI</th>\n",
       "      <th>STYPE</th>\n",
       "      <th>ATN</th>\n",
       "      <th>ATV</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>829</td>\n",
       "      <td>AUI</td>\n",
       "      <td>RXN_BN_CARDINALITY</td>\n",
       "      <td>single</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>8056626</td>\n",
       "      <td>AUI</td>\n",
       "      <td>TERMUI</td>\n",
       "      <td>T005606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>8056626</td>\n",
       "      <td>AUI</td>\n",
       "      <td>LT</td>\n",
       "      <td>TRD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>8056626</td>\n",
       "      <td>AUI</td>\n",
       "      <td>TH</td>\n",
       "      <td>UNK (19XX)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>8056626</td>\n",
       "      <td>SCUI</td>\n",
       "      <td>RN</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     RXAUI STYPE                 ATN         ATV\n",
       "0      829   AUI  RXN_BN_CARDINALITY      single\n",
       "1  8056626   AUI              TERMUI     T005606\n",
       "2  8056626   AUI                  LT         TRD\n",
       "3  8056626   AUI                  TH  UNK (19XX)\n",
       "4  8056626  SCUI                  RN           0"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Add AUI as a property to MIMIC-III's medication nodes, then connect them with a \"instance_of\" relationship\n",
    "# to the UMLS concept nodes that share the same AUI. See documentation at https://www.nlm.nih.gov/research/umls/rxnorm/docs/techdoc.html\n",
    "# and https://www.nlm.nih.gov/research/umls/rxnorm/docs/techdoc.html#sat\n",
    "\n",
    "# Load the RXNSAT.RRF file, which has NDC codes mapped to AUIs\n",
    "path = '/media/sata_1TB_internal/RxNorm_full_06072021/rrf/'\n",
    "rxnsat = pd.read_csv(path + 'RXNSAT.RRF', usecols=[3,4,8,10], sep='|', header=None)\n",
    "rxnsat.columns = ['RXAUI','STYPE','ATN','ATV']\n",
    "# rxnsat = pd.read_csv(path + 'RXNSAT.RRF', sep='|', header=None)\n",
    "# rxnsat.columns = ['RXCUI','LUI','SUI','RXAUI','STYPE','CODE','ATUI','SATUI','ATN','SAB','ATV','SUPPRESS','CVF','']\n",
    "rxnsat.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>SAUI</th>\n",
       "      <th>NDC</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>60045</th>\n",
       "      <td>1473211</td>\n",
       "      <td>000395021301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60046</th>\n",
       "      <td>1473211</td>\n",
       "      <td>000395021391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60047</th>\n",
       "      <td>1473211</td>\n",
       "      <td>017317004101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60048</th>\n",
       "      <td>1473211</td>\n",
       "      <td>017317004105</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60049</th>\n",
       "      <td>1473211</td>\n",
       "      <td>049452815001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6938451</th>\n",
       "      <td>12639965</td>\n",
       "      <td>13985-433-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6938453</th>\n",
       "      <td>12640445</td>\n",
       "      <td>11695697701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6938454</th>\n",
       "      <td>12640445</td>\n",
       "      <td>13985043305</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6938455</th>\n",
       "      <td>12640445</td>\n",
       "      <td>46066006115</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6938469</th>\n",
       "      <td>12639947</td>\n",
       "      <td>70482-076-30</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1820557 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "             SAUI           NDC\n",
       "60045     1473211  000395021301\n",
       "60046     1473211  000395021391\n",
       "60047     1473211  017317004101\n",
       "60048     1473211  017317004105\n",
       "60049     1473211  049452815001\n",
       "...           ...           ...\n",
       "6938451  12639965  13985-433-05\n",
       "6938453  12640445   11695697701\n",
       "6938454  12640445   13985043305\n",
       "6938455  12640445   46066006115\n",
       "6938469  12639947  70482-076-30\n",
       "\n",
       "[1820557 rows x 2 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rxnsat = rxnsat[(rxnsat.ATN == 'NDC') & (rxnsat.STYPE == 'AUI')]\n",
    "rxnsat = rxnsat[['RXAUI', 'ATV']]\n",
    "rxnsat.columns = ['SAUI','NDC']\n",
    "rxnsat"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>AUI</th>\n",
       "      <th>SAUI</th>\n",
       "      <th>SAB</th>\n",
       "      <th>STR</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A26634265</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MSH</td>\n",
       "      <td>(131)I-Macroaggregated Albumin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>A26634266</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MSH</td>\n",
       "      <td>(131)I-MAA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>A13433185</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MSHFRE</td>\n",
       "      <td>Macroagrégats d'albumine marquée à l'iode 131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>A27488794</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MSHFRE</td>\n",
       "      <td>MAA-I 131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>A27614225</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MSHFRE</td>\n",
       "      <td>Macroagrégats d'albumine humaine marquée à l'iode 131</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         AUI  SAUI     SAB  \\\n",
       "0  A26634265   NaN     MSH   \n",
       "1  A26634266   NaN     MSH   \n",
       "2  A13433185   NaN  MSHFRE   \n",
       "3  A27488794   NaN  MSHFRE   \n",
       "4  A27614225   NaN  MSHFRE   \n",
       "\n",
       "                                                     STR  \n",
       "0                         (131)I-Macroaggregated Albumin  \n",
       "1                                             (131)I-MAA  \n",
       "2          Macroagrégats d'albumine marquée à l'iode 131  \n",
       "3                                              MAA-I 131  \n",
       "4  Macroagrégats d'albumine humaine marquée à l'iode 131  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "path = '/media/sata_1TB_internal/umls-2020AB-full/2020AB/META/'\n",
    "mrconso = pd.read_csv(path + 'MRCONSO.RRF', sep='|', usecols=[7,8,11,14], header=None, encoding='utf-8')\n",
    "mrconso.columns = ['AUI','SAUI', 'SAB', 'STR']\n",
    "mrconso.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>AUI</th>\n",
       "      <th>SAUI</th>\n",
       "      <th>SAB</th>\n",
       "      <th>STR</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>A28315139</td>\n",
       "      <td>9194921</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>1,2-dipalmitoylphosphatidylcholine</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1320</th>\n",
       "      <td>A10336090</td>\n",
       "      <td>829</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>Parlodel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1489</th>\n",
       "      <td>A31762929</td>\n",
       "      <td>12251526</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>mesna</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2183</th>\n",
       "      <td>A31685600</td>\n",
       "      <td>12254325</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>droxidopa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2304</th>\n",
       "      <td>A31642632</td>\n",
       "      <td>12254378</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>beta-alanine</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15228884</th>\n",
       "      <td>A32333738</td>\n",
       "      <td>12426223</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>Risdiplam Oral Product</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15228885</th>\n",
       "      <td>A32337625</td>\n",
       "      <td>12427168</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>satralizumab Injectable Product</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15228886</th>\n",
       "      <td>A32331662</td>\n",
       "      <td>12427754</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>Oliceridine Injectable Product</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15228887</th>\n",
       "      <td>A32331664</td>\n",
       "      <td>12427922</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>oxybate Oral Liquid Product</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15228888</th>\n",
       "      <td>A32338517</td>\n",
       "      <td>12427923</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>oxybate Oral Product</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>312700 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                AUI      SAUI     SAB                                 STR\n",
       "6         A28315139   9194921  RXNORM  1,2-dipalmitoylphosphatidylcholine\n",
       "1320      A10336090       829  RXNORM                            Parlodel\n",
       "1489      A31762929  12251526  RXNORM                               mesna\n",
       "2183      A31685600  12254325  RXNORM                           droxidopa\n",
       "2304      A31642632  12254378  RXNORM                        beta-alanine\n",
       "...             ...       ...     ...                                 ...\n",
       "15228884  A32333738  12426223  RXNORM              Risdiplam Oral Product\n",
       "15228885  A32337625  12427168  RXNORM     satralizumab Injectable Product\n",
       "15228886  A32331662  12427754  RXNORM      Oliceridine Injectable Product\n",
       "15228887  A32331664  12427922  RXNORM         oxybate Oral Liquid Product\n",
       "15228888  A32338517  12427923  RXNORM                oxybate Oral Product\n",
       "\n",
       "[312700 rows x 4 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Select only rows pertaining to RXNORM\n",
    "mrconso = mrconso[mrconso.SAB == 'RXNORM']\n",
    "\n",
    "# Set SAUI object type as int64 \n",
    "mrconso.dropna(inplace=True)\n",
    "mrconso.SAUI = mrconso.SAUI.astype('int64')\n",
    "mrconso"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>AUI</th>\n",
       "      <th>SAUI</th>\n",
       "      <th>SAB</th>\n",
       "      <th>STR</th>\n",
       "      <th>NDC</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A31661492</td>\n",
       "      <td>12330092</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution</td>\n",
       "      <td>00264775000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>A31661492</td>\n",
       "      <td>12330092</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution</td>\n",
       "      <td>00264775010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>A31661492</td>\n",
       "      <td>12330092</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution</td>\n",
       "      <td>00264775020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>A31661492</td>\n",
       "      <td>12330092</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution</td>\n",
       "      <td>00338009202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>A31661492</td>\n",
       "      <td>12330092</td>\n",
       "      <td>RXNORM</td>\n",
       "      <td>calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution</td>\n",
       "      <td>00338011702</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         AUI      SAUI     SAB  \\\n",
       "0  A31661492  12330092  RXNORM   \n",
       "1  A31661492  12330092  RXNORM   \n",
       "2  A31661492  12330092  RXNORM   \n",
       "3  A31661492  12330092  RXNORM   \n",
       "4  A31661492  12330092  RXNORM   \n",
       "\n",
       "                                                                                                                                                 STR  \\\n",
       "0  calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution   \n",
       "1  calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution   \n",
       "2  calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution   \n",
       "3  calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution   \n",
       "4  calcium chloride 0.0014 MEQ/ML / potassium chloride 0.004 MEQ/ML / sodium chloride 0.103 MEQ/ML / sodium lactate 0.028 MEQ/ML Injectable Solution   \n",
       "\n",
       "           NDC  \n",
       "0  00264775000  \n",
       "1  00264775010  \n",
       "2  00264775020  \n",
       "3  00338009202  \n",
       "4  00338011702  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Merge NDC numbers into the mrconso dataframe\n",
    "mrconso = pd.merge(mrconso, rxnsat, on=['SAUI'])\n",
    "mrconso.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 253312 entries, 0 to 253311\n",
      "Data columns (total 5 columns):\n",
      " #   Column  Non-Null Count   Dtype \n",
      "---  ------  --------------   ----- \n",
      " 0   AUI     253312 non-null  object\n",
      " 1   SAUI    253312 non-null  int64 \n",
      " 2   SAB     253312 non-null  object\n",
      " 3   STR     253312 non-null  object\n",
      " 4   NDC     253312 non-null  object\n",
      "dtypes: int64(1), object(4)\n",
      "memory usage: 11.6+ MB\n"
     ]
    }
   ],
   "source": [
    "mrconso.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get a list of all NDC codes used in MIMIC-III\n",
    "query = '''\n",
    "MATCH (rx:Prescriptions)\n",
    "WHERE size(rx.ndc) = 11\n",
    "RETURN COLLECT(DISTINCT(rx.ndc)) as NDC_list\n",
    "'''\n",
    "data = session.run(query)\n",
    "NDC_list = data.value()[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4203"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(NDC_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7fd6000ce760>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create an index on the Problem aui property\n",
    "command = '''\n",
    "CREATE INDEX Prescription_NDC IF NOT EXISTS FOR (c:Prescriptions) ON (c.ndc) \n",
    "'''\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100% |########################################################################|\n"
     ]
    }
   ],
   "source": [
    "pbar = ProgressBar()\n",
    "for NDC in pbar(NDC_list):\n",
    "    try:\n",
    "        AUI = mrconso[mrconso.NDC == NDC].AUI.iloc[0]\n",
    "        command = '''\n",
    "        MATCH (instance:Prescriptions {{ndc:'{NDC}'}})\n",
    "        MATCH (concept:Concept {{aui:'{AUI}'}})\n",
    "        SET concept.ndc = '{NDC}'\n",
    "        MERGE (instance)-[:INSTANCE_OF]->(concept)\n",
    "        '''.format(NDC=NDC, AUI=AUI)\n",
    "        session.run(command)\n",
    "    except:\n",
    "        pass"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<a id='MIMIC_labs_to_UMLS'></a>\n",
    "### Connect MIMIC-III's Labitems nodes with INSTANCE_OF relationships to Concept nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/tim/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (9) have mixed types.Specify dtype option on import or set low_memory=False.\n",
      "  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>LAT</th>\n",
       "      <th>AUI</th>\n",
       "      <th>SCUI</th>\n",
       "      <th>SAB</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A26634265</td>\n",
       "      <td>M0019694</td>\n",
       "      <td>MSH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A26634266</td>\n",
       "      <td>M0019694</td>\n",
       "      <td>MSH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>FRE</td>\n",
       "      <td>A13433185</td>\n",
       "      <td>M0019694</td>\n",
       "      <td>MSHFRE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>FRE</td>\n",
       "      <td>A27488794</td>\n",
       "      <td>M0019694</td>\n",
       "      <td>MSHFRE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>FRE</td>\n",
       "      <td>A27614225</td>\n",
       "      <td>M0019694</td>\n",
       "      <td>MSHFRE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   LAT        AUI      SCUI     SAB\n",
       "0  ENG  A26634265  M0019694     MSH\n",
       "1  ENG  A26634266  M0019694     MSH\n",
       "2  FRE  A13433185  M0019694  MSHFRE\n",
       "3  FRE  A27488794  M0019694  MSHFRE\n",
       "4  FRE  A27614225  M0019694  MSHFRE"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Load MRCONSO.RRF to get a mapping of LOINC codes to UMLS AUIs\n",
    "path = '/media/sata_1TB_internal/umls-2020AB-full/2020AB/META/'\n",
    "mrconso = pd.read_csv(path + 'MRCONSO.RRF', sep='|', usecols=[1,7,9,11], header=None, encoding='utf-8')\n",
    "# mrconso = pd.read_csv(path + 'MRCONSO.RRF', sep='|', header=None, encoding='utf-8')\n",
    "# mrconso.columns = ['CUI', 'LAT', 'TS', 'LUI', 'STT', 'SUI', 'ISPREF', 'AUI', 'SAUI', 'SCUI', 'SDUI', 'SAB', 'TTY', 'CODE', 'STR', 'SRL', 'SUPPRESS', 'CVF', '']\n",
    "mrconso.columns = ['LAT','AUI','SCUI', 'SAB']\n",
    "mrconso.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>LAT</th>\n",
       "      <th>AUI</th>\n",
       "      <th>SCUI</th>\n",
       "      <th>SAB</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18399186</td>\n",
       "      <td>LP15542-1</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A23513030</td>\n",
       "      <td>MTHU010538</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18243499</td>\n",
       "      <td>LP15278-2</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A23497527</td>\n",
       "      <td>MTHU027241</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>505</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18359748</td>\n",
       "      <td>LP15290-7</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15193673</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A32072885</td>\n",
       "      <td>LP418799-5</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15193674</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A32074343</td>\n",
       "      <td>LP417224-5</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15193675</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A32075801</td>\n",
       "      <td>LP418432-3</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15193676</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A32075804</td>\n",
       "      <td>LP418814-2</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15193677</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A32078559</td>\n",
       "      <td>LP417428-2</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>602141 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          LAT        AUI        SCUI  SAB\n",
       "14        ENG  A18399186   LP15542-1  LNC\n",
       "16        ENG  A23513030  MTHU010538  LNC\n",
       "57        ENG  A18243499   LP15278-2  LNC\n",
       "58        ENG  A23497527  MTHU027241  LNC\n",
       "505       ENG  A18359748   LP15290-7  LNC\n",
       "...       ...        ...         ...  ...\n",
       "15193673  ENG  A32072885  LP418799-5  LNC\n",
       "15193674  ENG  A32074343  LP417224-5  LNC\n",
       "15193675  ENG  A32075801  LP418432-3  LNC\n",
       "15193676  ENG  A32075804  LP418814-2  LNC\n",
       "15193677  ENG  A32078559  LP417428-2  LNC\n",
       "\n",
       "[602141 rows x 4 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "loinc_codes = mrconso[(mrconso.LAT == 'ENG') & (mrconso.SAB == 'LNC')]\n",
    "loinc_codes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get a list of all LOINC codes used in MIMIC-III\n",
    "query = '''\n",
    "MATCH (d:D_Labitems)-[r:DESCRIBES]->(l:Labevents)\n",
    "RETURN COLLECT(DISTINCT(d.loinc_code)) AS loinc_codes\n",
    "'''\n",
    "data = session.run(query)\n",
    "mimic_loinc_codes = data.value()[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "573"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(mimic_loinc_codes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>LAT</th>\n",
       "      <th>AUI</th>\n",
       "      <th>SCUI</th>\n",
       "      <th>SAB</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3233506</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A27139562</td>\n",
       "      <td>702-1</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3233507</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A27130041</td>\n",
       "      <td>702-1</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3233508</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A31410774</td>\n",
       "      <td>702-1</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3233509</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18357798</td>\n",
       "      <td>702-1</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3233510</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18357797</td>\n",
       "      <td>702-1</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051370</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18368423</td>\n",
       "      <td>10330-9</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051371</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A24222560</td>\n",
       "      <td>10330-9</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051372</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A31418505</td>\n",
       "      <td>10330-9</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051373</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18841034</td>\n",
       "      <td>10330-9</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051374</th>\n",
       "      <td>ENG</td>\n",
       "      <td>A18175244</td>\n",
       "      <td>10330-9</td>\n",
       "      <td>LNC</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2859 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          LAT        AUI     SCUI  SAB\n",
       "3233506   ENG  A27139562    702-1  LNC\n",
       "3233507   ENG  A27130041    702-1  LNC\n",
       "3233508   ENG  A31410774    702-1  LNC\n",
       "3233509   ENG  A18357798    702-1  LNC\n",
       "3233510   ENG  A18357797    702-1  LNC\n",
       "...       ...        ...      ...  ...\n",
       "11051370  ENG  A18368423  10330-9  LNC\n",
       "11051371  ENG  A24222560  10330-9  LNC\n",
       "11051372  ENG  A31418505  10330-9  LNC\n",
       "11051373  ENG  A18841034  10330-9  LNC\n",
       "11051374  ENG  A18175244  10330-9  LNC\n",
       "\n",
       "[2859 rows x 4 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "loinc_codes = loinc_codes[loinc_codes.SCUI.isin(mimic_loinc_codes)]\n",
    "loinc_codes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f2df7d4d4c0>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create an index on the Labitems loinc_code property\n",
    "command = '''\n",
    "CREATE INDEX Labitems_LOINC IF NOT EXISTS FOR (c:D_Labitems) ON (c.loinc_code) \n",
    "'''\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "for row in loinc_codes.iterrows():\n",
    "    AUI = row[1].AUI\n",
    "    LNC = row[1].SCUI\n",
    "    try:\n",
    "        command = '''\n",
    "        MATCH (reference:D_Labitems {{loinc_code:'{LNC}'}})-[r:DESCRIBES]->(instance:Labevents)\n",
    "        MATCH (concept:Concept {{aui:'{AUI}'}})\n",
    "        WHERE concept.cui_pref_term IS NOT NULL\n",
    "        SET concept.loinc_code = '{LNC}', concept.description = reference.label+' in '+reference.fluid\n",
    "        SET reference.aui = '{AUI}'\n",
    "        MERGE (instance)-[:INSTANCE_OF]->(concept)\n",
    "        '''.format(LNC=LNC, AUI=AUI)\n",
    "        session.run(command)\n",
    "#         print(command)\n",
    "    except:\n",
    "        pass"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Close the connection to the neo4j database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "session.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Data references:\n",
    "The dataset:\n",
    "Johnson, A., Pollard, T., & Mark, R. (2016). MIMIC-III Clinical Database (version 1.4). PhysioNet. https://doi.org/10.13026/C2XW26.\n",
    "\n",
    "The original publication:\n",
    "Johnson, A. E. W., Pollard, T. J., Shen, L., Lehman, L. H., Feng, M., Ghassemi, M., Moody, B., Szolovits, P., Celi, L. A., & Mark, R. G. (2016). MIMIC-III, a freely accessible critical care database. Scientific Data, 3, 160035.\n",
    "\n",
    "The data hosting service PhysioNet:\n",
    "Goldberger, A., Amaral, L., Glass, L., Hausdorff, J., Ivanov, P. C., Mark, R., ... & Stanley, H. E. (2000). PhysioBank, PhysioToolkit, and PhysioNet: Components of a new research resource for complex physiologic signals. Circulation [Online]. 101 (23), pp. e215–e220."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
