{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "603d49da-151d-4a92-8f08-8e58abff1b78",
      "metadata": {},
      "source": [
        "# Mockup Version 1\n",
        "\n",
        "- Mock-up the workflow from MIS global summit in an environment like EvidenceCare's Epic App. Due January 1.\n",
        "    - ☑️ List content for our app (Due by Nov 23) TJM\n",
        "    - ☑️ Define the workflow between user, website, and service (Due by Nov 23) TJM & NS workshop session\n",
        "    - ☑️ Define interface between UI and service (Due by Nov 30) TJM & NS workshop session\n",
        "    - ☑️ Include procedures predictor (Due by Dec 14) TJM\n",
        "    - ☑️ Create a static page layout (Due by Dec 7) NS\n",
        "    - ☑️ Flask configuration (due by Dec 1) TJM \n",
        "    - Have shortest path algorithms produce sentences of node-relationship-node, where you can click on a word and it highlights the node in the graph visualization\n",
        "    - Tim give Nikesh an explanation of the score value which he can add to the prototype\n",
        "    - Tim incorporate Nikesh's fetchData and flask code into current code\n",
        "    - Write & test the code for webpage (Due by Dec 23) TJM & NS\n",
        "    - Provide instructions, documentation, supporting information to make it (Due by Dec 23) BED\n",
        "    - 🟢 Create a page on mi1.ai that introduces the POC\n",
        "    - 🟢 Create a slide that describes what is going on under the hood in the poc\n",
        "    - 🟢 Create an idealized version of visualization, which can be inserted into a screen-recorded demo right after showing the live graph view\n",
        "    "
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "id": "df7ba2c1-5fa2-40a1-af9c-c17ab614cfb8",
      "metadata": {},
      "outputs": [],
      "source": [
        "import pandas as pd\n",
        "import time"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 12,
      "id": "0b4cce4c-b692-461a-9c6c-52de423ebdfe",
      "metadata": {},
      "outputs": [],
      "source": [
        "# import getpass\n",
        "# password = getpass.getpass(\"\\nPlease enter the Neo4j database password to continue \\n\")\n",
        "\n",
        "from neo4j import GraphDatabase\n",
        "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j','NikeshIsCool'))\n",
        "session=driver.session()"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 4,
      "id": "8944dee6-c19f-4b50-a466-76b71eee3df8",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Known_CUI</th>\n",
              "      <th>Known_Problem</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>C4046002</td>\n",
              "      <td>Research Related Injuries</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>C4046002</td>\n",
              "      <td>Research-Related Injuries</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>C4046002</td>\n",
              "      <td>Research-Related Injury</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>C0862970</td>\n",
              "      <td>Resectable Bile Duct Adenocarcinoma</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>C0854792</td>\n",
              "      <td>Resectable Bile Duct Cancer</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>...</th>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>985</th>\n",
              "      <td>C3281186</td>\n",
              "      <td>Restrictive ventilation disorder due to severe...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>986</th>\n",
              "      <td>C0036351</td>\n",
              "      <td>Restzustand</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>987</th>\n",
              "      <td>C0036351</td>\n",
              "      <td>Restzustand (schizophrenic)</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>988</th>\n",
              "      <td>C0036351</td>\n",
              "      <td>Restzustand, schizophrenic</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>989</th>\n",
              "      <td>C0036351</td>\n",
              "      <td>Restzustand; schizophrenic</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "<p>990 rows × 2 columns</p>\n",
              "</div>"
            ],
            "text/plain": [
              "    Known_CUI                                      Known_Problem\n",
              "0    C4046002                          Research Related Injuries\n",
              "1    C4046002                          Research-Related Injuries\n",
              "2    C4046002                            Research-Related Injury\n",
              "3    C0862970                Resectable Bile Duct Adenocarcinoma\n",
              "4    C0854792                        Resectable Bile Duct Cancer\n",
              "..        ...                                                ...\n",
              "985  C3281186  Restrictive ventilation disorder due to severe...\n",
              "986  C0036351                                        Restzustand\n",
              "987  C0036351                        Restzustand (schizophrenic)\n",
              "988  C0036351                         Restzustand, schizophrenic\n",
              "989  C0036351                         Restzustand; schizophrenic\n",
              "\n",
              "[990 rows x 2 columns]"
            ]
          },
          "execution_count": 4,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "# Get a list of autocomplete terms\n",
        "startingtext = 'Res'\n",
        "query = '''\n",
        "MATCH (c1:Concept)\n",
        "WHERE c1.term STARTS WITH '{startingtext}' AND c1.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"] \n",
        "RETURN DISTINCT(c1.cui) AS `Known_CUI`, c1.term AS `Known_Problem`\n",
        "'''.format(startingtext=startingtext)\n",
        "data = session.run(query)\n",
        "autocomplete_problems_prompts = pd.DataFrame([dict(record) for record in data])\n",
        "autocomplete_problems_prompts"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 94,
      "id": "78030c08-4284-4954-9889-d0bce796ccae",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Known_CUI</th>\n",
              "      <th>Known_Problem</th>\n",
              "      <th>CUI</th>\n",
              "      <th>Problem</th>\n",
              "      <th>Score</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0220982</td>\n",
              "      <td>Ketoacidosis</td>\n",
              "      <td>0.61598</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0149521</td>\n",
              "      <td>Pancreatitis, Chronic</td>\n",
              "      <td>0.56788</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0151723</td>\n",
              "      <td>Hypomagnesemia</td>\n",
              "      <td>0.51528</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0236663</td>\n",
              "      <td>Alcohol withdrawal syndrome</td>\n",
              "      <td>0.51037</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C1963823</td>\n",
              "      <td>Hyperlipasaemia</td>\n",
              "      <td>0.46902</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0438696</td>\n",
              "      <td>Suicidal</td>\n",
              "      <td>0.46201</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0747752</td>\n",
              "      <td>Polysubstance abuse</td>\n",
              "      <td>0.45843</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0162316</td>\n",
              "      <td>Iron deficiency anemia</td>\n",
              "      <td>0.44179</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C3159311</td>\n",
              "      <td>BORNHOLM EYE DISEASE</td>\n",
              "      <td>0.42945</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0232498</td>\n",
              "      <td>Abdominal tenderness</td>\n",
              "      <td>0.42369</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "  Known_CUI  Known_Problem       CUI                      Problem    Score\n",
              "0  C0085762  Alcohol abuse  C0220982                 Ketoacidosis  0.61598\n",
              "1  C0085762  Alcohol abuse  C0149521        Pancreatitis, Chronic  0.56788\n",
              "2  C0085762  Alcohol abuse  C0151723               Hypomagnesemia  0.51528\n",
              "3  C0085762  Alcohol abuse  C0236663  Alcohol withdrawal syndrome  0.51037\n",
              "4  C0085762  Alcohol abuse  C1963823              Hyperlipasaemia  0.46902\n",
              "5  C0085762  Alcohol abuse  C0438696                     Suicidal  0.46201\n",
              "6  C0085762  Alcohol abuse  C0747752          Polysubstance abuse  0.45843\n",
              "7  C0085762  Alcohol abuse  C0162316       Iron deficiency anemia  0.44179\n",
              "8  C0085762  Alcohol abuse  C3159311         BORNHOLM EYE DISEASE  0.42945\n",
              "9  C0085762  Alcohol abuse  C0232498         Abdominal tenderness  0.42369"
            ]
          },
          "execution_count": 94,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "    cui_prob_list = ['C1565489', 'C0085762']\n",
        "    query = '''\n",
        "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
        "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"]\n",
        "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r, c\n",
        "    RETURN c.cui AS `Known_CUI`, c.term AS `Known_Problem`, ord.cui AS `CUI`, ord.term AS `Problem`, Score\n",
        "    ORDER BY r.co_occurrence_probability DESC\n",
        "    LIMIT 10\n",
        "    '''.format(cui_prob_list=cui_prob_list)\n",
        "    data = session.run(query)\n",
        "    likely_comorbidities_NLP = pd.DataFrame([dict(record) for record in data])\n",
        "    likely_comorbidities_NLP"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 18,
      "id": "e70e22dc-bdfa-4d3b-b37e-602cbb3dbc96",
      "metadata": {},
      "outputs": [],
      "source": [
        "# get a CSV of all problems in the database that have enough data to potentially return robust results\n",
        "query = '''\n",
        "MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
        "WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r, c\n",
        "WHERE Score > 20\n",
        "RETURN distinct(c.term) AS Problem, c.cui'''\n",
        "data = session.run(query)\n",
        "\n",
        "# Convert the neo4j object into a dataframe\n",
        "common_problems_df = pd.DataFrame([dict(record) for record in data])"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 21,
      "id": "b22b925d-5588-4f43-b4c4-4c6a651683d9",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/plain": [
              "['Abnormally opaque structure (morphologic abnormality)',\n",
              " 'Acidosis',\n",
              " 'Acidosis, Lactic',\n",
              " 'Acidosis, Respiratory',\n",
              " 'Actinic cheilitis',\n",
              " 'Acute respiratory failure',\n",
              " 'Aggressive Periodontitis',\n",
              " 'Agitation',\n",
              " 'Alcohol Withdrawal Delirium',\n",
              " 'Alcohol abuse',\n",
              " 'Alcohol withdrawal syndrome',\n",
              " 'Alkalosis, Respiratory',\n",
              " 'Aneurysm',\n",
              " 'Apnea',\n",
              " 'Ascites',\n",
              " 'Back Pain',\n",
              " 'Blood Clot',\n",
              " 'Bronchospasm',\n",
              " 'Cardiac Arrhythmia',\n",
              " 'Cerebrovascular accident',\n",
              " 'Chest Pain',\n",
              " 'Cholangiocarcinoma',\n",
              " 'Chronic Kidney Diseases',\n",
              " 'Chronic back pain',\n",
              " 'Confusion',\n",
              " 'Contraction (finding)',\n",
              " 'Coughing',\n",
              " 'Dentatorubral-Pallidoluysian Atrophy',\n",
              " 'Desmoplastic infantile ganglioglioma',\n",
              " 'Diabetes Mellitus, Non-Insulin-Dependent',\n",
              " 'Diabetic Ketoacidosis',\n",
              " 'Diastolic dysfunction',\n",
              " 'Disease',\n",
              " 'Disease Progression',\n",
              " 'Dry skin',\n",
              " 'Dyspnea',\n",
              " 'Encephalitis',\n",
              " 'Epilepsy',\n",
              " 'Esophageal Varices',\n",
              " 'Fatigue',\n",
              " 'Febrile Neutropenia',\n",
              " 'Flare',\n",
              " 'Fluid overload',\n",
              " 'Gastrointestinal Hemorrhage',\n",
              " 'Gastroparesis',\n",
              " 'Headache',\n",
              " 'Hematemesis',\n",
              " 'Hematoma, Subdural',\n",
              " 'Hematuria',\n",
              " 'Hemorrhage',\n",
              " 'Hepatic Encephalopathy',\n",
              " 'Hydrocephalus, Normal Pressure',\n",
              " 'Hyperglycemia',\n",
              " 'Hypersensitivity',\n",
              " 'Hypertensive urgency',\n",
              " 'Hypocalcemia',\n",
              " 'INFECTIOUS PROCESS',\n",
              " 'Ileus',\n",
              " 'Infarction',\n",
              " 'Infection',\n",
              " 'Influenza',\n",
              " 'Kidney Diseases',\n",
              " 'Kidney Failure, Chronic',\n",
              " 'Lethargy',\n",
              " 'Liver Failure',\n",
              " 'Liver diseases',\n",
              " 'Mental status changes',\n",
              " 'Metabolic alkalosis',\n",
              " 'Multiple Myeloma',\n",
              " 'Neoplasms',\n",
              " 'Normocytic anemia',\n",
              " 'Nutritional Deficiency',\n",
              " 'Obstruction',\n",
              " 'Oliguria',\n",
              " 'POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE',\n",
              " 'Paroxysmal atrial fibrillation',\n",
              " 'Pathological Dilatation',\n",
              " 'Pathology processes',\n",
              " 'Pericardial effusion',\n",
              " 'Pleural effusion disorder',\n",
              " 'Pneumothorax',\n",
              " 'Polysubstance abuse',\n",
              " 'Pressure Ulcer',\n",
              " 'Pulmonary Edema',\n",
              " 'Renal Insufficiency',\n",
              " 'Seizures',\n",
              " 'Sepsis due to urinary tract infection',\n",
              " 'Shock',\n",
              " 'Shock, Cardiogenic',\n",
              " 'Sinus Tachycardia',\n",
              " 'Somnolence',\n",
              " 'Sore to touch',\n",
              " 'Toxic effect',\n",
              " 'Ulcer',\n",
              " 'Uremia',\n",
              " 'Urinary tract infection',\n",
              " 'Vomiting',\n",
              " 'Wheezing',\n",
              " 'Xanthomatosis, Cerebrotendinous',\n",
              " 'diastolic congestive heart failure',\n",
              " 'gastrointestinal gas',\n",
              " 'physiologic resolution']"
            ]
          },
          "execution_count": 21,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "common_problems_df.sort_values(by='Problem', inplace=True)\n",
        "common_problems_df.Problem.to_list()"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 26,
      "id": "8692c0ca-8e3b-4533-b54f-da4ece1f29a8",
      "metadata": {},
      "outputs": [],
      "source": [
        "# Trim out problems that seem to be spurious\n",
        "spurious = ['Abnormally opaque structure (morphologic abnormality)', 'Actinic cheilitis', 'Aggressive Periodontitis', 'Dentatorubral-Pallidoluysian Atrophy', 'Desmoplastic infantile ganglioglioma',  'Disease', 'Disease Progression', 'Flare', 'Obstruction', 'POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE',  'Pathological Dilatation', 'Pathology processes', 'Sore to touch', 'Xanthomatosis, Cerebrotendinous',  'diastolic congestive heart failure', 'gastrointestinal gas', 'physiologic resolution']\n",
        "common_problems_df = common_problems_df[~common_problems_df.Problem.isin(spurious)]"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 27,
      "id": "84225b8d-d07b-42c4-a47f-6e36660b4517",
      "metadata": {},
      "outputs": [],
      "source": [
        "# Write out to CSV\n",
        "common_problems_df.to_csv('common_problems.csv', index=False, encoding='utf-8')"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "216368ad-b8d5-415c-b23a-91bf039df33f",
      "metadata": {},
      "source": [
        "## Modify existing functions for the new data model\n",
        "### Input a list of CUIs for known problems, output possible additional problems with their CUIs and odds ratios in a dataframe\n",
        "Note: This query relies on the OCCURS_WITH relationship, which was created in the [Virtual_Population](Documents/P2_Prototype/Virtual_Population.ipynb) notebook under the section \"Using Conditional Probability instead of Odds Ratio.\""
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 12,
      "id": "91c2d2ea-71fe-4a9c-ac30-805351261a88",
      "metadata": {},
      "outputs": [],
      "source": [
        "def PotentialComorbidities(cui_prob_list):\n",
        "    \n",
        "    query = '''\n",
        "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
        "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"]\n",
        "    WITH round(r.co_occurrance_probability, 5) AS Score, ord, r, c\n",
        "    RETURN c.cui AS `Known_CUI`, c.term AS `Known_Problem`, ord.cui AS `Likely_CUI`, ord.term AS `Likely_Problem`, Score\n",
        "    ORDER BY r.co_occurrance_probability DESC\n",
        "    LIMIT 10\n",
        "    '''.format(cui_prob_list=cui_prob_list)\n",
        "    data = session.run(query)\n",
        "    likely_comorbidities = pd.DataFrame([dict(record) for record in data])\n",
        "    \n",
        "    return likely_comorbidities"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 13,
      "id": "49fabae8-92fa-47d3-b4b6-edbf8c2a5342",
      "metadata": {
        "tags": []
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Total runtime: 0.0643320083618164 seconds\n"
          ]
        },
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Known_CUI</th>\n",
              "      <th>Known_Problem</th>\n",
              "      <th>Likely_CUI</th>\n",
              "      <th>Likely_Problem</th>\n",
              "      <th>Score</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0162316</td>\n",
              "      <td>Iron deficiency anemia</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0948268</td>\n",
              "      <td>Hemodynamic instability</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0394996</td>\n",
              "      <td>Acute alcoholic intoxication</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C4761312</td>\n",
              "      <td>Nutritional Deficiency</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0220982</td>\n",
              "      <td>Ketoacidosis</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0677042</td>\n",
              "      <td>Pathology processes</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0149521</td>\n",
              "      <td>Pancreatitis, Chronic</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0151723</td>\n",
              "      <td>Hypomagnesemia</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>C0085762</td>\n",
              "      <td>Alcohol abuse</td>\n",
              "      <td>C0338908</td>\n",
              "      <td>Mixed anxiety and depressive disorder</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>C1565489</td>\n",
              "      <td>Renal Insufficiency</td>\n",
              "      <td>C2826321</td>\n",
              "      <td>Refractory Thrombocytopenia</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "  Known_CUI        Known_Problem Likely_CUI  \\\n",
              "0  C0085762        Alcohol abuse   C0162316   \n",
              "1  C0085762        Alcohol abuse   C0948268   \n",
              "2  C0085762        Alcohol abuse   C0394996   \n",
              "3  C0085762        Alcohol abuse   C4761312   \n",
              "4  C0085762        Alcohol abuse   C0220982   \n",
              "5  C0085762        Alcohol abuse   C0677042   \n",
              "6  C0085762        Alcohol abuse   C0149521   \n",
              "7  C0085762        Alcohol abuse   C0151723   \n",
              "8  C0085762        Alcohol abuse   C0338908   \n",
              "9  C1565489  Renal Insufficiency   C2826321   \n",
              "\n",
              "                          Likely_Problem Score  \n",
              "0                 Iron deficiency anemia  None  \n",
              "1                Hemodynamic instability  None  \n",
              "2           Acute alcoholic intoxication  None  \n",
              "3                 Nutritional Deficiency  None  \n",
              "4                           Ketoacidosis  None  \n",
              "5                    Pathology processes  None  \n",
              "6                  Pancreatitis, Chronic  None  \n",
              "7                         Hypomagnesemia  None  \n",
              "8  Mixed anxiety and depressive disorder  None  \n",
              "9            Refractory Thrombocytopenia  None  "
            ]
          },
          "execution_count": 13,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "# Test the function\n",
        "start_time = time.time()\n",
        "\n",
        "cui_prob_list = ['C1565489', 'C0085762']\n",
        "PotentialComorbidities = PotentialComorbidities(cui_prob_list)\n",
        "\n",
        "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
        "PotentialComorbidities"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "bef509fe-94f1-417f-8ff9-a696cb4afb8a",
      "metadata": {},
      "source": [
        "### Input 1 problem, output the most likely orders\n",
        "Note: This query relies on the OCCURS_WITH relationship, which was created in the [Virtual_Population](Documents/P2_Prototype/Virtual_Population.ipynb) notebook under the section \"Using Conditional Probability instead of Odds Ratio.\""
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 9,
      "id": "ef2d8b50-e0bd-4fc1-ab0a-5c8bf9333d5f",
      "metadata": {},
      "outputs": [],
      "source": [
        "def LikelyOrders(cui_prob_list):\n",
        "    \n",
        "    # Find prescriptions associated with the input problem    \n",
        "    query = '''\n",
        "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
        "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Drug']\"]\n",
        "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r\n",
        "    RETURN ord.cui AS `Code`, ord.term AS `Order`, Score\n",
        "    ORDER BY r.co_occurrence_probability DESC\n",
        "    LIMIT 10\n",
        "    '''.format(cui_prob_list=cui_prob_list)\n",
        "    data = session.run(query)\n",
        "    orders_likely_rx = pd.DataFrame([dict(record) for record in data]).head(10)\n",
        "    \n",
        "    # Find abnormal labs associated with the input problem\n",
        "    query = '''\n",
        "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
        "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Attribute']\"]\n",
        "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r\n",
        "    RETURN ord.cui AS `Code`, ord.description AS `Order`, Score\n",
        "    ORDER BY r.co_occurrence_probability DESC\n",
        "    LIMIT 10\n",
        "    '''.format(cui_prob_list=cui_prob_list)\n",
        "    data = session.run(query)\n",
        "    orders_likely_lab = pd.DataFrame([dict(record) for record in data]).head(10)\n",
        "    \n",
        "    # Find procedures associated with the input problem\n",
        "    query = '''\n",
        "    MATCH p=(ord:D_Icd_Procedures)-[r:OCCURS_WITH]->(c:Concept) \n",
        "    WHERE c.cui IN {cui_prob_list}\n",
        "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r\n",
        "    RETURN ord.icd9_code AS `Code`, ord.long_title AS `Order`, Score\n",
        "    ORDER BY r.co_occurrence_probability DESC\n",
        "    LIMIT 10\n",
        "    '''.format(cui_prob_list=cui_prob_list)\n",
        "    data = session.run(query)\n",
        "    orders_likely_procedure = pd.DataFrame([dict(record) for record in data]).head(10)\n",
        "    \n",
        "    return orders_likely_rx, orders_likely_lab, orders_likely_procedure"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "6674e54d-f32a-40d8-b836-9a77421a2e48",
      "metadata": {},
      "outputs": [],
      "source": [
        "MATCH (source:Concept {cui:'C0022661'})\n",
        "MATCH (destination:Concept {cui:'C0975120'})\n",
        "CALL gds.alpha.shortestPath.stream({\n",
        "    startNode: source,\n",
        "    endNode: destination,\n",
        "    nodeProjection: \n",
        "})"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 26,
      "id": "173f99af-4cd7-4b2c-9cd4-9bfb2a0bac0a",
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Total runtime: 0.023564577102661133 seconds\n"
          ]
        }
      ],
      "source": [
        "start_time = time.time()\n",
        "\n",
        "cui_prob_list = ['C0022661']\n",
        "orders_likely_rx, orders_likely_lab, orders_likely_procedure = LikelyOrders(cui_prob_list)\n",
        "\n",
        "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 27,
      "id": "32b56beb-a602-487a-a162-83db287dd2ab",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Code</th>\n",
              "      <th>Order</th>\n",
              "      <th>Score</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>C0975120</td>\n",
              "      <td>calcitriol 0.00025 MG Oral Capsule</td>\n",
              "      <td>0.62000</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>C1967412</td>\n",
              "      <td>sevelamer carbonate 800 MG Oral Tablet [Renvela]</td>\n",
              "      <td>0.60450</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>C1951501</td>\n",
              "      <td>sodium polystyrene sulfonate 250 MG/ML Oral Su...</td>\n",
              "      <td>0.58420</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>C0706911</td>\n",
              "      <td>1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]</td>\n",
              "      <td>0.44712</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>C4082775</td>\n",
              "      <td>150 ML Glucose 50 MG/ML Injection</td>\n",
              "      <td>0.42971</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>C0710995</td>\n",
              "      <td>purified protein derivative of tuberculin 50 U...</td>\n",
              "      <td>0.39966</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>C0691839</td>\n",
              "      <td>sodium bicarbonate 650 MG Oral Tablet</td>\n",
              "      <td>0.37536</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>C0978650</td>\n",
              "      <td>midodrine hydrochloride 5 MG Oral Tablet</td>\n",
              "      <td>0.35985</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>C1169852</td>\n",
              "      <td>piperacillin 2000 MG / tazobactam 250 MG Injec...</td>\n",
              "      <td>0.35321</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>C0975350</td>\n",
              "      <td>cefepime 1000 MG Injection</td>\n",
              "      <td>0.33979</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "       Code                                              Order    Score\n",
              "0  C0975120                 calcitriol 0.00025 MG Oral Capsule  0.62000\n",
              "1  C1967412   sevelamer carbonate 800 MG Oral Tablet [Renvela]  0.60450\n",
              "2  C1951501  sodium polystyrene sulfonate 250 MG/ML Oral Su...  0.58420\n",
              "3  C0706911  1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]  0.44712\n",
              "4  C4082775                  150 ML Glucose 50 MG/ML Injection  0.42971\n",
              "5  C0710995  purified protein derivative of tuberculin 50 U...  0.39966\n",
              "6  C0691839              sodium bicarbonate 650 MG Oral Tablet  0.37536\n",
              "7  C0978650           midodrine hydrochloride 5 MG Oral Tablet  0.35985\n",
              "8  C1169852  piperacillin 2000 MG / tazobactam 250 MG Injec...  0.35321\n",
              "9  C0975350                         cefepime 1000 MG Injection  0.33979"
            ]
          },
          "execution_count": 27,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "orders_likely_rx"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 28,
      "id": "8cbe6cc3-f3c3-44d8-8150-e94ee560db1e",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Code</th>\n",
              "      <th>Order</th>\n",
              "      <th>Score</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>C1544491</td>\n",
              "      <td>Macrophage in Ascites</td>\n",
              "      <td>0.77165</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>C0549816</td>\n",
              "      <td>Lymphocytes in Other Body Fluid</td>\n",
              "      <td>0.76913</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>C0942476</td>\n",
              "      <td>Polys in Other Body Fluid</td>\n",
              "      <td>0.71643</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>C0942444</td>\n",
              "      <td>Lymphocytes in Ascites</td>\n",
              "      <td>0.70352</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>C0942425</td>\n",
              "      <td>RBC, Ascites in Ascites</td>\n",
              "      <td>0.68548</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>C0945358</td>\n",
              "      <td>WBC, Ascites in Ascites</td>\n",
              "      <td>0.67514</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>C0942450</td>\n",
              "      <td>Monocytes in Ascites</td>\n",
              "      <td>0.66127</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>C0942478</td>\n",
              "      <td>Polys in Ascites</td>\n",
              "      <td>0.64904</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>C0365034</td>\n",
              "      <td>Protein/Creatinine Ratio in Urine</td>\n",
              "      <td>0.63874</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>C0368042</td>\n",
              "      <td>pH in Urine</td>\n",
              "      <td>0.59096</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "       Code                              Order    Score\n",
              "0  C1544491              Macrophage in Ascites  0.77165\n",
              "1  C0549816    Lymphocytes in Other Body Fluid  0.76913\n",
              "2  C0942476          Polys in Other Body Fluid  0.71643\n",
              "3  C0942444             Lymphocytes in Ascites  0.70352\n",
              "4  C0942425            RBC, Ascites in Ascites  0.68548\n",
              "5  C0945358            WBC, Ascites in Ascites  0.67514\n",
              "6  C0942450               Monocytes in Ascites  0.66127\n",
              "7  C0942478                   Polys in Ascites  0.64904\n",
              "8  C0365034  Protein/Creatinine Ratio in Urine  0.63874\n",
              "9  C0368042                        pH in Urine  0.59096"
            ]
          },
          "execution_count": 28,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "orders_likely_lab"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 29,
      "id": "f07e36d8-a1fa-447e-bffa-c2d0e6799c55",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Code</th>\n",
              "      <th>Order</th>\n",
              "      <th>Score</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>3995</td>\n",
              "      <td>Hemodialysis</td>\n",
              "      <td>0.75877</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>3895</td>\n",
              "      <td>Venous catheterization for renal dialysis</td>\n",
              "      <td>0.70488</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>4513</td>\n",
              "      <td>Other endoscopy of small intestine</td>\n",
              "      <td>0.26072</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>3324</td>\n",
              "      <td>Closed [endoscopic] biopsy of bronchus</td>\n",
              "      <td>0.24204</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>3893</td>\n",
              "      <td>Venous catheterization, not elsewhere classified</td>\n",
              "      <td>0.22290</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>9904</td>\n",
              "      <td>Transfusion of packed cells</td>\n",
              "      <td>0.22250</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>9604</td>\n",
              "      <td>Insertion of endotracheal tube</td>\n",
              "      <td>0.20985</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "   Code                                             Order    Score\n",
              "0  3995                                      Hemodialysis  0.75877\n",
              "1  3895         Venous catheterization for renal dialysis  0.70488\n",
              "2  4513                Other endoscopy of small intestine  0.26072\n",
              "3  3324            Closed [endoscopic] biopsy of bronchus  0.24204\n",
              "4  3893  Venous catheterization, not elsewhere classified  0.22290\n",
              "5  9904                       Transfusion of packed cells  0.22250\n",
              "6  9604                    Insertion of endotracheal tube  0.20985"
            ]
          },
          "execution_count": 29,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "orders_likely_procedure"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 25,
      "id": "fe13a9d6-1588-43a2-af6e-f6fa77e16e1c",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Code</th>\n",
              "      <th>Order</th>\n",
              "      <th>Score</th>\n",
              "      <th>Type</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>C1544491</td>\n",
              "      <td>Macrophage in Ascites</td>\n",
              "      <td>0.77165</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>C0549816</td>\n",
              "      <td>Lymphocytes in Other Body Fluid</td>\n",
              "      <td>0.76913</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>3995</td>\n",
              "      <td>Hemodialysis</td>\n",
              "      <td>0.75877</td>\n",
              "      <td>Procedure</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>C0942476</td>\n",
              "      <td>Polys in Other Body Fluid</td>\n",
              "      <td>0.71643</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>3895</td>\n",
              "      <td>Venous catheterization for renal dialysis</td>\n",
              "      <td>0.70488</td>\n",
              "      <td>Procedure</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>C0942444</td>\n",
              "      <td>Lymphocytes in Ascites</td>\n",
              "      <td>0.70352</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>C0942425</td>\n",
              "      <td>RBC, Ascites in Ascites</td>\n",
              "      <td>0.68548</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>C0945358</td>\n",
              "      <td>WBC, Ascites in Ascites</td>\n",
              "      <td>0.67514</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>C0942450</td>\n",
              "      <td>Monocytes in Ascites</td>\n",
              "      <td>0.66127</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>C0942478</td>\n",
              "      <td>Polys in Ascites</td>\n",
              "      <td>0.64904</td>\n",
              "      <td>Lab</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "       Code                                      Order    Score       Type\n",
              "0  C1544491                      Macrophage in Ascites  0.77165        Lab\n",
              "1  C0549816            Lymphocytes in Other Body Fluid  0.76913        Lab\n",
              "0      3995                               Hemodialysis  0.75877  Procedure\n",
              "2  C0942476                  Polys in Other Body Fluid  0.71643        Lab\n",
              "1      3895  Venous catheterization for renal dialysis  0.70488  Procedure\n",
              "3  C0942444                     Lymphocytes in Ascites  0.70352        Lab\n",
              "4  C0942425                    RBC, Ascites in Ascites  0.68548        Lab\n",
              "5  C0945358                    WBC, Ascites in Ascites  0.67514        Lab\n",
              "6  C0942450                       Monocytes in Ascites  0.66127        Lab\n",
              "7  C0942478                           Polys in Ascites  0.64904        Lab"
            ]
          },
          "execution_count": 25,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "orders_likely_rx['Type'] = 'Prescription'\n",
        "orders_likely_lab['Type'] = 'Lab'\n",
        "orders_likely_procedure['Type'] = 'Procedure'\n",
        "AssocOrders = pd.concat([orders_likely_rx, orders_likely_lab, orders_likely_procedure])\n",
        "AssocOrders.sort_values('Score', ascending = False, inplace = True)\n",
        "AssocOrders = AssocOrders.head(10)\n",
        "AssocOrders"
      ]
    }
  ],
  "metadata": {
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.4"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
