{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "603d49da-151d-4a92-8f08-8e58abff1b78",
   "metadata": {},
   "source": [
    "# Mockup Version 1\n",
    "\n",
    "- Mock-up the workflow from MIS global summit in an environment like EvidenceCare's Epic App. Due January 1.\n",
    "    - ☑️ List content for our app (Due by Nov 23) TJM\n",
    "    - ☑️ Define the workflow between user, website, and service (Due by Nov 23) TJM & NS workshop session\n",
    "    - ☑️ Define interface between UI and service (Due by Nov 30) TJM & NS workshop session\n",
    "    - ☑️ Include procedures predictor (Due by Dec 14) TJM\n",
    "    - ☑️ Create a static page layout (Due by Dec 7) NS\n",
    "    - ☑️ Flask configuration (due by Dec 1) TJM \n",
    "    - Have shortest path algorithms produce sentences of node-relationship-node, where you can click on a word and it highlights the node in the graph visualization\n",
    "    - Tim give Nikesh an explanation of the score value which he can add to the prototype\n",
    "    - Tim incorporate Nikesh's fetchData and flask code into current code\n",
    "    - Write & test the code for webpage (Due by Dec 23) TJM & NS\n",
    "    - Provide instructions, documentation, supporting information to make it (Due by Dec 23) BED\n",
    "    - 🟢 Create a page on mi1.ai that introduces the POC\n",
    "    - 🟢 Create a slide that describes what is going on under the hood in the poc\n",
    "    - 🟢 Create an idealized version of visualization, which can be inserted into a screen-recorded demo right after showing the live graph view\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "df7ba2c1-5fa2-40a1-af9c-c17ab614cfb8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0b4cce4c-b692-461a-9c6c-52de423ebdfe",
   "metadata": {},
   "outputs": [],
   "source": [
    "# import getpass\n",
    "# password = getpass.getpass(\"\\nPlease enter the Neo4j database password to continue \\n\")\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j','NikeshIsCool'))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "8df9106b-1726-40cd-ac14-96772ee20b81",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Assoc_Entities</th>\n",
       "      <th>Number_of_Assoc_Entities</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Non-Small Cell Lung Carcinoma</td>\n",
       "      <td>[C0242379, C0684249, C1839839]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sepsis due to urinary tract infection</td>\n",
       "      <td>[C0264490, C0034186, C0267026, C3714514, C0268...</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>diastolic congestive heart failure</td>\n",
       "      <td>[C0520863, C0043144, C0235480, C0018802, C0546...</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Acute posthaemorrhagic anaemia</td>\n",
       "      <td>[C1135191, C0497131, C0014591, C0007787, C0019...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 Disease  \\\n",
       "0          Non-Small Cell Lung Carcinoma   \n",
       "1  Sepsis due to urinary tract infection   \n",
       "2     diastolic congestive heart failure   \n",
       "3         Acute posthaemorrhagic anaemia   \n",
       "\n",
       "                                      Assoc_Entities  Number_of_Assoc_Entities  \n",
       "0                     [C0242379, C0684249, C1839839]                         3  \n",
       "1  [C0264490, C0034186, C0267026, C3714514, C0268...                        11  \n",
       "2  [C0520863, C0043144, C0235480, C0018802, C0546...                        19  \n",
       "3  [C1135191, C0497131, C0014591, C0007787, C0019...                         5  "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Get lists of entities associated with a couple of diseases in MIMIC (diastolic CHF, NSCLC, and urosepsis)\n",
    "query = '''\n",
    "MATCH (d)-[total_r:OCCURS_WITH]-(total_f)\n",
    "WHERE d.cui IN [\"C2183328\", \"C0007131\", \"C0149801\", \"C0154298\"]\n",
    "RETURN d.term AS Disease, collect(total_f.cui) as Assoc_Entities, count(total_f.cui) AS Number_of_Assoc_Entities'''\n",
    "data = session.run(query)\n",
    "disease_example = pd.DataFrame([dict(record) for record in data])\n",
    "disease_example"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "5d75e3b8-ce7c-42ce-bc94-2178f7a1ffae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "36"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Collect lists of CUIs for the disease-associated entities\n",
    "NSCLC_entities = disease_example['Assoc_Entities'][0]\n",
    "urosepsis_entities = disease_example['Assoc_Entities'][1]\n",
    "dCHF_entities = disease_example['Assoc_Entities'][2]\n",
    "bleed_out_entities = disease_example['Assoc_Entities'][3]\n",
    "\n",
    "\n",
    "multi_dz_entities = list(set(dCHF_entities + NSCLC_entities + urosepsis_entities + bleed_out_entities))\n",
    "\n",
    "len(multi_dz_entities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "58fdc4ff-0a08-49c5-88ae-999478749215",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get a differential diagnosis for non-rare diseases\n",
    "def DDx(cui_finding_list):\n",
    "\n",
    "    query = '''\n",
    "    MATCH (pos_f)-[given_r:OCCURS_WITH]-(d)-[total_r:OCCURS_WITH]-(total_f)\n",
    "\n",
    "    // Get a list of diseases which have at least one finding in the list of CUIs for given findings\n",
    "    WHERE pos_f.cui IN {cui_finding_list}\n",
    " AND (d.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"] OR d:D_Icd_Diagnoses)\n",
    "\n",
    "     // Get lists of positive findings and relationships to positive findings\n",
    "    WITH d.term AS Disease, d.cui AS Disease_CUI, collect(DISTINCT(pos_f.term)) AS Positive_Findings, collect(DISTINCT(pos_f.cui)) AS Pos_Find_CUIs, collect(DISTINCT(total_r)) AS All_Find_Rel, collect(DISTINCT(total_f.term)) AS all_dz_findings, collect(DISTINCT(total_f.cui)) AS all_dz_CUIs, collect(DISTINCT(given_r)) AS Pos_Find_Rel\n",
    "\n",
    "    // Get list of relationships to negative findings\n",
    "    WITH [x IN All_Find_Rel WHERE NOT x IN Pos_Find_Rel] AS Neg_Find_Rel, Pos_Find_Rel, Disease, Disease_CUI, all_dz_findings, all_dz_CUIs, Positive_Findings, Pos_Find_CUIs\n",
    "\n",
    "    // Get list of negative findings\n",
    "    WITH [x IN all_dz_findings WHERE NOT x in Positive_Findings] AS Negative_Findings, [x IN all_dz_CUIs WHERE NOT x in Pos_Find_CUIs] AS Neg_Find_CUIs, Neg_Find_Rel, Pos_Find_Rel, Disease, Disease_CUI, Positive_Findings, Pos_Find_CUIs\n",
    "\n",
    "    UNWIND Pos_Find_Rel as Pos_Find_Rel_List\n",
    "\n",
    "    UNWIND\n",
    "      CASE\n",
    "        WHEN Neg_Find_Rel = [] THEN [null]\n",
    "        ELSE Neg_Find_Rel\n",
    "      END AS Neg_Find_Rel_List\n",
    "\n",
    "    // Calculate the sum of approximate frequency values for all negative findings for each disease, changing null to 0 when no relationships to negative findings exist\n",
    "    WITH Disease, Disease_CUI, Positive_Findings, Pos_Find_CUIs, Negative_Findings, Neg_Find_CUIs, Pos_Find_Rel_List, sum(toFloat(COALESCE(Neg_Find_Rel_List.co_occurrence_probability, 0))) AS Sum_Neg_Find_Freq, collect(toFloat(Neg_Find_Rel_List.co_occurrence_probability)) AS Neg_Find_Freqs\n",
    "\n",
    "    // Calculate the sum of approximate frequency values for all positive findings for each disease\n",
    "    WITH Disease, Disease_CUI, Positive_Findings, Pos_Find_CUIs, Negative_Findings, Neg_Find_CUIs, sum(toFloat(Pos_Find_Rel_List.co_occurrence_probability)) AS Sum_Pos_Find_Freq, collect(toFloat(Pos_Find_Rel_List.co_occurrence_probability)) AS Pos_Find_Freqs, Sum_Neg_Find_Freq, Neg_Find_Freqs\n",
    "\n",
    "\n",
    "    // Multiply the disease prevalence by the difference between the sum of frequencies of positive and negative findings\n",
    "    RETURN Disease, Disease_CUI, Positive_Findings, Pos_Find_CUIs, Pos_Find_Freqs, Negative_Findings, Neg_Find_CUIs, Neg_Find_Freqs, (Sum_Pos_Find_Freq - Sum_Neg_Find_Freq) AS Probability\n",
    "\n",
    "    ORDER BY Probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_finding_list = cui_finding_list)\n",
    "    data = session.run(query)\n",
    "    mostLikelyRareDiseases = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    return mostLikelyRareDiseases"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "f214b185-4bdc-4a7c-afb9-8169c3e97283",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 2.1348352432250977 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Disease_CUI</th>\n",
       "      <th>Positive_Findings</th>\n",
       "      <th>Pos_Find_CUIs</th>\n",
       "      <th>Pos_Find_Freqs</th>\n",
       "      <th>Negative_Findings</th>\n",
       "      <th>Neg_Find_CUIs</th>\n",
       "      <th>Neg_Find_Freqs</th>\n",
       "      <th>Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Non-Small Cell Lung Carcinoma</td>\n",
       "      <td>C0007131</td>\n",
       "      <td>[Carcinoma of lung, Malignant neoplasm of lung...</td>\n",
       "      <td>[C0684249, C0242379, C1839839]</td>\n",
       "      <td>[0.234027073390936, 0.424419323444471, 0.20367...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[0.334562653067215]</td>\n",
       "      <td>0.527557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Malignant neoplasm of lung</td>\n",
       "      <td>C0242379</td>\n",
       "      <td>[Carcinoma of lung]</td>\n",
       "      <td>[C0684249]</td>\n",
       "      <td>[0.312874605729501]</td>\n",
       "      <td>[Non-Small Cell Lung Carcinoma, Sundowning]</td>\n",
       "      <td>[C0007131, C1142436]</td>\n",
       "      <td>[0.424419323444471, 0.212107155426606]</td>\n",
       "      <td>-0.323652</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Neoplasm Metastasis</td>\n",
       "      <td>C0027627</td>\n",
       "      <td>[Carcinoma of lung]</td>\n",
       "      <td>[C0684249]</td>\n",
       "      <td>[0.394674065387146]</td>\n",
       "      <td>[Neoplasm of uncertain or unknown behavior of ...</td>\n",
       "      <td>[C0496956, C0006142, C0231218]</td>\n",
       "      <td>[0.2744218682836, 0.256387959133101, 0.2347106...</td>\n",
       "      <td>-0.370846</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Carcinoma of lung</td>\n",
       "      <td>C0684249</td>\n",
       "      <td>[Malignant neoplasm of lung]</td>\n",
       "      <td>[C0242379]</td>\n",
       "      <td>[0.312874605729501]</td>\n",
       "      <td>[Neoplasm Metastasis, Chronic multifocal osteo...</td>\n",
       "      <td>[C0027627, C0410422, C0007131]</td>\n",
       "      <td>[0.394674065387146, 0.259410906606858, 0.23402...</td>\n",
       "      <td>-0.575237</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Chronic multifocal osteomyelitis</td>\n",
       "      <td>C0410422</td>\n",
       "      <td>[Carcinoma of lung]</td>\n",
       "      <td>[C0684249]</td>\n",
       "      <td>[0.259410906606858]</td>\n",
       "      <td>[Shock, Cardiogenic, Stupor, Acute myocardial ...</td>\n",
       "      <td>[C0036980, C0085628, C0155626, C0521158]</td>\n",
       "      <td>[0.231270604756821, 0.228630197959932, 0.21346...</td>\n",
       "      <td>-0.614388</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                            Disease Disease_CUI  \\\n",
       "0     Non-Small Cell Lung Carcinoma    C0007131   \n",
       "1        Malignant neoplasm of lung    C0242379   \n",
       "2               Neoplasm Metastasis    C0027627   \n",
       "3                 Carcinoma of lung    C0684249   \n",
       "4  Chronic multifocal osteomyelitis    C0410422   \n",
       "\n",
       "                                   Positive_Findings  \\\n",
       "0  [Carcinoma of lung, Malignant neoplasm of lung...   \n",
       "1                                [Carcinoma of lung]   \n",
       "2                                [Carcinoma of lung]   \n",
       "3                       [Malignant neoplasm of lung]   \n",
       "4                                [Carcinoma of lung]   \n",
       "\n",
       "                    Pos_Find_CUIs  \\\n",
       "0  [C0684249, C0242379, C1839839]   \n",
       "1                      [C0684249]   \n",
       "2                      [C0684249]   \n",
       "3                      [C0242379]   \n",
       "4                      [C0684249]   \n",
       "\n",
       "                                      Pos_Find_Freqs  \\\n",
       "0  [0.234027073390936, 0.424419323444471, 0.20367...   \n",
       "1                                [0.312874605729501]   \n",
       "2                                [0.394674065387146]   \n",
       "3                                [0.312874605729501]   \n",
       "4                                [0.259410906606858]   \n",
       "\n",
       "                                   Negative_Findings  \\\n",
       "0                                                 []   \n",
       "1        [Non-Small Cell Lung Carcinoma, Sundowning]   \n",
       "2  [Neoplasm of uncertain or unknown behavior of ...   \n",
       "3  [Neoplasm Metastasis, Chronic multifocal osteo...   \n",
       "4  [Shock, Cardiogenic, Stupor, Acute myocardial ...   \n",
       "\n",
       "                              Neg_Find_CUIs  \\\n",
       "0                                        []   \n",
       "1                      [C0007131, C1142436]   \n",
       "2            [C0496956, C0006142, C0231218]   \n",
       "3            [C0027627, C0410422, C0007131]   \n",
       "4  [C0036980, C0085628, C0155626, C0521158]   \n",
       "\n",
       "                                      Neg_Find_Freqs  Probability  \n",
       "0                                [0.334562653067215]     0.527557  \n",
       "1             [0.424419323444471, 0.212107155426606]    -0.323652  \n",
       "2  [0.2744218682836, 0.256387959133101, 0.2347106...    -0.370846  \n",
       "3  [0.394674065387146, 0.259410906606858, 0.23402...    -0.575237  \n",
       "4  [0.231270604756821, 0.228630197959932, 0.21346...    -0.614388  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Test the rare disease search function\n",
    "start_time = time.time()\n",
    "test_result = DDx(NSCLC_entities)\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "\n",
    "test_result.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d4027d42-bc3f-4408-9d90-1517ec7c07fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 2.8185534477233887 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Disease_CUI</th>\n",
       "      <th>Positive_Findings</th>\n",
       "      <th>Pos_Find_CUIs</th>\n",
       "      <th>Pos_Find_Freqs</th>\n",
       "      <th>Negative_Findings</th>\n",
       "      <th>Neg_Find_CUIs</th>\n",
       "      <th>Neg_Find_Freqs</th>\n",
       "      <th>Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Sepsis due to urinary tract infection</td>\n",
       "      <td>C0149801</td>\n",
       "      <td>[Actinic cheilitis, Flash pulmonary oedema, In...</td>\n",
       "      <td>[C0267026, C1168329, C3714514, C0264490, C0268...</td>\n",
       "      <td>[0.290588299369199, 0.222138304325536, 0.28636...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[0.368480229331998]</td>\n",
       "      <td>2.408836</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Embolism</td>\n",
       "      <td>C0013922</td>\n",
       "      <td>[Acute respiratory failure, Flash pulmonary oe...</td>\n",
       "      <td>[C0264490, C1168329]</td>\n",
       "      <td>[0.237134365305756, 0.210483857472007]</td>\n",
       "      <td>[Pulmonary Embolism, gastrointestinal gas, Bro...</td>\n",
       "      <td>[C0034065, C0596601, C0006277, C0004626, C0748...</td>\n",
       "      <td>[0.322957956886218, 0.258178360249839, 0.22422...</td>\n",
       "      <td>-0.776008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Atrial Flutter</td>\n",
       "      <td>C0004239</td>\n",
       "      <td>[Oral candidiasis]</td>\n",
       "      <td>[C0006849]</td>\n",
       "      <td>[0.210285130377099]</td>\n",
       "      <td>[Cardiac Flutter, Edema of lower extremity, Pr...</td>\n",
       "      <td>[C0016385, C0239340, C0554309, C0876973]</td>\n",
       "      <td>[0.370518520253345, 0.265380349704386, 0.22006...</td>\n",
       "      <td>-0.848190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>gastrointestinal gas</td>\n",
       "      <td>C0596601</td>\n",
       "      <td>[Actinic cheilitis]</td>\n",
       "      <td>[C0267026]</td>\n",
       "      <td>[0.303300320144778]</td>\n",
       "      <td>[Embolism, Hemolysis (disorder), Peripheral ed...</td>\n",
       "      <td>[C0013922, C0019054, C0085649, C0751781, C0003...</td>\n",
       "      <td>[0.258178360249839, 0.254293216233613, 0.24162...</td>\n",
       "      <td>-0.891586</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Streptococcal Infections</td>\n",
       "      <td>C0038395</td>\n",
       "      <td>[Anxiety]</td>\n",
       "      <td>[C0003467]</td>\n",
       "      <td>[0.287381549196631]</td>\n",
       "      <td>[Supraventricular tachycardia, MAJOR AFFECTIVE...</td>\n",
       "      <td>[C0039240, C1839839, C0006277, C0687133, C1140...</td>\n",
       "      <td>[0.336150874737774, 0.289176739093851, 0.21920...</td>\n",
       "      <td>-0.968116</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 Disease Disease_CUI  \\\n",
       "0  Sepsis due to urinary tract infection    C0149801   \n",
       "1                               Embolism    C0013922   \n",
       "2                         Atrial Flutter    C0004239   \n",
       "3                   gastrointestinal gas    C0596601   \n",
       "4               Streptococcal Infections    C0038395   \n",
       "\n",
       "                                   Positive_Findings  \\\n",
       "0  [Actinic cheilitis, Flash pulmonary oedema, In...   \n",
       "1  [Acute respiratory failure, Flash pulmonary oe...   \n",
       "2                                 [Oral candidiasis]   \n",
       "3                                [Actinic cheilitis]   \n",
       "4                                          [Anxiety]   \n",
       "\n",
       "                                       Pos_Find_CUIs  \\\n",
       "0  [C0267026, C1168329, C3714514, C0264490, C0268...   \n",
       "1                               [C0264490, C1168329]   \n",
       "2                                         [C0006849]   \n",
       "3                                         [C0267026]   \n",
       "4                                         [C0003467]   \n",
       "\n",
       "                                      Pos_Find_Freqs  \\\n",
       "0  [0.290588299369199, 0.222138304325536, 0.28636...   \n",
       "1             [0.237134365305756, 0.210483857472007]   \n",
       "2                                [0.210285130377099]   \n",
       "3                                [0.303300320144778]   \n",
       "4                                [0.287381549196631]   \n",
       "\n",
       "                                   Negative_Findings  \\\n",
       "0                                                 []   \n",
       "1  [Pulmonary Embolism, gastrointestinal gas, Bro...   \n",
       "2  [Cardiac Flutter, Edema of lower extremity, Pr...   \n",
       "3  [Embolism, Hemolysis (disorder), Peripheral ed...   \n",
       "4  [Supraventricular tachycardia, MAJOR AFFECTIVE...   \n",
       "\n",
       "                                       Neg_Find_CUIs  \\\n",
       "0                                                 []   \n",
       "1  [C0034065, C0596601, C0006277, C0004626, C0748...   \n",
       "2           [C0016385, C0239340, C0554309, C0876973]   \n",
       "3  [C0013922, C0019054, C0085649, C0751781, C0003...   \n",
       "4  [C0039240, C1839839, C0006277, C0687133, C1140...   \n",
       "\n",
       "                                      Neg_Find_Freqs  Probability  \n",
       "0                                [0.368480229331998]     2.408836  \n",
       "1  [0.322957956886218, 0.258178360249839, 0.22422...    -0.776008  \n",
       "2  [0.370518520253345, 0.265380349704386, 0.22006...    -0.848190  \n",
       "3  [0.258178360249839, 0.254293216233613, 0.24162...    -0.891586  \n",
       "4  [0.336150874737774, 0.289176739093851, 0.21920...    -0.968116  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Test the rare disease search function\n",
    "start_time = time.time()\n",
    "test_result = DDx(urosepsis_entities)\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "\n",
    "test_result.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "3057ba96-a992-41b8-a41c-a23d560e6a5c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 3.923231363296509 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Disease_CUI</th>\n",
       "      <th>Positive_Findings</th>\n",
       "      <th>Pos_Find_CUIs</th>\n",
       "      <th>Pos_Find_Freqs</th>\n",
       "      <th>Negative_Findings</th>\n",
       "      <th>Neg_Find_CUIs</th>\n",
       "      <th>Neg_Find_Freqs</th>\n",
       "      <th>Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>diastolic congestive heart failure</td>\n",
       "      <td>C2183328</td>\n",
       "      <td>[Natriuretic peptide.B prohormone N-Terminal:M...</td>\n",
       "      <td>[C1316226, C1168329, C0235480, C0595862, C0546...</td>\n",
       "      <td>[0.251020279570385, 0.267430461475254, 0.31299...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>4.996519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Mental Depression</td>\n",
       "      <td>C0011570</td>\n",
       "      <td>[Signs and Symptoms, Respiratory]</td>\n",
       "      <td>[C0037090]</td>\n",
       "      <td>[0.291840458960393]</td>\n",
       "      <td>[Oozing (Hemorrhage)]</td>\n",
       "      <td>[C1446325]</td>\n",
       "      <td>[0.273771504859568]</td>\n",
       "      <td>0.018069</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Signs and Symptoms</td>\n",
       "      <td>C0037088</td>\n",
       "      <td>[Flash pulmonary oedema, Vasodilation disorder...</td>\n",
       "      <td>[C1168329, C0595862, C0028754, C0018802]</td>\n",
       "      <td>[0.216936967859424, 0.225079374159778, 0.24938...</td>\n",
       "      <td>[Virus Diseases, Impaired health, Critical Ill...</td>\n",
       "      <td>[C0042769, C0684336, C0010340, C0085605]</td>\n",
       "      <td>[0.291727330680495, 0.275403118361964, 0.23818...</td>\n",
       "      <td>-0.137091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>asthma with copd</td>\n",
       "      <td>C0865800</td>\n",
       "      <td>[Obesity]</td>\n",
       "      <td>[C0028754]</td>\n",
       "      <td>[0.315446915781628]</td>\n",
       "      <td>[Anemia due to blood loss, Chest Pain, Sleep A...</td>\n",
       "      <td>[C0948824, C0008031, C0520679]</td>\n",
       "      <td>[0.22269270288299, 0.214646541344892, 0.210932...</td>\n",
       "      <td>-0.332825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Myocardial Ischemia</td>\n",
       "      <td>C0151744</td>\n",
       "      <td>[Chronic back pain]</td>\n",
       "      <td>[C0740418]</td>\n",
       "      <td>[0.234950862879126]</td>\n",
       "      <td>[Acute Coronary Syndrome, Anemia, Macrocytic, ...</td>\n",
       "      <td>[C0948089, C0002886, C0019080, C4761312]</td>\n",
       "      <td>[0.241086030023517, 0.224928743827397, 0.21428...</td>\n",
       "      <td>-0.649413</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              Disease Disease_CUI  \\\n",
       "0  diastolic congestive heart failure    C2183328   \n",
       "1                   Mental Depression    C0011570   \n",
       "2                  Signs and Symptoms    C0037088   \n",
       "3                    asthma with copd    C0865800   \n",
       "4                 Myocardial Ischemia    C0151744   \n",
       "\n",
       "                                   Positive_Findings  \\\n",
       "0  [Natriuretic peptide.B prohormone N-Terminal:M...   \n",
       "1                  [Signs and Symptoms, Respiratory]   \n",
       "2  [Flash pulmonary oedema, Vasodilation disorder...   \n",
       "3                                          [Obesity]   \n",
       "4                                [Chronic back pain]   \n",
       "\n",
       "                                       Pos_Find_CUIs  \\\n",
       "0  [C1316226, C1168329, C0235480, C0595862, C0546...   \n",
       "1                                         [C0037090]   \n",
       "2           [C1168329, C0595862, C0028754, C0018802]   \n",
       "3                                         [C0028754]   \n",
       "4                                         [C0740418]   \n",
       "\n",
       "                                      Pos_Find_Freqs  \\\n",
       "0  [0.251020279570385, 0.267430461475254, 0.31299...   \n",
       "1                                [0.291840458960393]   \n",
       "2  [0.216936967859424, 0.225079374159778, 0.24938...   \n",
       "3                                [0.315446915781628]   \n",
       "4                                [0.234950862879126]   \n",
       "\n",
       "                                   Negative_Findings  \\\n",
       "0                                                 []   \n",
       "1                              [Oozing (Hemorrhage)]   \n",
       "2  [Virus Diseases, Impaired health, Critical Ill...   \n",
       "3  [Anemia due to blood loss, Chest Pain, Sleep A...   \n",
       "4  [Acute Coronary Syndrome, Anemia, Macrocytic, ...   \n",
       "\n",
       "                              Neg_Find_CUIs  \\\n",
       "0                                        []   \n",
       "1                                [C1446325]   \n",
       "2  [C0042769, C0684336, C0010340, C0085605]   \n",
       "3            [C0948824, C0008031, C0520679]   \n",
       "4  [C0948089, C0002886, C0019080, C4761312]   \n",
       "\n",
       "                                      Neg_Find_Freqs  Probability  \n",
       "0                                                 []     4.996519  \n",
       "1                                [0.273771504859568]     0.018069  \n",
       "2  [0.291727330680495, 0.275403118361964, 0.23818...    -0.137091  \n",
       "3  [0.22269270288299, 0.214646541344892, 0.210932...    -0.332825  \n",
       "4  [0.241086030023517, 0.224928743827397, 0.21428...    -0.649413  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Test the rare disease search function\n",
    "start_time = time.time()\n",
    "test_result = DDx(dCHF_entities)\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "\n",
    "test_result.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "576151c8-dd58-4a4b-97d0-5aed06258579",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 2.2770369052886963 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Disease_CUI</th>\n",
       "      <th>Positive_Findings</th>\n",
       "      <th>Pos_Find_CUIs</th>\n",
       "      <th>Pos_Find_Freqs</th>\n",
       "      <th>Negative_Findings</th>\n",
       "      <th>Neg_Find_CUIs</th>\n",
       "      <th>Neg_Find_Freqs</th>\n",
       "      <th>Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Acute posthaemorrhagic anaemia</td>\n",
       "      <td>C0154298</td>\n",
       "      <td>[bleeding/hemorrhage nos, Transient Ischemic A...</td>\n",
       "      <td>[C0497131, C0007787, C0014591, C0019080, C1135...</td>\n",
       "      <td>[0.237134365305756, 0.204020027632119, 0.22685...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>1.129865</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Transient Ischemic Attack</td>\n",
       "      <td>C0007787</td>\n",
       "      <td>[Epistaxis, Heart Failure, Systolic]</td>\n",
       "      <td>[C0014591, C1135191]</td>\n",
       "      <td>[0.244708389348131, 0.262646867343228]</td>\n",
       "      <td>[Acute myocardial infarction, Dizziness, Acute...</td>\n",
       "      <td>[C0155626, C0012833, C0154298]</td>\n",
       "      <td>[0.221986317221007, 0.205243737758916, 0.20402...</td>\n",
       "      <td>-0.123895</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Angina Pectoris</td>\n",
       "      <td>C0002962</td>\n",
       "      <td>[bleeding/hemorrhage nos]</td>\n",
       "      <td>[C0497131]</td>\n",
       "      <td>[0.200903982257697]</td>\n",
       "      <td>[Acute Coronary Syndrome, Hydrocephalus]</td>\n",
       "      <td>[C0948089, C0020255]</td>\n",
       "      <td>[0.263360836616665, 0.223284721342557]</td>\n",
       "      <td>-0.285742</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Iron deficiency anemia secondary to chronic bl...</td>\n",
       "      <td>C0154286</td>\n",
       "      <td>[Epistaxis]</td>\n",
       "      <td>[C0014591]</td>\n",
       "      <td>[0.214495524212065]</td>\n",
       "      <td>[Malignant Neoplasms, Hemoptysis, Little's Dis...</td>\n",
       "      <td>[C0006826, C0019079, C0023882]</td>\n",
       "      <td>[0.214646541344892, 0.209002276005508, 0.20324...</td>\n",
       "      <td>-0.412402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Acute myocardial infarction</td>\n",
       "      <td>C0155626</td>\n",
       "      <td>[Transient Ischemic Attack]</td>\n",
       "      <td>[C0007787]</td>\n",
       "      <td>[0.221986317221007]</td>\n",
       "      <td>[THYROID HORMONE PLASMA MEMBRANE TRANSPORT DEF...</td>\n",
       "      <td>[C1861101, C0410422, C1761609]</td>\n",
       "      <td>[0.241622675849386, 0.213465540173336, 0.20090...</td>\n",
       "      <td>-0.434006</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             Disease Disease_CUI  \\\n",
       "0                     Acute posthaemorrhagic anaemia    C0154298   \n",
       "1                          Transient Ischemic Attack    C0007787   \n",
       "2                                    Angina Pectoris    C0002962   \n",
       "3  Iron deficiency anemia secondary to chronic bl...    C0154286   \n",
       "4                        Acute myocardial infarction    C0155626   \n",
       "\n",
       "                                   Positive_Findings  \\\n",
       "0  [bleeding/hemorrhage nos, Transient Ischemic A...   \n",
       "1               [Epistaxis, Heart Failure, Systolic]   \n",
       "2                          [bleeding/hemorrhage nos]   \n",
       "3                                        [Epistaxis]   \n",
       "4                        [Transient Ischemic Attack]   \n",
       "\n",
       "                                       Pos_Find_CUIs  \\\n",
       "0  [C0497131, C0007787, C0014591, C0019080, C1135...   \n",
       "1                               [C0014591, C1135191]   \n",
       "2                                         [C0497131]   \n",
       "3                                         [C0014591]   \n",
       "4                                         [C0007787]   \n",
       "\n",
       "                                      Pos_Find_Freqs  \\\n",
       "0  [0.237134365305756, 0.204020027632119, 0.22685...   \n",
       "1             [0.244708389348131, 0.262646867343228]   \n",
       "2                                [0.200903982257697]   \n",
       "3                                [0.214495524212065]   \n",
       "4                                [0.221986317221007]   \n",
       "\n",
       "                                   Negative_Findings  \\\n",
       "0                                                 []   \n",
       "1  [Acute myocardial infarction, Dizziness, Acute...   \n",
       "2           [Acute Coronary Syndrome, Hydrocephalus]   \n",
       "3  [Malignant Neoplasms, Hemoptysis, Little's Dis...   \n",
       "4  [THYROID HORMONE PLASMA MEMBRANE TRANSPORT DEF...   \n",
       "\n",
       "                    Neg_Find_CUIs  \\\n",
       "0                              []   \n",
       "1  [C0155626, C0012833, C0154298]   \n",
       "2            [C0948089, C0020255]   \n",
       "3  [C0006826, C0019079, C0023882]   \n",
       "4  [C1861101, C0410422, C1761609]   \n",
       "\n",
       "                                      Neg_Find_Freqs  Probability  \n",
       "0                                                 []     1.129865  \n",
       "1  [0.221986317221007, 0.205243737758916, 0.20402...    -0.123895  \n",
       "2             [0.263360836616665, 0.223284721342557]    -0.285742  \n",
       "3  [0.214646541344892, 0.209002276005508, 0.20324...    -0.412402  \n",
       "4  [0.241622675849386, 0.213465540173336, 0.20090...    -0.434006  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Test the rare disease search function\n",
    "start_time = time.time()\n",
    "test_result = DDx(bleed_out_entities)\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "\n",
    "test_result.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "f33f6548-5c44-4bfd-8ee7-a96f0a6dca48",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Empty DataFrame\n",
      "Columns: [Known_CUI, Known_Problem, CUI, Problem, Score]\n",
      "Index: []\n"
     ]
    }
   ],
   "source": [
    "    cui_prob_list = ['C1405315']\n",
    "    # Get NLP-derived problem matches\n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"]\n",
    "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r, c\n",
    "    RETURN c.cui AS `Known_CUI`, c.term AS `Known_Problem`, ord.cui AS `CUI`, ord.term AS `Problem`, Score\n",
    "    ORDER BY r.co_occurrence_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    likely_comorbidities_NLP = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    # Get ICD-coded problem matches\n",
    "    query = '''\n",
    "    MATCH p=(ord:D_Icd_Diagnoses)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} \n",
    "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r, c\n",
    "    RETURN c.cui AS `Known_CUI`, c.term AS `Known_Problem`, ord.icd9_code AS `CUI`, ord.long_title AS `Problem`, Score\n",
    "    ORDER BY r.co_occurrence_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    likely_comorbidities_ICD = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    # Combine the NLP-derived and ICD-coded dataframes for output\n",
    "    likely_comorbidities = likely_comorbidities_NLP.append(likely_comorbidities_ICD)\n",
    "    try:\n",
    "        likely_comorbidities.sort_values(by='Score', ascending=False, inplace=True)\n",
    "        likely_comorbidities.head(10)\n",
    "    except:\n",
    "        likely_comorbidities = pd.DataFrame(columns = ['Known_CUI', 'Known_Problem', 'CUI', 'Problem', 'Score'])\n",
    "        likely_comorbidities.iloc[0:0] = 'No results'\n",
    "        print(likely_comorbidities.head(10))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8944dee6-c19f-4b50-a466-76b71eee3df8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Known_CUI</th>\n",
       "      <th>Known_Problem</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C4046002</td>\n",
       "      <td>Research Related Injuries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C4046002</td>\n",
       "      <td>Research-Related Injuries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C4046002</td>\n",
       "      <td>Research-Related Injury</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0862970</td>\n",
       "      <td>Resectable Bile Duct Adenocarcinoma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0854792</td>\n",
       "      <td>Resectable Bile Duct Cancer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>985</th>\n",
       "      <td>C3281186</td>\n",
       "      <td>Restrictive ventilation disorder due to severe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>986</th>\n",
       "      <td>C0036351</td>\n",
       "      <td>Restzustand</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>987</th>\n",
       "      <td>C0036351</td>\n",
       "      <td>Restzustand (schizophrenic)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>988</th>\n",
       "      <td>C0036351</td>\n",
       "      <td>Restzustand, schizophrenic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>989</th>\n",
       "      <td>C0036351</td>\n",
       "      <td>Restzustand; schizophrenic</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>990 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Known_CUI                                      Known_Problem\n",
       "0    C4046002                          Research Related Injuries\n",
       "1    C4046002                          Research-Related Injuries\n",
       "2    C4046002                            Research-Related Injury\n",
       "3    C0862970                Resectable Bile Duct Adenocarcinoma\n",
       "4    C0854792                        Resectable Bile Duct Cancer\n",
       "..        ...                                                ...\n",
       "985  C3281186  Restrictive ventilation disorder due to severe...\n",
       "986  C0036351                                        Restzustand\n",
       "987  C0036351                        Restzustand (schizophrenic)\n",
       "988  C0036351                         Restzustand, schizophrenic\n",
       "989  C0036351                         Restzustand; schizophrenic\n",
       "\n",
       "[990 rows x 2 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Get a list of autocomplete terms\n",
    "startingtext = 'Res'\n",
    "query = '''\n",
    "MATCH (c1:Concept)\n",
    "WHERE c1.term STARTS WITH '{startingtext}' AND c1.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"] \n",
    "RETURN DISTINCT(c1.cui) AS `Known_CUI`, c1.term AS `Known_Problem`\n",
    "'''.format(startingtext=startingtext)\n",
    "data = session.run(query)\n",
    "autocomplete_problems_prompts = pd.DataFrame([dict(record) for record in data])\n",
    "autocomplete_problems_prompts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "78030c08-4284-4954-9889-d0bce796ccae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Known_CUI</th>\n",
       "      <th>Known_Problem</th>\n",
       "      <th>CUI</th>\n",
       "      <th>Problem</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>Ketoacidosis</td>\n",
       "      <td>0.61598</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>Pancreatitis, Chronic</td>\n",
       "      <td>0.56788</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0151723</td>\n",
       "      <td>Hypomagnesemia</td>\n",
       "      <td>0.51528</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0236663</td>\n",
       "      <td>Alcohol withdrawal syndrome</td>\n",
       "      <td>0.51037</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C1963823</td>\n",
       "      <td>Hyperlipasaemia</td>\n",
       "      <td>0.46902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>Suicidal</td>\n",
       "      <td>0.46201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0747752</td>\n",
       "      <td>Polysubstance abuse</td>\n",
       "      <td>0.45843</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0162316</td>\n",
       "      <td>Iron deficiency anemia</td>\n",
       "      <td>0.44179</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C3159311</td>\n",
       "      <td>BORNHOLM EYE DISEASE</td>\n",
       "      <td>0.42945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0232498</td>\n",
       "      <td>Abdominal tenderness</td>\n",
       "      <td>0.42369</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Known_CUI  Known_Problem       CUI                      Problem    Score\n",
       "0  C0085762  Alcohol abuse  C0220982                 Ketoacidosis  0.61598\n",
       "1  C0085762  Alcohol abuse  C0149521        Pancreatitis, Chronic  0.56788\n",
       "2  C0085762  Alcohol abuse  C0151723               Hypomagnesemia  0.51528\n",
       "3  C0085762  Alcohol abuse  C0236663  Alcohol withdrawal syndrome  0.51037\n",
       "4  C0085762  Alcohol abuse  C1963823              Hyperlipasaemia  0.46902\n",
       "5  C0085762  Alcohol abuse  C0438696                     Suicidal  0.46201\n",
       "6  C0085762  Alcohol abuse  C0747752          Polysubstance abuse  0.45843\n",
       "7  C0085762  Alcohol abuse  C0162316       Iron deficiency anemia  0.44179\n",
       "8  C0085762  Alcohol abuse  C3159311         BORNHOLM EYE DISEASE  0.42945\n",
       "9  C0085762  Alcohol abuse  C0232498         Abdominal tenderness  0.42369"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "    cui_prob_list = ['C1565489', 'C0085762']\n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"]\n",
    "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r, c\n",
    "    RETURN c.cui AS `Known_CUI`, c.term AS `Known_Problem`, ord.cui AS `CUI`, ord.term AS `Problem`, Score\n",
    "    ORDER BY r.co_occurrence_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    likely_comorbidities_NLP = pd.DataFrame([dict(record) for record in data])\n",
    "    likely_comorbidities_NLP"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e70e22dc-bdfa-4d3b-b37e-602cbb3dbc96",
   "metadata": {},
   "outputs": [],
   "source": [
    "# get a CSV of all problems in the database that have enough data to potentially return robust results\n",
    "query = '''\n",
    "MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r, c\n",
    "WHERE Score > 20\n",
    "RETURN distinct(c.term) AS Problem, c.cui'''\n",
    "data = session.run(query)\n",
    "\n",
    "# Convert the neo4j object into a dataframe\n",
    "common_problems_df = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b22b925d-5588-4f43-b4c4-4c6a651683d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Abnormally opaque structure (morphologic abnormality)',\n",
       " 'Acidosis',\n",
       " 'Acidosis, Lactic',\n",
       " 'Acidosis, Respiratory',\n",
       " 'Actinic cheilitis',\n",
       " 'Acute respiratory failure',\n",
       " 'Aggressive Periodontitis',\n",
       " 'Agitation',\n",
       " 'Alcohol Withdrawal Delirium',\n",
       " 'Alcohol abuse',\n",
       " 'Alcohol withdrawal syndrome',\n",
       " 'Alkalosis, Respiratory',\n",
       " 'Aneurysm',\n",
       " 'Apnea',\n",
       " 'Ascites',\n",
       " 'Back Pain',\n",
       " 'Blood Clot',\n",
       " 'Bronchospasm',\n",
       " 'Cardiac Arrhythmia',\n",
       " 'Cerebrovascular accident',\n",
       " 'Chest Pain',\n",
       " 'Cholangiocarcinoma',\n",
       " 'Chronic Kidney Diseases',\n",
       " 'Chronic back pain',\n",
       " 'Confusion',\n",
       " 'Contraction (finding)',\n",
       " 'Coughing',\n",
       " 'Dentatorubral-Pallidoluysian Atrophy',\n",
       " 'Desmoplastic infantile ganglioglioma',\n",
       " 'Diabetes Mellitus, Non-Insulin-Dependent',\n",
       " 'Diabetic Ketoacidosis',\n",
       " 'Diastolic dysfunction',\n",
       " 'Disease',\n",
       " 'Disease Progression',\n",
       " 'Dry skin',\n",
       " 'Dyspnea',\n",
       " 'Encephalitis',\n",
       " 'Epilepsy',\n",
       " 'Esophageal Varices',\n",
       " 'Fatigue',\n",
       " 'Febrile Neutropenia',\n",
       " 'Flare',\n",
       " 'Fluid overload',\n",
       " 'Gastrointestinal Hemorrhage',\n",
       " 'Gastroparesis',\n",
       " 'Headache',\n",
       " 'Hematemesis',\n",
       " 'Hematoma, Subdural',\n",
       " 'Hematuria',\n",
       " 'Hemorrhage',\n",
       " 'Hepatic Encephalopathy',\n",
       " 'Hydrocephalus, Normal Pressure',\n",
       " 'Hyperglycemia',\n",
       " 'Hypersensitivity',\n",
       " 'Hypertensive urgency',\n",
       " 'Hypocalcemia',\n",
       " 'INFECTIOUS PROCESS',\n",
       " 'Ileus',\n",
       " 'Infarction',\n",
       " 'Infection',\n",
       " 'Influenza',\n",
       " 'Kidney Diseases',\n",
       " 'Kidney Failure, Chronic',\n",
       " 'Lethargy',\n",
       " 'Liver Failure',\n",
       " 'Liver diseases',\n",
       " 'Mental status changes',\n",
       " 'Metabolic alkalosis',\n",
       " 'Multiple Myeloma',\n",
       " 'Neoplasms',\n",
       " 'Normocytic anemia',\n",
       " 'Nutritional Deficiency',\n",
       " 'Obstruction',\n",
       " 'Oliguria',\n",
       " 'POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE',\n",
       " 'Paroxysmal atrial fibrillation',\n",
       " 'Pathological Dilatation',\n",
       " 'Pathology processes',\n",
       " 'Pericardial effusion',\n",
       " 'Pleural effusion disorder',\n",
       " 'Pneumothorax',\n",
       " 'Polysubstance abuse',\n",
       " 'Pressure Ulcer',\n",
       " 'Pulmonary Edema',\n",
       " 'Renal Insufficiency',\n",
       " 'Seizures',\n",
       " 'Sepsis due to urinary tract infection',\n",
       " 'Shock',\n",
       " 'Shock, Cardiogenic',\n",
       " 'Sinus Tachycardia',\n",
       " 'Somnolence',\n",
       " 'Sore to touch',\n",
       " 'Toxic effect',\n",
       " 'Ulcer',\n",
       " 'Uremia',\n",
       " 'Urinary tract infection',\n",
       " 'Vomiting',\n",
       " 'Wheezing',\n",
       " 'Xanthomatosis, Cerebrotendinous',\n",
       " 'diastolic congestive heart failure',\n",
       " 'gastrointestinal gas',\n",
       " 'physiologic resolution']"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "common_problems_df.sort_values(by='Problem', inplace=True)\n",
    "common_problems_df.Problem.to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "8692c0ca-8e3b-4533-b54f-da4ece1f29a8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Trim out problems that seem to be spurious\n",
    "spurious = ['Abnormally opaque structure (morphologic abnormality)', 'Actinic cheilitis', 'Aggressive Periodontitis', 'Dentatorubral-Pallidoluysian Atrophy', 'Desmoplastic infantile ganglioglioma',  'Disease', 'Disease Progression', 'Flare', 'Obstruction', 'POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE',  'Pathological Dilatation', 'Pathology processes', 'Sore to touch', 'Xanthomatosis, Cerebrotendinous',  'diastolic congestive heart failure', 'gastrointestinal gas', 'physiologic resolution']\n",
    "common_problems_df = common_problems_df[~common_problems_df.Problem.isin(spurious)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "84225b8d-d07b-42c4-a47f-6e36660b4517",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "common_problems_df.to_csv('common_problems.csv', index=False, encoding='utf-8')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "216368ad-b8d5-415c-b23a-91bf039df33f",
   "metadata": {},
   "source": [
    "## Modify existing functions for the new data model\n",
    "### Input a list of CUIs for known problems, output possible additional problems with their CUIs and odds ratios in a dataframe\n",
    "Note: This query relies on the OCCURS_WITH relationship, which was created in the [Virtual_Population](Documents/P2_Prototype/Virtual_Population.ipynb) notebook under the section \"Using Conditional Probability instead of Odds Ratio.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "91c2d2ea-71fe-4a9c-ac30-805351261a88",
   "metadata": {},
   "outputs": [],
   "source": [
    "def PotentialComorbidities(cui_prob_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"]\n",
    "    WITH round(r.co_occurrance_probability, 5) AS Score, ord, r, c\n",
    "    RETURN c.cui AS `Known_CUI`, c.term AS `Known_Problem`, ord.cui AS `Likely_CUI`, ord.term AS `Likely_Problem`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    likely_comorbidities = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    return likely_comorbidities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "49fabae8-92fa-47d3-b4b6-edbf8c2a5342",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.0643320083618164 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Known_CUI</th>\n",
       "      <th>Known_Problem</th>\n",
       "      <th>Likely_CUI</th>\n",
       "      <th>Likely_Problem</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0162316</td>\n",
       "      <td>Iron deficiency anemia</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0948268</td>\n",
       "      <td>Hemodynamic instability</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0394996</td>\n",
       "      <td>Acute alcoholic intoxication</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C4761312</td>\n",
       "      <td>Nutritional Deficiency</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>Ketoacidosis</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0677042</td>\n",
       "      <td>Pathology processes</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>Pancreatitis, Chronic</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0151723</td>\n",
       "      <td>Hypomagnesemia</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>Alcohol abuse</td>\n",
       "      <td>C0338908</td>\n",
       "      <td>Mixed anxiety and depressive disorder</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C1565489</td>\n",
       "      <td>Renal Insufficiency</td>\n",
       "      <td>C2826321</td>\n",
       "      <td>Refractory Thrombocytopenia</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Known_CUI        Known_Problem Likely_CUI  \\\n",
       "0  C0085762        Alcohol abuse   C0162316   \n",
       "1  C0085762        Alcohol abuse   C0948268   \n",
       "2  C0085762        Alcohol abuse   C0394996   \n",
       "3  C0085762        Alcohol abuse   C4761312   \n",
       "4  C0085762        Alcohol abuse   C0220982   \n",
       "5  C0085762        Alcohol abuse   C0677042   \n",
       "6  C0085762        Alcohol abuse   C0149521   \n",
       "7  C0085762        Alcohol abuse   C0151723   \n",
       "8  C0085762        Alcohol abuse   C0338908   \n",
       "9  C1565489  Renal Insufficiency   C2826321   \n",
       "\n",
       "                          Likely_Problem Score  \n",
       "0                 Iron deficiency anemia  None  \n",
       "1                Hemodynamic instability  None  \n",
       "2           Acute alcoholic intoxication  None  \n",
       "3                 Nutritional Deficiency  None  \n",
       "4                           Ketoacidosis  None  \n",
       "5                    Pathology processes  None  \n",
       "6                  Pancreatitis, Chronic  None  \n",
       "7                         Hypomagnesemia  None  \n",
       "8  Mixed anxiety and depressive disorder  None  \n",
       "9            Refractory Thrombocytopenia  None  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Test the function\n",
    "start_time = time.time()\n",
    "\n",
    "cui_prob_list = ['C1565489', 'C0085762']\n",
    "PotentialComorbidities = PotentialComorbidities(cui_prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "PotentialComorbidities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bef509fe-94f1-417f-8ff9-a696cb4afb8a",
   "metadata": {},
   "source": [
    "### Input 1 problem, output the most likely orders\n",
    "Note: This query relies on the OCCURS_WITH relationship, which was created in the [Virtual_Population](Documents/P2_Prototype/Virtual_Population.ipynb) notebook under the section \"Using Conditional Probability instead of Odds Ratio.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "ef2d8b50-e0bd-4fc1-ab0a-5c8bf9333d5f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def LikelyOrders(cui_prob_list):\n",
    "    \n",
    "    # Find prescriptions associated with the input problem    \n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Drug']\"]\n",
    "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r\n",
    "    RETURN ord.cui AS `Code`, ord.term AS `Order`, Score\n",
    "    ORDER BY r.co_occurrence_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_rx = pd.DataFrame([dict(record) for record in data]).head(10)\n",
    "    \n",
    "    # Find abnormal labs associated with the input problem\n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Attribute']\"]\n",
    "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r\n",
    "    RETURN ord.cui AS `Code`, ord.description AS `Order`, Score\n",
    "    ORDER BY r.co_occurrence_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_lab = pd.DataFrame([dict(record) for record in data]).head(10)\n",
    "    \n",
    "    # Find procedures associated with the input problem\n",
    "    query = '''\n",
    "    MATCH p=(ord:D_Icd_Procedures)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list}\n",
    "    WITH round(r.co_occurrence_probability, 5) AS Score, ord, r\n",
    "    RETURN ord.icd9_code AS `Code`, ord.long_title AS `Order`, Score\n",
    "    ORDER BY r.co_occurrence_probability DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_procedure = pd.DataFrame([dict(record) for record in data]).head(10)\n",
    "    \n",
    "    return orders_likely_rx, orders_likely_lab, orders_likely_procedure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6674e54d-f32a-40d8-b836-9a77421a2e48",
   "metadata": {},
   "outputs": [],
   "source": [
    "MATCH (source:Concept {cui:'C0022661'})\n",
    "MATCH (destination:Concept {cui:'C0975120'})\n",
    "CALL gds.alpha.shortestPath.stream({\n",
    "    startNode: source,\n",
    "    endNode: destination,\n",
    "    nodeProjection: \n",
    "})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "173f99af-4cd7-4b2c-9cd4-9bfb2a0bac0a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.023564577102661133 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "cui_prob_list = ['C0022661']\n",
    "orders_likely_rx, orders_likely_lab, orders_likely_procedure = LikelyOrders(cui_prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "32b56beb-a602-487a-a162-83db287dd2ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0975120</td>\n",
       "      <td>calcitriol 0.00025 MG Oral Capsule</td>\n",
       "      <td>0.62000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C1967412</td>\n",
       "      <td>sevelamer carbonate 800 MG Oral Tablet [Renvela]</td>\n",
       "      <td>0.60450</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C1951501</td>\n",
       "      <td>sodium polystyrene sulfonate 250 MG/ML Oral Su...</td>\n",
       "      <td>0.58420</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0706911</td>\n",
       "      <td>1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]</td>\n",
       "      <td>0.44712</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C4082775</td>\n",
       "      <td>150 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>0.42971</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0710995</td>\n",
       "      <td>purified protein derivative of tuberculin 50 U...</td>\n",
       "      <td>0.39966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0691839</td>\n",
       "      <td>sodium bicarbonate 650 MG Oral Tablet</td>\n",
       "      <td>0.37536</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0978650</td>\n",
       "      <td>midodrine hydrochloride 5 MG Oral Tablet</td>\n",
       "      <td>0.35985</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C1169852</td>\n",
       "      <td>piperacillin 2000 MG / tazobactam 250 MG Injec...</td>\n",
       "      <td>0.35321</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C0975350</td>\n",
       "      <td>cefepime 1000 MG Injection</td>\n",
       "      <td>0.33979</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Code                                              Order    Score\n",
       "0  C0975120                 calcitriol 0.00025 MG Oral Capsule  0.62000\n",
       "1  C1967412   sevelamer carbonate 800 MG Oral Tablet [Renvela]  0.60450\n",
       "2  C1951501  sodium polystyrene sulfonate 250 MG/ML Oral Su...  0.58420\n",
       "3  C0706911  1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]  0.44712\n",
       "4  C4082775                  150 ML Glucose 50 MG/ML Injection  0.42971\n",
       "5  C0710995  purified protein derivative of tuberculin 50 U...  0.39966\n",
       "6  C0691839              sodium bicarbonate 650 MG Oral Tablet  0.37536\n",
       "7  C0978650           midodrine hydrochloride 5 MG Oral Tablet  0.35985\n",
       "8  C1169852  piperacillin 2000 MG / tazobactam 250 MG Injec...  0.35321\n",
       "9  C0975350                         cefepime 1000 MG Injection  0.33979"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_rx"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "8cbe6cc3-f3c3-44d8-8150-e94ee560db1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C1544491</td>\n",
       "      <td>Macrophage in Ascites</td>\n",
       "      <td>0.77165</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0549816</td>\n",
       "      <td>Lymphocytes in Other Body Fluid</td>\n",
       "      <td>0.76913</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0942476</td>\n",
       "      <td>Polys in Other Body Fluid</td>\n",
       "      <td>0.71643</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0942444</td>\n",
       "      <td>Lymphocytes in Ascites</td>\n",
       "      <td>0.70352</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0942425</td>\n",
       "      <td>RBC, Ascites in Ascites</td>\n",
       "      <td>0.68548</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0945358</td>\n",
       "      <td>WBC, Ascites in Ascites</td>\n",
       "      <td>0.67514</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0942450</td>\n",
       "      <td>Monocytes in Ascites</td>\n",
       "      <td>0.66127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0942478</td>\n",
       "      <td>Polys in Ascites</td>\n",
       "      <td>0.64904</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C0365034</td>\n",
       "      <td>Protein/Creatinine Ratio in Urine</td>\n",
       "      <td>0.63874</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C0368042</td>\n",
       "      <td>pH in Urine</td>\n",
       "      <td>0.59096</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Code                              Order    Score\n",
       "0  C1544491              Macrophage in Ascites  0.77165\n",
       "1  C0549816    Lymphocytes in Other Body Fluid  0.76913\n",
       "2  C0942476          Polys in Other Body Fluid  0.71643\n",
       "3  C0942444             Lymphocytes in Ascites  0.70352\n",
       "4  C0942425            RBC, Ascites in Ascites  0.68548\n",
       "5  C0945358            WBC, Ascites in Ascites  0.67514\n",
       "6  C0942450               Monocytes in Ascites  0.66127\n",
       "7  C0942478                   Polys in Ascites  0.64904\n",
       "8  C0365034  Protein/Creatinine Ratio in Urine  0.63874\n",
       "9  C0368042                        pH in Urine  0.59096"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_lab"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "f07e36d8-a1fa-447e-bffa-c2d0e6799c55",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3995</td>\n",
       "      <td>Hemodialysis</td>\n",
       "      <td>0.75877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3895</td>\n",
       "      <td>Venous catheterization for renal dialysis</td>\n",
       "      <td>0.70488</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>4513</td>\n",
       "      <td>Other endoscopy of small intestine</td>\n",
       "      <td>0.26072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3324</td>\n",
       "      <td>Closed [endoscopic] biopsy of bronchus</td>\n",
       "      <td>0.24204</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3893</td>\n",
       "      <td>Venous catheterization, not elsewhere classified</td>\n",
       "      <td>0.22290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>9904</td>\n",
       "      <td>Transfusion of packed cells</td>\n",
       "      <td>0.22250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>9604</td>\n",
       "      <td>Insertion of endotracheal tube</td>\n",
       "      <td>0.20985</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Code                                             Order    Score\n",
       "0  3995                                      Hemodialysis  0.75877\n",
       "1  3895         Venous catheterization for renal dialysis  0.70488\n",
       "2  4513                Other endoscopy of small intestine  0.26072\n",
       "3  3324            Closed [endoscopic] biopsy of bronchus  0.24204\n",
       "4  3893  Venous catheterization, not elsewhere classified  0.22290\n",
       "5  9904                       Transfusion of packed cells  0.22250\n",
       "6  9604                    Insertion of endotracheal tube  0.20985"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_procedure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "fe13a9d6-1588-43a2-af6e-f6fa77e16e1c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "      <th>Type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C1544491</td>\n",
       "      <td>Macrophage in Ascites</td>\n",
       "      <td>0.77165</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0549816</td>\n",
       "      <td>Lymphocytes in Other Body Fluid</td>\n",
       "      <td>0.76913</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3995</td>\n",
       "      <td>Hemodialysis</td>\n",
       "      <td>0.75877</td>\n",
       "      <td>Procedure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0942476</td>\n",
       "      <td>Polys in Other Body Fluid</td>\n",
       "      <td>0.71643</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3895</td>\n",
       "      <td>Venous catheterization for renal dialysis</td>\n",
       "      <td>0.70488</td>\n",
       "      <td>Procedure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0942444</td>\n",
       "      <td>Lymphocytes in Ascites</td>\n",
       "      <td>0.70352</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0942425</td>\n",
       "      <td>RBC, Ascites in Ascites</td>\n",
       "      <td>0.68548</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0945358</td>\n",
       "      <td>WBC, Ascites in Ascites</td>\n",
       "      <td>0.67514</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0942450</td>\n",
       "      <td>Monocytes in Ascites</td>\n",
       "      <td>0.66127</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0942478</td>\n",
       "      <td>Polys in Ascites</td>\n",
       "      <td>0.64904</td>\n",
       "      <td>Lab</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Code                                      Order    Score       Type\n",
       "0  C1544491                      Macrophage in Ascites  0.77165        Lab\n",
       "1  C0549816            Lymphocytes in Other Body Fluid  0.76913        Lab\n",
       "0      3995                               Hemodialysis  0.75877  Procedure\n",
       "2  C0942476                  Polys in Other Body Fluid  0.71643        Lab\n",
       "1      3895  Venous catheterization for renal dialysis  0.70488  Procedure\n",
       "3  C0942444                     Lymphocytes in Ascites  0.70352        Lab\n",
       "4  C0942425                    RBC, Ascites in Ascites  0.68548        Lab\n",
       "5  C0945358                    WBC, Ascites in Ascites  0.67514        Lab\n",
       "6  C0942450                       Monocytes in Ascites  0.66127        Lab\n",
       "7  C0942478                           Polys in Ascites  0.64904        Lab"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_rx['Type'] = 'Prescription'\n",
    "orders_likely_lab['Type'] = 'Lab'\n",
    "orders_likely_procedure['Type'] = 'Procedure'\n",
    "AssocOrders = pd.concat([orders_likely_rx, orders_likely_lab, orders_likely_procedure])\n",
    "AssocOrders.sort_values('Score', ascending = False, inplace = True)\n",
    "AssocOrders = AssocOrders.head(10)\n",
    "AssocOrders"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
