{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "2b52634a-f573-4d72-a5d1-a2c241283757",
   "metadata": {},
   "source": [
    "# Virtualized Patient Population"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5701f88b-c58b-469a-9da6-1055e6b93639",
   "metadata": {},
   "source": [
    "To-Do:\n",
    "- Incorporate ICD diagnoses into problems\n",
    "- Incorporate ICD procedures into treatments\n",
    "- Create OCCURS_WITH relationships between entities of interest that have z-scores or odds ratios\n",
    "- Figure out how to add timedeltas between problems and the change in z-scores for labs or the occurrance of prescriptions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "1f733621-b233-4472-9966-28bc7dd1215b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "from progressbar import ProgressBar\n",
    "import pandas as pd\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "93bbac78-1362-4ee4-b6ed-bd6e111e9da3",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j','NikeshIsCool'))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "77e3cdb0-c2d8-4b28-b720-5d5e390d0f95",
   "metadata": {},
   "source": [
    "Entities of interest:\n",
    "- Problem\n",
    "- Prescriptions -> Concept\n",
    "- Labevents -> D_Labitems -> Concept\n",
    "- Diagnoses_Icd -> D_Icd_Diagnoses -> Concept (timedelta of limited utility, since ICD codes pertain to entire admission)\n",
    "- Procedures_Icd -> D_Icd_Procedures -> Concept (timedelta of limited utility, since ICD codes pertain to entire admission)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9507212d-6d21-4e00-8f5d-a46622915002",
   "metadata": {},
   "source": [
    "Relationships to create between entities of interest:\n",
    "![virtualized relationships](images/Virtual_relationship_schema.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7e1d71c-440a-459b-8b5e-c00c4cd01f81",
   "metadata": {},
   "source": [
    "We'll start with these relationships to improve performance on our current use cases:  \n",
    "(:Problem) - [:INSTANCE_OF] -> (:Concept) - [:OCCURS_WITH {co_occurrance_probability: __, source: 'MIMIC-III v1.4', updated: timestamp}] - (:Concept) <- [:INSTANCE_OF] - (:Prescriptions)  \n",
    "(:Problem) - [:INSTANCE_OF] -> (:Concept) - [:OCCURS_WITH {co_occurrance_probability: __, z_score: __, source: 'MIMIC-III v1.4', updated: timestamp}] - (:Concept) <- [:INSTANCE_OF] - (:Labevents)  \n",
    "\n",
    "The essential equation used to determine co-occurance probability for our purposes is:  \n",
    "(Probability of A and B co-occuring during an admission) / (Probability of A + Probability of B)  \n",
    "\n",
    "For labs, we calculate the probability that the lab will be flagged as abnormal, not the probability that it will be ordered. For prescriptions and procedures, we calculate the probability that they will be ordered."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2d569796-53a2-437d-aa68-3dddf323e5de",
   "metadata": {},
   "source": [
    "## Probability of a prescription-problem pair occuring together vs separately"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "882e3e58-de76-4710-9474-160d9850dbcf",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(ad)) AS probTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability, Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "ORDER BY problem_gen_pop_probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "25aa9a68-87c1-4eaf-99e1-4d8a406f80b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each prescription in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD]-(rx:Prescriptions)-[:INSTANCE_OF]->(b:Concept)\n",
    "WITH b.cui AS Rx_CUI, count(distinct(ad)) AS RxTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Rx_CUI, toFloat(RxTotal)/ptTotal AS RxProbability\n",
    "ORDER BY RxProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Rx_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "b0807c7f-13b3-4df5-b528-e7135338e121",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of prescription and problem\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients), (p:Problem)<-[:HAD_PROBLEM]-(Pt)-[:HAD]-(rx:Prescriptions)-[:INSTANCE_OF]->(c:Concept)\n",
    "WITH p.cui AS Problem_CUI, c.cui AS Rx_CUI, count(distinct(ad)) AS RxProbTotal, ptTotal, count(distinct(Pt)) AS Pts\n",
    "WHERE Pts > 20\n",
    "RETURN Problem_CUI, Rx_CUI, toFloat(RxProbTotal)/ptTotal AS Rx_Problem_Probability\n",
    "ORDER BY Rx_Problem_Probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Rx_Problem_Probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "a2e2c3bf-ca44-4347-8acf-9d9788c65d45",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "465\n",
      "946\n",
      "11073\n"
     ]
    }
   ],
   "source": [
    "print(len(problem_gen_pop_probability))\n",
    "print(len(Rx_gen_pop_probability))\n",
    "print(len(Rx_Problem_Probability))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "7ebd724a-ed20-4a2f-98e1-11c57e6e9558",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>RxProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.008665</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.022833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.007698</td>\n",
       "      <td>0.008427</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.020343</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.007291</td>\n",
       "      <td>0.007902</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.019295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.006664</td>\n",
       "      <td>0.007138</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.017670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.006613</td>\n",
       "      <td>0.007003</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.017541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11068</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0980635</td>\n",
       "      <td>0.001882</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.031708</td>\n",
       "      <td>0.053314</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11069</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001713</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.096743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11070</th>\n",
       "      <td>C0236663</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001543</td>\n",
       "      <td>0.001797</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.097015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11071</th>\n",
       "      <td>C1321878</td>\n",
       "      <td>C0354080</td>\n",
       "      <td>0.000899</td>\n",
       "      <td>0.002120</td>\n",
       "      <td>0.028639</td>\n",
       "      <td>0.029217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11072</th>\n",
       "      <td>C0014867</td>\n",
       "      <td>C0689706</td>\n",
       "      <td>0.001085</td>\n",
       "      <td>0.001611</td>\n",
       "      <td>0.018499</td>\n",
       "      <td>0.053963</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>11073 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability  \\\n",
       "0        C0022661  C0977439                0.008665   \n",
       "1        C0020517  C0977439                0.007698   \n",
       "2        C0011860  C0977439                0.007291   \n",
       "3        C2830004  C0977439                0.006664   \n",
       "4        C0039239  C0977439                0.006613   \n",
       "...           ...       ...                     ...   \n",
       "11068    C0085762  C0980635                0.001882   \n",
       "11069    C0085762  C0688559                0.001713   \n",
       "11070    C0236663  C0688559                0.001543   \n",
       "11071    C1321878  C0354080                0.000899   \n",
       "11072    C0014867  C0689706                0.001085   \n",
       "\n",
       "       problem_gen_pop_probability  RxProbability  co_occurrance_probability  \n",
       "0                         0.009495       0.369981                   0.022833  \n",
       "1                         0.008427       0.369981                   0.020343  \n",
       "2                         0.007902       0.369981                   0.019295  \n",
       "3                         0.007138       0.369981                   0.017670  \n",
       "4                         0.007003       0.369981                   0.017541  \n",
       "...                            ...            ...                        ...  \n",
       "11068                     0.003595       0.031708                   0.053314  \n",
       "11069                     0.003595       0.014107                   0.096743  \n",
       "11070                     0.001797       0.014107                   0.097015  \n",
       "11071                     0.002120       0.028639                   0.029217  \n",
       "11072                     0.001611       0.018499                   0.053963  \n",
       "\n",
       "[11073 rows x 6 columns]"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability_merged = pd.merge(Rx_Problem_Probability, problem_gen_pop_probability, on=['Problem_CUI'])\n",
    "Rx_Problem_Probability_merged = pd.merge(Rx_Problem_Probability_merged, Rx_gen_pop_probability, on=['Rx_CUI'])\n",
    "Rx_Problem_Probability_merged['co_occurrance_probability'] = Rx_Problem_Probability_merged.Rx_Problem_Probability / (Rx_Problem_Probability_merged.problem_gen_pop_probability + Rx_Problem_Probability_merged.RxProbability)\n",
    "Rx_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "9b0d4d27-86ba-4af5-9274-a0d8e80794ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>RxProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>11020</th>\n",
       "      <td>C0021400</td>\n",
       "      <td>C0875805</td>\n",
       "      <td>0.003306</td>\n",
       "      <td>0.006409</td>\n",
       "      <td>0.012361</td>\n",
       "      <td>0.176152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11060</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1584819</td>\n",
       "      <td>0.002052</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.014582</td>\n",
       "      <td>0.113829</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9713</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0975120</td>\n",
       "      <td>0.002577</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.014023</td>\n",
       "      <td>0.109589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9385</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C1967412</td>\n",
       "      <td>0.002899</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.017634</td>\n",
       "      <td>0.106875</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9538</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.002798</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.017583</td>\n",
       "      <td>0.103319</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11070</th>\n",
       "      <td>C0236663</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001543</td>\n",
       "      <td>0.001797</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.097015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11069</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001713</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.096743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11049</th>\n",
       "      <td>C0036572</td>\n",
       "      <td>C1739168</td>\n",
       "      <td>0.002425</td>\n",
       "      <td>0.005087</td>\n",
       "      <td>0.022179</td>\n",
       "      <td>0.088930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11045</th>\n",
       "      <td>C0036572</td>\n",
       "      <td>C0875827</td>\n",
       "      <td>0.002577</td>\n",
       "      <td>0.005087</td>\n",
       "      <td>0.026197</td>\n",
       "      <td>0.082385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11064</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0690704</td>\n",
       "      <td>0.000882</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.007545</td>\n",
       "      <td>0.080247</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9716</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0706911</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.022789</td>\n",
       "      <td>0.079307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9541</th>\n",
       "      <td>C0022658</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.017583</td>\n",
       "      <td>0.078159</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051</th>\n",
       "      <td>C0014544</td>\n",
       "      <td>C1739168</td>\n",
       "      <td>0.002001</td>\n",
       "      <td>0.003832</td>\n",
       "      <td>0.022179</td>\n",
       "      <td>0.076923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7564</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C4082775</td>\n",
       "      <td>0.004188</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.045425</td>\n",
       "      <td>0.076258</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9540</th>\n",
       "      <td>C0302148</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.001831</td>\n",
       "      <td>0.006935</td>\n",
       "      <td>0.017583</td>\n",
       "      <td>0.074689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11055</th>\n",
       "      <td>C0745138</td>\n",
       "      <td>C0978059</td>\n",
       "      <td>0.002340</td>\n",
       "      <td>0.003679</td>\n",
       "      <td>0.027757</td>\n",
       "      <td>0.074434</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11026</th>\n",
       "      <td>C0004604</td>\n",
       "      <td>C0689665</td>\n",
       "      <td>0.001797</td>\n",
       "      <td>0.005511</td>\n",
       "      <td>0.019805</td>\n",
       "      <td>0.070998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10048</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0710995</td>\n",
       "      <td>0.002374</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.023942</td>\n",
       "      <td>0.070994</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11005</th>\n",
       "      <td>C0206698</td>\n",
       "      <td>C1329616</td>\n",
       "      <td>0.001984</td>\n",
       "      <td>0.005121</td>\n",
       "      <td>0.023315</td>\n",
       "      <td>0.069767</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10782</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0978650</td>\n",
       "      <td>0.001390</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.016990</td>\n",
       "      <td>0.068050</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability  \\\n",
       "11020    C0021400  C0875805                0.003306   \n",
       "11060    C0085605  C1584819                0.002052   \n",
       "9713     C0022661  C0975120                0.002577   \n",
       "9385     C0022661  C1967412                0.002899   \n",
       "9538     C0022661  C1951501                0.002798   \n",
       "11070    C0236663  C0688559                0.001543   \n",
       "11069    C0085762  C0688559                0.001713   \n",
       "11049    C0036572  C1739168                0.002425   \n",
       "11045    C0036572  C0875827                0.002577   \n",
       "11064    C0085605  C0690704                0.000882   \n",
       "9716     C0022661  C0706911                0.002560   \n",
       "9541     C0022658  C1951501                0.001814   \n",
       "11051    C0014544  C1739168                0.002001   \n",
       "7564     C0022661  C4082775                0.004188   \n",
       "9540     C0302148  C1951501                0.001831   \n",
       "11055    C0745138  C0978059                0.002340   \n",
       "11026    C0004604  C0689665                0.001797   \n",
       "10048    C0022661  C0710995                0.002374   \n",
       "11005    C0206698  C1329616                0.001984   \n",
       "10782    C0085605  C0978650                0.001390   \n",
       "\n",
       "       problem_gen_pop_probability  RxProbability  co_occurrance_probability  \n",
       "11020                     0.006409       0.012361                   0.176152  \n",
       "11060                     0.003442       0.014582                   0.113829  \n",
       "9713                      0.009495       0.014023                   0.109589  \n",
       "9385                      0.009495       0.017634                   0.106875  \n",
       "9538                      0.009495       0.017583                   0.103319  \n",
       "11070                     0.001797       0.014107                   0.097015  \n",
       "11069                     0.003595       0.014107                   0.096743  \n",
       "11049                     0.005087       0.022179                   0.088930  \n",
       "11045                     0.005087       0.026197                   0.082385  \n",
       "11064                     0.003442       0.007545                   0.080247  \n",
       "9716                      0.009495       0.022789                   0.079307  \n",
       "9541                      0.005629       0.017583                   0.078159  \n",
       "11051                     0.003832       0.022179                   0.076923  \n",
       "7564                      0.009495       0.045425                   0.076258  \n",
       "9540                      0.006935       0.017583                   0.074689  \n",
       "11055                     0.003679       0.027757                   0.074434  \n",
       "11026                     0.005511       0.019805                   0.070998  \n",
       "10048                     0.009495       0.023942                   0.070994  \n",
       "11005                     0.005121       0.023315                   0.069767  \n",
       "10782                     0.003442       0.016990                   0.068050  "
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability_merged.sort_values(by='co_occurrance_probability', ascending=False, inplace=True)\n",
    "Rx_Problem_Probability_merged.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "32f042f5-9aa7-4386-b548-cc86194fdd05",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%d_%H-%M-%S\")\n",
    "filename = 'Rx_Problem_co_occurrance_probability_'+timestamp+'.csv'\n",
    "Rx_Problem_Probability_merged.loc[:,['Problem_CUI', 'Rx_CUI', 'co_occurrance_probability']].to_csv(filename, index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d4a3f3fd-c735-486c-a7c3-c2e5815b907d",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "2ff9a494-97ae-40db-aa00-ca61a25a427b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f6e96d6cd30>"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H:%M:%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{filename}\" AS COLUMN\n",
    "MATCH (prob:Concept)\n",
    "WHERE prob.cui = COLUMN.Problem_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "MATCH (rx:Concept)\n",
    "WHERE rx.cui = COLUMN.Rx_CUI AND rx.cui_pref_term IS NOT NULL\n",
    "CREATE (prob)<-[r:OCCURS_WITH {{co_occurrance_probability:toFloat(COLUMN.co_occurrance_probability), source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(rx)\n",
    "'''.format(timestamp=timestamp, filename=filename)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ff464f64-d750-4139-895b-695441343bd3",
   "metadata": {},
   "source": [
    "## Probability of a abnormal lab-problem pair occuring together vs separately"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c89cc1d2-e7ea-44d4-af68-c1d8a443a39d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(ad)) AS probTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability, Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "ORDER BY problem_gen_pop_probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "777cd618-dfea-45fc-bec4-be584008394c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each abnormal lab in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD]-(lab:Labevents)-[:INSTANCE_OF]->(b:Concept)\n",
    "WHERE lab.flag IS NOT NULL\n",
    "WITH b.cui AS Lab_CUI, count(distinct(ad)) AS LabTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Lab_CUI, toFloat(LabTotal)/ptTotal AS LabAbnormalProbability\n",
    "ORDER BY LabAbnormalProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Lab_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d2e6e089-9047-41a2-9728-51766263ab17",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of abnormal lab and problem\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients), (p:Problem)<-[:HAD_PROBLEM]-(Pt)-[:HAD]-(lab:Labevents)-[:INSTANCE_OF]->(c:Concept)\n",
    "WHERE lab.flag IS NOT NULL\n",
    "WITH p.cui AS Problem_CUI, c.cui AS Lab_CUI, count(distinct(ad)) AS LabProbTotal, ptTotal, count(distinct(Pt)) AS Pts\n",
    "WHERE Pts > 20\n",
    "RETURN Problem_CUI, Lab_CUI, toFloat(LabProbTotal)/ptTotal AS Lab_Problem_Probability\n",
    "ORDER BY Lab_Problem_Probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Lab_Problem_Probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "99cb3711-89a3-4dda-aadb-44fb6cb59fe9",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>0.008427</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>0.007902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>0.007138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>0.007003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>460</th>\n",
       "      <td>C0085669</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>461</th>\n",
       "      <td>C0017086</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>462</th>\n",
       "      <td>C0155626</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>463</th>\n",
       "      <td>C0575090</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>464</th>\n",
       "      <td>C0683278</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>465 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Problem_CUI  problem_gen_pop_probability\n",
       "0      C0022661                     0.009495\n",
       "1      C0020517                     0.008427\n",
       "2      C0011860                     0.007902\n",
       "3      C2830004                     0.007138\n",
       "4      C0039239                     0.007003\n",
       "..          ...                          ...\n",
       "460    C0085669                     0.000577\n",
       "461    C0017086                     0.000577\n",
       "462    C0155626                     0.000577\n",
       "463    C0575090                     0.000577\n",
       "464    C0683278                     0.000560\n",
       "\n",
       "[465 rows x 2 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "problem_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "fac224e4-c39c-4e46-9ee6-63f22c0edc7f",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>LabAbnormalProbability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0362923</td>\n",
       "      <td>0.921595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0366777</td>\n",
       "      <td>0.901265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.877916</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0362934</td>\n",
       "      <td>0.812636</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0362978</td>\n",
       "      <td>0.755358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>174</th>\n",
       "      <td>C1114256</td>\n",
       "      <td>0.001017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>175</th>\n",
       "      <td>C0801528</td>\n",
       "      <td>0.000763</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>176</th>\n",
       "      <td>C0943517</td>\n",
       "      <td>0.000712</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>177</th>\n",
       "      <td>C0365157</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>178</th>\n",
       "      <td>C0483101</td>\n",
       "      <td>0.000543</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>179 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Lab_CUI  LabAbnormalProbability\n",
       "0    C0362923                0.921595\n",
       "1    C0366777                0.901265\n",
       "2    C0362910                0.877916\n",
       "3    C0362934                0.812636\n",
       "4    C0362978                0.755358\n",
       "..        ...                     ...\n",
       "174  C1114256                0.001017\n",
       "175  C0801528                0.000763\n",
       "176  C0943517                0.000712\n",
       "177  C0365157                0.000560\n",
       "178  C0483101                0.000543\n",
       "\n",
       "[179 rows x 2 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Lab_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "ea12e9ce-b8b2-49bd-9191-a861acc41d55",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>Lab_Problem_Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0366777</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0362923</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0364096</td>\n",
       "      <td>0.009241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0364133</td>\n",
       "      <td>0.009224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13768</th>\n",
       "      <td>C0575090</td>\n",
       "      <td>C0368013</td>\n",
       "      <td>0.000475</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13769</th>\n",
       "      <td>C0575090</td>\n",
       "      <td>C0363885</td>\n",
       "      <td>0.000458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13770</th>\n",
       "      <td>C3263723</td>\n",
       "      <td>C0364290</td>\n",
       "      <td>0.000458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13771</th>\n",
       "      <td>C0267841</td>\n",
       "      <td>C0368036</td>\n",
       "      <td>0.000458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13772</th>\n",
       "      <td>C0085616</td>\n",
       "      <td>C0365095</td>\n",
       "      <td>0.000458</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13773 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI   Lab_CUI  Lab_Problem_Probability\n",
       "0        C0022661  C0362910                 0.009495\n",
       "1        C0022661  C0366777                 0.009495\n",
       "2        C0022661  C0362923                 0.009495\n",
       "3        C0022661  C0364096                 0.009241\n",
       "4        C0022661  C0364133                 0.009224\n",
       "...           ...       ...                      ...\n",
       "13768    C0575090  C0368013                 0.000475\n",
       "13769    C0575090  C0363885                 0.000458\n",
       "13770    C3263723  C0364290                 0.000458\n",
       "13771    C0267841  C0368036                 0.000458\n",
       "13772    C0085616  C0365095                 0.000458\n",
       "\n",
       "[13773 rows x 3 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Lab_Problem_Probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "62280649-0ded-4e25-bdc4-00825c7e759f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>Lab_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>LabAbnormalProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "      <th>normalized_co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>13763</th>\n",
       "      <td>C0031039</td>\n",
       "      <td>C0942431</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.021619</td>\n",
       "      <td>0.074825</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13758</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C1544494</td>\n",
       "      <td>0.002866</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.033030</td>\n",
       "      <td>0.073606</td>\n",
       "      <td>0.983581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13759</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C1114284</td>\n",
       "      <td>0.002645</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.031623</td>\n",
       "      <td>0.070493</td>\n",
       "      <td>0.941638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13684</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C0942424</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.044849</td>\n",
       "      <td>0.067825</td>\n",
       "      <td>0.905704</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13664</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C0942443</td>\n",
       "      <td>0.003459</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.046409</td>\n",
       "      <td>0.066126</td>\n",
       "      <td>0.882824</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>921</th>\n",
       "      <td>C0683278</td>\n",
       "      <td>C0366777</td>\n",
       "      <td>0.000560</td>\n",
       "      <td>0.000560</td>\n",
       "      <td>0.901265</td>\n",
       "      <td>0.000620</td>\n",
       "      <td>0.000432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>460</th>\n",
       "      <td>C1261287</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.000543</td>\n",
       "      <td>0.000577</td>\n",
       "      <td>0.877916</td>\n",
       "      <td>0.000618</td>\n",
       "      <td>0.000394</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1383</th>\n",
       "      <td>C0683278</td>\n",
       "      <td>C0362923</td>\n",
       "      <td>0.000560</td>\n",
       "      <td>0.000560</td>\n",
       "      <td>0.921595</td>\n",
       "      <td>0.000607</td>\n",
       "      <td>0.000248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>922</th>\n",
       "      <td>C1261287</td>\n",
       "      <td>C0366777</td>\n",
       "      <td>0.000543</td>\n",
       "      <td>0.000577</td>\n",
       "      <td>0.901265</td>\n",
       "      <td>0.000602</td>\n",
       "      <td>0.000179</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1384</th>\n",
       "      <td>C1261287</td>\n",
       "      <td>C0362923</td>\n",
       "      <td>0.000543</td>\n",
       "      <td>0.000577</td>\n",
       "      <td>0.921595</td>\n",
       "      <td>0.000588</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13773 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI   Lab_CUI  Lab_Problem_Probability  \\\n",
       "13763    C0031039  C0942431                 0.001814   \n",
       "13758    C0032227  C1544494                 0.002866   \n",
       "13759    C0032227  C1114284                 0.002645   \n",
       "13684    C0032227  C0942424                 0.003442   \n",
       "13664    C0032227  C0942443                 0.003459   \n",
       "...           ...       ...                      ...   \n",
       "921      C0683278  C0366777                 0.000560   \n",
       "460      C1261287  C0362910                 0.000543   \n",
       "1383     C0683278  C0362923                 0.000560   \n",
       "922      C1261287  C0366777                 0.000543   \n",
       "1384     C1261287  C0362923                 0.000543   \n",
       "\n",
       "       problem_gen_pop_probability  LabAbnormalProbability  \\\n",
       "13763                     0.002628                0.021619   \n",
       "13758                     0.005901                0.033030   \n",
       "13759                     0.005901                0.031623   \n",
       "13684                     0.005901                0.044849   \n",
       "13664                     0.005901                0.046409   \n",
       "...                            ...                     ...   \n",
       "921                       0.000560                0.901265   \n",
       "460                       0.000577                0.877916   \n",
       "1383                      0.000560                0.921595   \n",
       "922                       0.000577                0.901265   \n",
       "1384                      0.000577                0.921595   \n",
       "\n",
       "       co_occurrance_probability  normalized_co_occurrance_probability  \n",
       "13763                   0.074825                              1.000000  \n",
       "13758                   0.073606                              0.983581  \n",
       "13759                   0.070493                              0.941638  \n",
       "13684                   0.067825                              0.905704  \n",
       "13664                   0.066126                              0.882824  \n",
       "...                          ...                                   ...  \n",
       "921                     0.000620                              0.000432  \n",
       "460                     0.000618                              0.000394  \n",
       "1383                    0.000607                              0.000248  \n",
       "922                     0.000602                              0.000179  \n",
       "1384                    0.000588                              0.000000  \n",
       "\n",
       "[13773 rows x 7 columns]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate the co-occurance probability\n",
    "Lab_Problem_Probability_merged = pd.merge(Lab_Problem_Probability, problem_gen_pop_probability, on=['Problem_CUI'])\n",
    "Lab_Problem_Probability_merged = pd.merge(Lab_Problem_Probability_merged, Lab_gen_pop_probability, on=['Lab_CUI'])\n",
    "Lab_Problem_Probability_merged['co_occurrance_probability'] = Lab_Problem_Probability_merged.Lab_Problem_Probability / (Lab_Problem_Probability_merged.problem_gen_pop_probability + Lab_Problem_Probability_merged.LabAbnormalProbability)\n",
    "\n",
    "# Normalize the co-occurance probability using the min-max method\n",
    "Lab_Problem_Probability_merged['normalized_co_occurrance_probability'] = (Lab_Problem_Probability_merged.co_occurrance_probability-Lab_Problem_Probability_merged.co_occurrance_probability.min())/(Lab_Problem_Probability_merged.co_occurrance_probability.max()-Lab_Problem_Probability_merged.co_occurrance_probability.min())\n",
    "\n",
    "# Sort the dataframe and present it for inspection\n",
    "Lab_Problem_Probability_merged.sort_values(by='normalized_co_occurrance_probability', ascending=False, inplace=True)\n",
    "Lab_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "08eed70a-1b78-4289-ba76-46c85fe4e2bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%d_%H-%M-%S\")\n",
    "filename = 'LabAbnormal_Problem_co_occurrance_probability_'+timestamp+'.csv'\n",
    "Lab_Problem_Probability_merged.loc[:,['Problem_CUI', 'Lab_CUI', 'normalized_co_occurrance_probability']].to_csv(filename, index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b36a183f-5b1e-4894-bb66-1ca1f0145294",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "54c1a13f-e31d-4d9c-956a-f2209832c7d7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f27766f6640>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H:%M:%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{filename}\" AS COLUMN\n",
    "MATCH (prob:Concept)\n",
    "WHERE prob.cui = COLUMN.Problem_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "MATCH (lab:Concept)\n",
    "WHERE lab.cui = COLUMN.Lab_CUI AND lab.cui_pref_term IS NOT NULL\n",
    "CREATE (prob)<-[r:OCCURS_WITH {{co_occurrance_probability:toFloat(COLUMN.normalized_co_occurrance_probability), source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(lab)\n",
    "'''.format(timestamp=timestamp, filename=filename)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a7253919-4f63-47b4-9fa5-9a776cb20f15",
   "metadata": {},
   "source": [
    "## Probability of a problem-problem pair occuring together vs separately"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "508d5d79-684f-4707-b0ce-6ca3df74d1b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(ad)) AS probTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability, Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "f5a473b5-cb42-4e72-9de4-90f809b9ef3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of problems co-occuring\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients), (p1:Problem)<-[:HAD_PROBLEM]-(Pt)-[:HAD_PROBLEM]->(p2:Problem)\n",
    "WHERE p1.cui <> p2.cui\n",
    "WITH p1.cui AS Problem1_CUI, p2.cui AS Problem2_CUI, count(distinct(ad)) AS ProblemPairTotal, ptTotal\n",
    "RETURN Problem1_CUI, Problem2_CUI, toFloat(ProblemPairTotal)/ptTotal AS ProblemPairProbability\n",
    "ORDER BY ProblemPairProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "ProblemPairProbability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "32ef9010-ab6b-4e39-8fc4-b9d2991b0ef2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C2711480</td>\n",
       "      <td>0.001780</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0038358</td>\n",
       "      <td>0.002950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C1861101</td>\n",
       "      <td>0.000797</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0002886</td>\n",
       "      <td>0.001458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0029443</td>\n",
       "      <td>0.002255</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>460</th>\n",
       "      <td>C0085610</td>\n",
       "      <td>0.000848</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>461</th>\n",
       "      <td>C0001339</td>\n",
       "      <td>0.000746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>462</th>\n",
       "      <td>C0521614</td>\n",
       "      <td>0.000695</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>463</th>\n",
       "      <td>C1136033</td>\n",
       "      <td>0.000746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>464</th>\n",
       "      <td>C0476474</td>\n",
       "      <td>0.000983</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>465 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Problem_CUI  problem_gen_pop_probability\n",
       "0      C2711480                     0.001780\n",
       "1      C0038358                     0.002950\n",
       "2      C1861101                     0.000797\n",
       "3      C0002886                     0.001458\n",
       "4      C0029443                     0.002255\n",
       "..          ...                          ...\n",
       "460    C0085610                     0.000848\n",
       "461    C0001339                     0.000746\n",
       "462    C0521614                     0.000695\n",
       "463    C1136033                     0.000746\n",
       "464    C0476474                     0.000983\n",
       "\n",
       "[465 rows x 2 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "problem_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a51d1930-c182-46fe-9804-32679d7b3a54",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem1_CUI</th>\n",
       "      <th>Problem2_CUI</th>\n",
       "      <th>ProblemPairProbability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.001831</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0022658</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.001831</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0268529</td>\n",
       "      <td>0.001611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0268529</td>\n",
       "      <td>C0020517</td>\n",
       "      <td>0.001611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0745283</td>\n",
       "      <td>C2830004</td>\n",
       "      <td>0.001594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>309953</th>\n",
       "      <td>C0161679</td>\n",
       "      <td>C0394996</td>\n",
       "      <td>0.000017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>309954</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>C0394996</td>\n",
       "      <td>0.000017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>309955</th>\n",
       "      <td>C0394996</td>\n",
       "      <td>C0037199</td>\n",
       "      <td>0.000017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>309956</th>\n",
       "      <td>C0161679</td>\n",
       "      <td>C0037199</td>\n",
       "      <td>0.000017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>309957</th>\n",
       "      <td>C0161679</td>\n",
       "      <td>C0020598</td>\n",
       "      <td>0.000017</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>309958 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Problem1_CUI Problem2_CUI  ProblemPairProbability\n",
       "0          C0022661     C0022658                0.001831\n",
       "1          C0022658     C0022661                0.001831\n",
       "2          C0020517     C0268529                0.001611\n",
       "3          C0268529     C0020517                0.001611\n",
       "4          C0745283     C2830004                0.001594\n",
       "...             ...          ...                     ...\n",
       "309953     C0161679     C0394996                0.000017\n",
       "309954     C2830004     C0394996                0.000017\n",
       "309955     C0394996     C0037199                0.000017\n",
       "309956     C0161679     C0037199                0.000017\n",
       "309957     C0161679     C0020598                0.000017\n",
       "\n",
       "[309958 rows x 3 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ProblemPairProbability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "d1174f17-f195-4684-96f3-420b873f7869",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem1_CUI</th>\n",
       "      <th>Problem2_CUI</th>\n",
       "      <th>ProblemPairProbability</th>\n",
       "      <th>Problem_CUI_x</th>\n",
       "      <th>problem_gen_pop_probability_x</th>\n",
       "      <th>Problem_CUI_y</th>\n",
       "      <th>problem_gen_pop_probability_y</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.001831</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.121076</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.000322</td>\n",
       "      <td>C0020517</td>\n",
       "      <td>0.008427</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.022919</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0268529</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.000153</td>\n",
       "      <td>C0268529</td>\n",
       "      <td>0.002170</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.019565</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0745283</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.000627</td>\n",
       "      <td>C0745283</td>\n",
       "      <td>0.004256</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.063465</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.000712</td>\n",
       "      <td>C2830004</td>\n",
       "      <td>0.007138</td>\n",
       "      <td>C0022658</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.055777</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97721</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000034</td>\n",
       "      <td>C0026771</td>\n",
       "      <td>0.001000</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000933</td>\n",
       "      <td>0.017544</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97722</th>\n",
       "      <td>C0002962</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000102</td>\n",
       "      <td>C0002962</td>\n",
       "      <td>0.000848</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000933</td>\n",
       "      <td>0.057143</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97723</th>\n",
       "      <td>C0001418</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>C0001418</td>\n",
       "      <td>0.000661</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000933</td>\n",
       "      <td>0.010638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97724</th>\n",
       "      <td>C3263723</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000034</td>\n",
       "      <td>C3263723</td>\n",
       "      <td>0.001000</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000933</td>\n",
       "      <td>0.017544</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97725</th>\n",
       "      <td>C0575090</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000085</td>\n",
       "      <td>C0575090</td>\n",
       "      <td>0.000577</td>\n",
       "      <td>C0020255</td>\n",
       "      <td>0.000933</td>\n",
       "      <td>0.056180</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>97726 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem1_CUI Problem2_CUI  ProblemPairProbability Problem_CUI_x  \\\n",
       "0         C0022661     C0022658                0.001831      C0022661   \n",
       "1         C0020517     C0022658                0.000322      C0020517   \n",
       "2         C0268529     C0022658                0.000153      C0268529   \n",
       "3         C0745283     C0022658                0.000627      C0745283   \n",
       "4         C2830004     C0022658                0.000712      C2830004   \n",
       "...            ...          ...                     ...           ...   \n",
       "97721     C0026771     C0020255                0.000034      C0026771   \n",
       "97722     C0002962     C0020255                0.000102      C0002962   \n",
       "97723     C0001418     C0020255                0.000017      C0001418   \n",
       "97724     C3263723     C0020255                0.000034      C3263723   \n",
       "97725     C0575090     C0020255                0.000085      C0575090   \n",
       "\n",
       "       problem_gen_pop_probability_x Problem_CUI_y  \\\n",
       "0                           0.009495      C0022658   \n",
       "1                           0.008427      C0022658   \n",
       "2                           0.002170      C0022658   \n",
       "3                           0.004256      C0022658   \n",
       "4                           0.007138      C0022658   \n",
       "...                              ...           ...   \n",
       "97721                       0.001000      C0020255   \n",
       "97722                       0.000848      C0020255   \n",
       "97723                       0.000661      C0020255   \n",
       "97724                       0.001000      C0020255   \n",
       "97725                       0.000577      C0020255   \n",
       "\n",
       "       problem_gen_pop_probability_y  co_occurrance_probability  \n",
       "0                           0.005629                   0.121076  \n",
       "1                           0.005629                   0.022919  \n",
       "2                           0.005629                   0.019565  \n",
       "3                           0.005629                   0.063465  \n",
       "4                           0.005629                   0.055777  \n",
       "...                              ...                        ...  \n",
       "97721                       0.000933                   0.017544  \n",
       "97722                       0.000933                   0.057143  \n",
       "97723                       0.000933                   0.010638  \n",
       "97724                       0.000933                   0.017544  \n",
       "97725                       0.000933                   0.056180  \n",
       "\n",
       "[97726 rows x 8 columns]"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ProblemPairProbability_merged = pd.merge(ProblemPairProbability, problem_gen_pop_probability, left_on='Problem1_CUI', right_on='Problem_CUI')\n",
    "ProblemPairProbability_merged = pd.merge(ProblemPairProbability_merged, problem_gen_pop_probability, left_on='Problem2_CUI', right_on='Problem_CUI')\n",
    "ProblemPairProbability_merged['co_occurrance_probability'] = ProblemPairProbability_merged.ProblemPairProbability / (ProblemPairProbability_merged.problem_gen_pop_probability_x + ProblemPairProbability_merged.problem_gen_pop_probability_y)\n",
    "ProblemPairProbability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "bcc1790b-07e9-454b-afa6-146bcd0e77c7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem1_CUI</th>\n",
       "      <th>Problem2_CUI</th>\n",
       "      <th>ProblemPairProbability</th>\n",
       "      <th>Problem_CUI_x</th>\n",
       "      <th>problem_gen_pop_probability_x</th>\n",
       "      <th>Problem_CUI_y</th>\n",
       "      <th>problem_gen_pop_probability_y</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>17629</th>\n",
       "      <td>C0042487</td>\n",
       "      <td>C0014122</td>\n",
       "      <td>0.000780</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>C0014122</td>\n",
       "      <td>0.001373</td>\n",
       "      <td>0.251366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13604</th>\n",
       "      <td>C0014122</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.000780</td>\n",
       "      <td>C0014122</td>\n",
       "      <td>0.001373</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>0.251366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72055</th>\n",
       "      <td>C0085281</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>0.000831</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.001662</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>0.245000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95630</th>\n",
       "      <td>C0149521</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.000831</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.001662</td>\n",
       "      <td>0.245000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95644</th>\n",
       "      <td>C0438696</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.001340</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.001662</td>\n",
       "      <td>0.242938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96837</th>\n",
       "      <td>C0085281</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.001662</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.001340</td>\n",
       "      <td>0.242938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12512</th>\n",
       "      <td>C0398623</td>\n",
       "      <td>C0740991</td>\n",
       "      <td>0.000780</td>\n",
       "      <td>C0398623</td>\n",
       "      <td>0.001577</td>\n",
       "      <td>C0740991</td>\n",
       "      <td>0.001916</td>\n",
       "      <td>0.223301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12752</th>\n",
       "      <td>C0740991</td>\n",
       "      <td>C0398623</td>\n",
       "      <td>0.000780</td>\n",
       "      <td>C0740991</td>\n",
       "      <td>0.001916</td>\n",
       "      <td>C0398623</td>\n",
       "      <td>0.001577</td>\n",
       "      <td>0.223301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>762</th>\n",
       "      <td>C0745136</td>\n",
       "      <td>C0745138</td>\n",
       "      <td>0.001390</td>\n",
       "      <td>C0745136</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>C0745138</td>\n",
       "      <td>0.003679</td>\n",
       "      <td>0.222826</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3829</th>\n",
       "      <td>C0745138</td>\n",
       "      <td>C0745136</td>\n",
       "      <td>0.001390</td>\n",
       "      <td>C0745138</td>\n",
       "      <td>0.003679</td>\n",
       "      <td>C0745136</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>0.222826</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46795</th>\n",
       "      <td>C1963823</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C1963823</td>\n",
       "      <td>0.001696</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>0.001645</td>\n",
       "      <td>0.218274</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71627</th>\n",
       "      <td>C0220982</td>\n",
       "      <td>C1963823</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>0.001645</td>\n",
       "      <td>C1963823</td>\n",
       "      <td>0.001696</td>\n",
       "      <td>0.218274</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88863</th>\n",
       "      <td>C0220982</td>\n",
       "      <td>C0151723</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>0.001645</td>\n",
       "      <td>C0151723</td>\n",
       "      <td>0.001746</td>\n",
       "      <td>0.215000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46781</th>\n",
       "      <td>C0151723</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C0151723</td>\n",
       "      <td>0.001746</td>\n",
       "      <td>C0220982</td>\n",
       "      <td>0.001645</td>\n",
       "      <td>0.215000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15567</th>\n",
       "      <td>C0042487</td>\n",
       "      <td>C0015967</td>\n",
       "      <td>0.000695</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>C0015967</td>\n",
       "      <td>0.001509</td>\n",
       "      <td>0.214660</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13609</th>\n",
       "      <td>C0015967</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.000695</td>\n",
       "      <td>C0015967</td>\n",
       "      <td>0.001509</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>0.214660</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96835</th>\n",
       "      <td>C0747752</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.000763</td>\n",
       "      <td>C0747752</td>\n",
       "      <td>0.002255</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.001340</td>\n",
       "      <td>0.212264</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83383</th>\n",
       "      <td>C0438696</td>\n",
       "      <td>C0747752</td>\n",
       "      <td>0.000763</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.001340</td>\n",
       "      <td>C0747752</td>\n",
       "      <td>0.002255</td>\n",
       "      <td>0.212264</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17216</th>\n",
       "      <td>C0038450</td>\n",
       "      <td>C0001883</td>\n",
       "      <td>0.000899</td>\n",
       "      <td>C0038450</td>\n",
       "      <td>0.001543</td>\n",
       "      <td>C0001883</td>\n",
       "      <td>0.002696</td>\n",
       "      <td>0.212000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14794</th>\n",
       "      <td>C0001883</td>\n",
       "      <td>C0038450</td>\n",
       "      <td>0.000899</td>\n",
       "      <td>C0001883</td>\n",
       "      <td>0.002696</td>\n",
       "      <td>C0038450</td>\n",
       "      <td>0.001543</td>\n",
       "      <td>0.212000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem1_CUI Problem2_CUI  ProblemPairProbability Problem_CUI_x  \\\n",
       "17629     C0042487     C0014122                0.000780      C0042487   \n",
       "13604     C0014122     C0042487                0.000780      C0014122   \n",
       "72055     C0085281     C0149521                0.000831      C0085281   \n",
       "95630     C0149521     C0085281                0.000831      C0149521   \n",
       "95644     C0438696     C0085281                0.000729      C0438696   \n",
       "96837     C0085281     C0438696                0.000729      C0085281   \n",
       "12512     C0398623     C0740991                0.000780      C0398623   \n",
       "12752     C0740991     C0398623                0.000780      C0740991   \n",
       "762       C0745136     C0745138                0.001390      C0745136   \n",
       "3829      C0745138     C0745136                0.001390      C0745138   \n",
       "46795     C1963823     C0220982                0.000729      C1963823   \n",
       "71627     C0220982     C1963823                0.000729      C0220982   \n",
       "88863     C0220982     C0151723                0.000729      C0220982   \n",
       "46781     C0151723     C0220982                0.000729      C0151723   \n",
       "15567     C0042487     C0015967                0.000695      C0042487   \n",
       "13609     C0015967     C0042487                0.000695      C0015967   \n",
       "96835     C0747752     C0438696                0.000763      C0747752   \n",
       "83383     C0438696     C0747752                0.000763      C0438696   \n",
       "17216     C0038450     C0001883                0.000899      C0038450   \n",
       "14794     C0001883     C0038450                0.000899      C0001883   \n",
       "\n",
       "       problem_gen_pop_probability_x Problem_CUI_y  \\\n",
       "17629                       0.001730      C0014122   \n",
       "13604                       0.001373      C0042487   \n",
       "72055                       0.001662      C0149521   \n",
       "95630                       0.001730      C0085281   \n",
       "95644                       0.001340      C0085281   \n",
       "96837                       0.001662      C0438696   \n",
       "12512                       0.001577      C0740991   \n",
       "12752                       0.001916      C0398623   \n",
       "762                         0.002560      C0745138   \n",
       "3829                        0.003679      C0745136   \n",
       "46795                       0.001696      C0220982   \n",
       "71627                       0.001645      C1963823   \n",
       "88863                       0.001645      C0151723   \n",
       "46781                       0.001746      C0220982   \n",
       "15567                       0.001730      C0015967   \n",
       "13609                       0.001509      C0042487   \n",
       "96835                       0.002255      C0438696   \n",
       "83383                       0.001340      C0747752   \n",
       "17216                       0.001543      C0001883   \n",
       "14794                       0.002696      C0038450   \n",
       "\n",
       "       problem_gen_pop_probability_y  co_occurrance_probability  \n",
       "17629                       0.001373                   0.251366  \n",
       "13604                       0.001730                   0.251366  \n",
       "72055                       0.001730                   0.245000  \n",
       "95630                       0.001662                   0.245000  \n",
       "95644                       0.001662                   0.242938  \n",
       "96837                       0.001340                   0.242938  \n",
       "12512                       0.001916                   0.223301  \n",
       "12752                       0.001577                   0.223301  \n",
       "762                         0.003679                   0.222826  \n",
       "3829                        0.002560                   0.222826  \n",
       "46795                       0.001645                   0.218274  \n",
       "71627                       0.001696                   0.218274  \n",
       "88863                       0.001746                   0.215000  \n",
       "46781                       0.001645                   0.215000  \n",
       "15567                       0.001509                   0.214660  \n",
       "13609                       0.001730                   0.214660  \n",
       "96835                       0.001340                   0.212264  \n",
       "83383                       0.002255                   0.212264  \n",
       "17216                       0.002696                   0.212000  \n",
       "14794                       0.001543                   0.212000  "
      ]
     },
     "execution_count": 71,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ProblemPairProbability_merged.sort_values(by='co_occurrance_probability', ascending=False, inplace=True)\n",
    "ProblemPairProbability_merged.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "a10dbfff-9aa7-4867-9b85-2f1701d24263",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem1_CUI</th>\n",
       "      <th>Problem2_CUI</th>\n",
       "      <th>ProblemPairProbability</th>\n",
       "      <th>Problem_CUI_x</th>\n",
       "      <th>problem_gen_pop_probability_x</th>\n",
       "      <th>Problem_CUI_y</th>\n",
       "      <th>problem_gen_pop_probability_y</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "      <th>Problems</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>17629</th>\n",
       "      <td>C0014122</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.000780</td>\n",
       "      <td>C0042487</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>C0014122</td>\n",
       "      <td>0.001373</td>\n",
       "      <td>0.251366</td>\n",
       "      <td>[C0014122, C0042487]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72055</th>\n",
       "      <td>C0085281</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>0.000831</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.001662</td>\n",
       "      <td>C0149521</td>\n",
       "      <td>0.001730</td>\n",
       "      <td>0.245000</td>\n",
       "      <td>[C0085281, C0149521]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95644</th>\n",
       "      <td>C0085281</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.000729</td>\n",
       "      <td>C0438696</td>\n",
       "      <td>0.001340</td>\n",
       "      <td>C0085281</td>\n",
       "      <td>0.001662</td>\n",
       "      <td>0.242938</td>\n",
       "      <td>[C0085281, C0438696]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12512</th>\n",
       "      <td>C0398623</td>\n",
       "      <td>C0740991</td>\n",
       "      <td>0.000780</td>\n",
       "      <td>C0398623</td>\n",
       "      <td>0.001577</td>\n",
       "      <td>C0740991</td>\n",
       "      <td>0.001916</td>\n",
       "      <td>0.223301</td>\n",
       "      <td>[C0398623, C0740991]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>762</th>\n",
       "      <td>C0745136</td>\n",
       "      <td>C0745138</td>\n",
       "      <td>0.001390</td>\n",
       "      <td>C0745136</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>C0745138</td>\n",
       "      <td>0.003679</td>\n",
       "      <td>0.222826</td>\n",
       "      <td>[C0745136, C0745138]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41321</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>C0151744</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>C0011860</td>\n",
       "      <td>0.007902</td>\n",
       "      <td>C0151744</td>\n",
       "      <td>0.003256</td>\n",
       "      <td>0.001520</td>\n",
       "      <td>[C0011860, C0151744]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85084</th>\n",
       "      <td>C0003486</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>C0003486</td>\n",
       "      <td>0.001831</td>\n",
       "      <td>0.001497</td>\n",
       "      <td>[C0003486, C0022661]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87618</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C3203359</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>C3203359</td>\n",
       "      <td>0.001865</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.001493</td>\n",
       "      <td>[C0022661, C3203359]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87459</th>\n",
       "      <td>C0019163</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>C0019163</td>\n",
       "      <td>0.001984</td>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.001477</td>\n",
       "      <td>[C0019163, C0022661]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>C4761312</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>C4761312</td>\n",
       "      <td>0.005816</td>\n",
       "      <td>C2830004</td>\n",
       "      <td>0.007138</td>\n",
       "      <td>0.001309</td>\n",
       "      <td>[C2830004, C4761312]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>48863 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem1_CUI Problem2_CUI  ProblemPairProbability Problem_CUI_x  \\\n",
       "17629     C0014122     C0042487                0.000780      C0042487   \n",
       "72055     C0085281     C0149521                0.000831      C0085281   \n",
       "95644     C0085281     C0438696                0.000729      C0438696   \n",
       "12512     C0398623     C0740991                0.000780      C0398623   \n",
       "762       C0745136     C0745138                0.001390      C0745136   \n",
       "...            ...          ...                     ...           ...   \n",
       "41321     C0011860     C0151744                0.000017      C0011860   \n",
       "85084     C0003486     C0022661                0.000017      C0022661   \n",
       "87618     C0022661     C3203359                0.000017      C3203359   \n",
       "87459     C0019163     C0022661                0.000017      C0019163   \n",
       "426       C2830004     C4761312                0.000017      C4761312   \n",
       "\n",
       "       problem_gen_pop_probability_x Problem_CUI_y  \\\n",
       "17629                       0.001730      C0014122   \n",
       "72055                       0.001662      C0149521   \n",
       "95644                       0.001340      C0085281   \n",
       "12512                       0.001577      C0740991   \n",
       "762                         0.002560      C0745138   \n",
       "...                              ...           ...   \n",
       "41321                       0.007902      C0151744   \n",
       "85084                       0.009495      C0003486   \n",
       "87618                       0.001865      C0022661   \n",
       "87459                       0.001984      C0022661   \n",
       "426                         0.005816      C2830004   \n",
       "\n",
       "       problem_gen_pop_probability_y  co_occurrance_probability  \\\n",
       "17629                       0.001373                   0.251366   \n",
       "72055                       0.001730                   0.245000   \n",
       "95644                       0.001662                   0.242938   \n",
       "12512                       0.001916                   0.223301   \n",
       "762                         0.003679                   0.222826   \n",
       "...                              ...                        ...   \n",
       "41321                       0.003256                   0.001520   \n",
       "85084                       0.001831                   0.001497   \n",
       "87618                       0.009495                   0.001493   \n",
       "87459                       0.009495                   0.001477   \n",
       "426                         0.007138                   0.001309   \n",
       "\n",
       "                   Problems  \n",
       "17629  [C0014122, C0042487]  \n",
       "72055  [C0085281, C0149521]  \n",
       "95644  [C0085281, C0438696]  \n",
       "12512  [C0398623, C0740991]  \n",
       "762    [C0745136, C0745138]  \n",
       "...                     ...  \n",
       "41321  [C0011860, C0151744]  \n",
       "85084  [C0003486, C0022661]  \n",
       "87618  [C0022661, C3203359]  \n",
       "87459  [C0019163, C0022661]  \n",
       "426    [C2830004, C4761312]  \n",
       "\n",
       "[48863 rows x 9 columns]"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Drop duplicates\n",
    "ProblemPairProbability_merged['Problems'] = ProblemPairProbability_merged.loc[:,['Problem1_CUI', 'Problem2_CUI']].values.tolist()\n",
    "ProblemPairProbability_merged.Problems.apply(lambda x: x.sort())\n",
    "ProblemPairProbability_merged[['Problem1_CUI','Problem2_CUI']] = pd.DataFrame(ProblemPairProbability_merged.Problems.tolist(), index= ProblemPairProbability_merged.index)\n",
    "ProblemPairProbability_merged.drop_duplicates(subset=['Problem1_CUI','Problem2_CUI'], inplace=True)\n",
    "ProblemPairProbability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "6b09ca89-2515-401b-913d-6607812ae559",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%d_%H-%M-%S\")\n",
    "filename = 'Problem_co_occurrance_probability_'+timestamp+'.csv'\n",
    "ProblemPairProbability_merged.loc[:,['Problem1_CUI', 'Problem2_CUI', 'co_occurrance_probability']].to_csv(filename, index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "38843266-40be-460f-aaec-8dbae793a3bf",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "fbb2974c-8e89-4155-8478-b3fe377df9f6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7fec48db34f0>"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H:%M:%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{filename}\" AS COLUMN\n",
    "MATCH (prob1:Concept)\n",
    "WHERE prob1.cui = COLUMN.Problem1_CUI AND prob1.cui_pref_term IS NOT NULL\n",
    "MATCH (prob2:Concept)\n",
    "WHERE prob2.cui = COLUMN.Problem2_CUI AND prob2.cui_pref_term IS NOT NULL\n",
    "MERGE (prob1)<-[r:OCCURS_WITH {{co_occurrance_probability:toFloat(COLUMN.co_occurrance_probability), source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(prob2)\n",
    "'''.format(timestamp=timestamp, filename=filename)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b04c342-3d19-4e91-b6dc-fcb02228a1f4",
   "metadata": {},
   "source": [
    "## Probability of a procedure-problem pair occuring together vs separately"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "7c83bd53-4f3a-42f4-bc06-9ed66ea25616",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(ad)) AS probTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability, Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "ORDER BY problem_gen_pop_probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "fd74ab57-6c5b-4bf9-8dfd-0b032680bf5d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each procedure in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD]->(proc:Procedures_Icd)\n",
    "WITH proc.icd9_code AS icd9_code, count(distinct(ad)) AS ProcTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WHERE Pt > 20\n",
    "RETURN icd9_code, toFloat(ProcTotal)/ptTotal AS ProcedureProbability\n",
    "ORDER BY ProcedureProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "procedure_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "fe05e3af-970a-4c58-99d8-4311b919ce22",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of procedure and problem\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients), (p:Problem)<-[:HAD_PROBLEM]-(Pt)-[:HAD]->(proc:Procedures_Icd)\n",
    "WITH p.cui AS Problem_CUI, proc.icd9_code AS icd9_code, count(distinct(ad)) AS ProcProbTotal, ptTotal, count(distinct(Pt)) AS Pts\n",
    "WHERE Pts > 20\n",
    "RETURN Problem_CUI, icd9_code, toFloat(ProcProbTotal)/ptTotal AS Proc_Problem_Probability\n",
    "ORDER BY Proc_Problem_Probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Proc_Problem_Probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "2af78d24-6bf4-4d7e-8bff-e09884b9fcb9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>0.008427</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>0.007902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>0.007138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>0.007003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>460</th>\n",
       "      <td>C0085669</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>461</th>\n",
       "      <td>C0017086</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>462</th>\n",
       "      <td>C0155626</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>463</th>\n",
       "      <td>C0575090</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>464</th>\n",
       "      <td>C0683278</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>465 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Problem_CUI  problem_gen_pop_probability\n",
       "0      C0022661                     0.009495\n",
       "1      C0020517                     0.008427\n",
       "2      C0011860                     0.007902\n",
       "3      C2830004                     0.007138\n",
       "4      C0039239                     0.007003\n",
       "..          ...                          ...\n",
       "460    C0085669                     0.000577\n",
       "461    C0017086                     0.000577\n",
       "462    C0155626                     0.000577\n",
       "463    C0575090                     0.000577\n",
       "464    C0683278                     0.000560\n",
       "\n",
       "[465 rows x 2 columns]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "problem_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "14069d4a-c568-4d64-8173-509cbbf02316",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>icd9_code</th>\n",
       "      <th>ProcedureProbability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3893</td>\n",
       "      <td>0.318146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>9604</td>\n",
       "      <td>0.246219</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>9671</td>\n",
       "      <td>0.220971</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>966</td>\n",
       "      <td>0.213850</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>9904</td>\n",
       "      <td>0.177699</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>604</th>\n",
       "      <td>7857</td>\n",
       "      <td>0.000407</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>605</th>\n",
       "      <td>7813</td>\n",
       "      <td>0.000407</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>606</th>\n",
       "      <td>7919</td>\n",
       "      <td>0.000390</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>607</th>\n",
       "      <td>9959</td>\n",
       "      <td>0.000390</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>608</th>\n",
       "      <td>8364</td>\n",
       "      <td>0.000390</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>609 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    icd9_code  ProcedureProbability\n",
       "0        3893              0.318146\n",
       "1        9604              0.246219\n",
       "2        9671              0.220971\n",
       "3         966              0.213850\n",
       "4        9904              0.177699\n",
       "..        ...                   ...\n",
       "604      7857              0.000407\n",
       "605      7813              0.000407\n",
       "606      7919              0.000390\n",
       "607      9959              0.000390\n",
       "608      8364              0.000390\n",
       "\n",
       "[609 rows x 2 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "procedure_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "7dfc5373-0795-49b7-97fe-c92d0953e5ee",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>icd9_code</th>\n",
       "      <th>Proc_Problem_Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.006986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.006274</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>3995</td>\n",
       "      <td>0.005799</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.005494</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.005494</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1068</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>9672</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1069</th>\n",
       "      <td>C0021308</td>\n",
       "      <td>3961</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1070</th>\n",
       "      <td>C0267841</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.000543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1071</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>966</td>\n",
       "      <td>0.000543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1072</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.000458</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1073 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Problem_CUI icd9_code  Proc_Problem_Probability\n",
       "0       C0022661      3893                  0.006986\n",
       "1       C0020517      3893                  0.006274\n",
       "2       C0022661      3995                  0.005799\n",
       "3       C2830004      3893                  0.005494\n",
       "4       C0011860      3893                  0.005494\n",
       "...          ...       ...                       ...\n",
       "1068    C0026771      9672                  0.000560\n",
       "1069    C0021308      3961                  0.000560\n",
       "1070    C0267841      3893                  0.000543\n",
       "1071    C0026771       966                  0.000543\n",
       "1072    C0026771      3893                  0.000458\n",
       "\n",
       "[1073 rows x 3 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Proc_Problem_Probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "2e8a9a8b-8252-4a8d-a150-8d0ac49dea1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>icd9_code</th>\n",
       "      <th>Proc_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>ProcedureProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.006986</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.318146</td>\n",
       "      <td>0.021322</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.006274</td>\n",
       "      <td>0.008427</td>\n",
       "      <td>0.318146</td>\n",
       "      <td>0.019211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.005494</td>\n",
       "      <td>0.007138</td>\n",
       "      <td>0.318146</td>\n",
       "      <td>0.016889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.005494</td>\n",
       "      <td>0.007902</td>\n",
       "      <td>0.318146</td>\n",
       "      <td>0.016850</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0302148</td>\n",
       "      <td>3893</td>\n",
       "      <td>0.005426</td>\n",
       "      <td>0.006935</td>\n",
       "      <td>0.318146</td>\n",
       "      <td>0.016691</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1068</th>\n",
       "      <td>C0085616</td>\n",
       "      <td>3972</td>\n",
       "      <td>0.000577</td>\n",
       "      <td>0.000848</td>\n",
       "      <td>0.008580</td>\n",
       "      <td>0.061151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1069</th>\n",
       "      <td>C0031039</td>\n",
       "      <td>370</td>\n",
       "      <td>0.000916</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.011242</td>\n",
       "      <td>0.066015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1070</th>\n",
       "      <td>C0018946</td>\n",
       "      <td>0131</td>\n",
       "      <td>0.000814</td>\n",
       "      <td>0.002493</td>\n",
       "      <td>0.011106</td>\n",
       "      <td>0.059850</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1071</th>\n",
       "      <td>C0398738</td>\n",
       "      <td>0066</td>\n",
       "      <td>0.001204</td>\n",
       "      <td>0.001746</td>\n",
       "      <td>0.031369</td>\n",
       "      <td>0.036354</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1072</th>\n",
       "      <td>C0008311</td>\n",
       "      <td>5187</td>\n",
       "      <td>0.000661</td>\n",
       "      <td>0.001153</td>\n",
       "      <td>0.011920</td>\n",
       "      <td>0.050584</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1073 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Problem_CUI icd9_code  Proc_Problem_Probability  \\\n",
       "0       C0022661      3893                  0.006986   \n",
       "1       C0020517      3893                  0.006274   \n",
       "2       C2830004      3893                  0.005494   \n",
       "3       C0011860      3893                  0.005494   \n",
       "4       C0302148      3893                  0.005426   \n",
       "...          ...       ...                       ...   \n",
       "1068    C0085616      3972                  0.000577   \n",
       "1069    C0031039       370                  0.000916   \n",
       "1070    C0018946      0131                  0.000814   \n",
       "1071    C0398738      0066                  0.001204   \n",
       "1072    C0008311      5187                  0.000661   \n",
       "\n",
       "      problem_gen_pop_probability  ProcedureProbability  \\\n",
       "0                        0.009495              0.318146   \n",
       "1                        0.008427              0.318146   \n",
       "2                        0.007138              0.318146   \n",
       "3                        0.007902              0.318146   \n",
       "4                        0.006935              0.318146   \n",
       "...                           ...                   ...   \n",
       "1068                     0.000848              0.008580   \n",
       "1069                     0.002628              0.011242   \n",
       "1070                     0.002493              0.011106   \n",
       "1071                     0.001746              0.031369   \n",
       "1072                     0.001153              0.011920   \n",
       "\n",
       "      co_occurrance_probability  \n",
       "0                      0.021322  \n",
       "1                      0.019211  \n",
       "2                      0.016889  \n",
       "3                      0.016850  \n",
       "4                      0.016691  \n",
       "...                         ...  \n",
       "1068                   0.061151  \n",
       "1069                   0.066015  \n",
       "1070                   0.059850  \n",
       "1071                   0.036354  \n",
       "1072                   0.050584  \n",
       "\n",
       "[1073 rows x 6 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Proc_Problem_Probability_merged = pd.merge(Proc_Problem_Probability, problem_gen_pop_probability, on=['Problem_CUI'])\n",
    "Proc_Problem_Probability_merged = pd.merge(Proc_Problem_Probability_merged, procedure_gen_pop_probability, on=['icd9_code'])\n",
    "Proc_Problem_Probability_merged['co_occurrance_probability'] = Proc_Problem_Probability_merged.Proc_Problem_Probability / (Proc_Problem_Probability_merged.problem_gen_pop_probability + Proc_Problem_Probability_merged.ProcedureProbability)\n",
    "Proc_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "43dbf0cc-59ac-4a06-8388-2c14ac0afa7e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>icd9_code</th>\n",
       "      <th>Proc_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>ProcedureProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1067</th>\n",
       "      <td>C0002940</td>\n",
       "      <td>3972</td>\n",
       "      <td>0.001102</td>\n",
       "      <td>0.003578</td>\n",
       "      <td>0.008580</td>\n",
       "      <td>0.090656</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>289</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>3995</td>\n",
       "      <td>0.005799</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.074386</td>\n",
       "      <td>0.069133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1069</th>\n",
       "      <td>C0031039</td>\n",
       "      <td>370</td>\n",
       "      <td>0.000916</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.011242</td>\n",
       "      <td>0.066015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>593</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>3895</td>\n",
       "      <td>0.003849</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.050343</td>\n",
       "      <td>0.064324</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1047</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>3491</td>\n",
       "      <td>0.003374</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.047816</td>\n",
       "      <td>0.062816</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1068</th>\n",
       "      <td>C0085616</td>\n",
       "      <td>3972</td>\n",
       "      <td>0.000577</td>\n",
       "      <td>0.000848</td>\n",
       "      <td>0.008580</td>\n",
       "      <td>0.061151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1070</th>\n",
       "      <td>C0018946</td>\n",
       "      <td>0131</td>\n",
       "      <td>0.000814</td>\n",
       "      <td>0.002493</td>\n",
       "      <td>0.011106</td>\n",
       "      <td>0.059850</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1064</th>\n",
       "      <td>C0027651</td>\n",
       "      <td>9925</td>\n",
       "      <td>0.000899</td>\n",
       "      <td>0.003459</td>\n",
       "      <td>0.012327</td>\n",
       "      <td>0.056928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1072</th>\n",
       "      <td>C0008311</td>\n",
       "      <td>5187</td>\n",
       "      <td>0.000661</td>\n",
       "      <td>0.001153</td>\n",
       "      <td>0.011920</td>\n",
       "      <td>0.050584</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1036</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>5491</td>\n",
       "      <td>0.001984</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.039508</td>\n",
       "      <td>0.046190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>596</th>\n",
       "      <td>C0302148</td>\n",
       "      <td>3895</td>\n",
       "      <td>0.002476</td>\n",
       "      <td>0.006935</td>\n",
       "      <td>0.050343</td>\n",
       "      <td>0.043221</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1060</th>\n",
       "      <td>C0018932</td>\n",
       "      <td>4523</td>\n",
       "      <td>0.001255</td>\n",
       "      <td>0.003323</td>\n",
       "      <td>0.026044</td>\n",
       "      <td>0.042725</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1065</th>\n",
       "      <td>C0002940</td>\n",
       "      <td>8841</td>\n",
       "      <td>0.001373</td>\n",
       "      <td>0.003578</td>\n",
       "      <td>0.029351</td>\n",
       "      <td>0.041710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1005</th>\n",
       "      <td>C0220983</td>\n",
       "      <td>311</td>\n",
       "      <td>0.002323</td>\n",
       "      <td>0.005443</td>\n",
       "      <td>0.053412</td>\n",
       "      <td>0.039470</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1039</th>\n",
       "      <td>C0003962</td>\n",
       "      <td>5491</td>\n",
       "      <td>0.001611</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>0.039508</td>\n",
       "      <td>0.038291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>603</th>\n",
       "      <td>C0022658</td>\n",
       "      <td>3895</td>\n",
       "      <td>0.002120</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.050343</td>\n",
       "      <td>0.037867</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>301</th>\n",
       "      <td>C0022658</td>\n",
       "      <td>3995</td>\n",
       "      <td>0.002950</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.074386</td>\n",
       "      <td>0.036872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1032</th>\n",
       "      <td>C0302148</td>\n",
       "      <td>5491</td>\n",
       "      <td>0.001696</td>\n",
       "      <td>0.006935</td>\n",
       "      <td>0.039508</td>\n",
       "      <td>0.036510</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1071</th>\n",
       "      <td>C0398738</td>\n",
       "      <td>0066</td>\n",
       "      <td>0.001204</td>\n",
       "      <td>0.001746</td>\n",
       "      <td>0.031369</td>\n",
       "      <td>0.036354</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>604</th>\n",
       "      <td>C0041948</td>\n",
       "      <td>3895</td>\n",
       "      <td>0.001967</td>\n",
       "      <td>0.003951</td>\n",
       "      <td>0.050343</td>\n",
       "      <td>0.036227</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Problem_CUI icd9_code  Proc_Problem_Probability  \\\n",
       "1067    C0002940      3972                  0.001102   \n",
       "289     C0022661      3995                  0.005799   \n",
       "1069    C0031039       370                  0.000916   \n",
       "593     C0022661      3895                  0.003849   \n",
       "1047    C0032227      3491                  0.003374   \n",
       "1068    C0085616      3972                  0.000577   \n",
       "1070    C0018946      0131                  0.000814   \n",
       "1064    C0027651      9925                  0.000899   \n",
       "1072    C0008311      5187                  0.000661   \n",
       "1036    C0085605      5491                  0.001984   \n",
       "596     C0302148      3895                  0.002476   \n",
       "1060    C0018932      4523                  0.001255   \n",
       "1065    C0002940      8841                  0.001373   \n",
       "1005    C0220983       311                  0.002323   \n",
       "1039    C0003962      5491                  0.001611   \n",
       "603     C0022658      3895                  0.002120   \n",
       "301     C0022658      3995                  0.002950   \n",
       "1032    C0302148      5491                  0.001696   \n",
       "1071    C0398738      0066                  0.001204   \n",
       "604     C0041948      3895                  0.001967   \n",
       "\n",
       "      problem_gen_pop_probability  ProcedureProbability  \\\n",
       "1067                     0.003578              0.008580   \n",
       "289                      0.009495              0.074386   \n",
       "1069                     0.002628              0.011242   \n",
       "593                      0.009495              0.050343   \n",
       "1047                     0.005901              0.047816   \n",
       "1068                     0.000848              0.008580   \n",
       "1070                     0.002493              0.011106   \n",
       "1064                     0.003459              0.012327   \n",
       "1072                     0.001153              0.011920   \n",
       "1036                     0.003442              0.039508   \n",
       "596                      0.006935              0.050343   \n",
       "1060                     0.003323              0.026044   \n",
       "1065                     0.003578              0.029351   \n",
       "1005                     0.005443              0.053412   \n",
       "1039                     0.002560              0.039508   \n",
       "603                      0.005629              0.050343   \n",
       "301                      0.005629              0.074386   \n",
       "1032                     0.006935              0.039508   \n",
       "1071                     0.001746              0.031369   \n",
       "604                      0.003951              0.050343   \n",
       "\n",
       "      co_occurrance_probability  \n",
       "1067                   0.090656  \n",
       "289                    0.069133  \n",
       "1069                   0.066015  \n",
       "593                    0.064324  \n",
       "1047                   0.062816  \n",
       "1068                   0.061151  \n",
       "1070                   0.059850  \n",
       "1064                   0.056928  \n",
       "1072                   0.050584  \n",
       "1036                   0.046190  \n",
       "596                    0.043221  \n",
       "1060                   0.042725  \n",
       "1065                   0.041710  \n",
       "1005                   0.039470  \n",
       "1039                   0.038291  \n",
       "603                    0.037867  \n",
       "301                    0.036872  \n",
       "1032                   0.036510  \n",
       "1071                   0.036354  \n",
       "604                    0.036227  "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Proc_Problem_Probability_merged.sort_values(by='co_occurrance_probability', ascending=False, inplace=True)\n",
    "Proc_Problem_Probability_merged.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "f5c774a1-90ab-4848-8536-ede0eb7db436",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%d_%H-%M-%S\")\n",
    "filename = 'Procedure_Problem_co_occurrance_probability_'+timestamp+'.csv'\n",
    "Proc_Problem_Probability_merged.loc[:,['Problem_CUI', 'icd9_code', 'co_occurrance_probability']].to_csv(filename, index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e8bd0b65-2582-4bc6-a7f0-4cd42856e3c0",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "f2a35b26-c470-4107-982e-128ec584f3b8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f2f847e40a0>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H:%M:%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{filename}\" AS COLUMN\n",
    "MATCH (prob:Concept)\n",
    "WHERE prob.cui = COLUMN.Problem_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "MATCH (proc:D_Icd_Procedures)\n",
    "WHERE proc.icd9_code = COLUMN.icd9_code\n",
    "CREATE (prob)<-[r:OCCURS_WITH {{co_occurrance_probability:toFloat(COLUMN.co_occurrance_probability), source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(proc)\n",
    "'''.format(timestamp=timestamp, filename=filename)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0b3a255d-c1be-4722-a2a1-9928d553a9bf",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "b0c98bf9-a011-467c-979a-96eff1b43d6f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def LikelyOrders(cui_prob_list):\n",
    "    \n",
    "    # Find prescriptions associated with the input problem    \n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Drug']\"]\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.term AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_rx = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    # Find abnormal labs associated with the input problem\n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Attribute']\"]\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.description AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_lab = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    # Find procedures associated with the input problem\n",
    "    query = '''\n",
    "    MATCH p=(ord:D_Icd_Procedures)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list}\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.long_title AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_procedure = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    return orders_likely_rx, orders_likely_lab, orders_likely_procedure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "aa407520-7d1e-4507-883b-d45cc6f0a5c4",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.015000104904174805 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "cui_prob_list = ['C0022661']\n",
    "orders_likely_rx, orders_likely_lab, orders_likely_procedure = LikelyOrders(cui_prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "12559a2c-f8cb-47ad-a3fe-5943e2de2bc6",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>calcitriol 0.00025 MG Oral Capsule</td>\n",
       "      <td>109.59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sevelamer carbonate 800 MG Oral Tablet [Renvela]</td>\n",
       "      <td>106.88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sodium polystyrene sulfonate 250 MG/ML Oral Su...</td>\n",
       "      <td>103.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]</td>\n",
       "      <td>79.31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>150 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>76.26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>100 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>20.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>Docusate Sodium 10 MG/ML Oral Suspension</td>\n",
       "      <td>20.71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>Aspirin 81 MG Chewable Tablet</td>\n",
       "      <td>20.34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>Amiodarone hydrochloride 200 MG Oral Tablet</td>\n",
       "      <td>20.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>50 ML Glucose 500 MG/ML Prefilled Syringe</td>\n",
       "      <td>20.30</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>97 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                Order   Score\n",
       "0                  calcitriol 0.00025 MG Oral Capsule  109.59\n",
       "1    sevelamer carbonate 800 MG Oral Tablet [Renvela]  106.88\n",
       "2   sodium polystyrene sulfonate 250 MG/ML Oral Su...  103.32\n",
       "3   1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]   79.31\n",
       "4                   150 ML Glucose 50 MG/ML Injection   76.26\n",
       "..                                                ...     ...\n",
       "92                  100 ML Glucose 50 MG/ML Injection   20.79\n",
       "93           Docusate Sodium 10 MG/ML Oral Suspension   20.71\n",
       "94                      Aspirin 81 MG Chewable Tablet   20.34\n",
       "95        Amiodarone hydrochloride 200 MG Oral Tablet   20.32\n",
       "96          50 ML Glucose 500 MG/ML Prefilled Syringe   20.30\n",
       "\n",
       "[97 rows x 2 columns]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_rx"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "296da1d1-2931-430b-9d0e-9fdb3fadd145",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Macrophage in Ascites</td>\n",
       "      <td>57.87</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Lymphocytes in Other Body Fluid</td>\n",
       "      <td>57.69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Polys in Other Body Fluid</td>\n",
       "      <td>53.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lymphocytes in Ascites</td>\n",
       "      <td>52.82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>RBC, Ascites in Ascites</td>\n",
       "      <td>51.48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>WBC, Ascites in Ascites</td>\n",
       "      <td>50.71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Monocytes in Ascites</td>\n",
       "      <td>49.68</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Polys in Ascites</td>\n",
       "      <td>48.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Protein/Creatinine Ratio in Urine</td>\n",
       "      <td>48.01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>pH in Urine</td>\n",
       "      <td>44.46</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Calculated Bicarbonate, Whole Blood in Blood</td>\n",
       "      <td>42.64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Protein, Total in Blood</td>\n",
       "      <td>37.49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>NTproBNP in Blood</td>\n",
       "      <td>32.45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Thyroid Stimulating Hormone in Blood</td>\n",
       "      <td>31.22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Amylase in Blood</td>\n",
       "      <td>29.50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>C-Reactive Protein in Blood</td>\n",
       "      <td>28.02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Gamma Glutamyltransferase in Blood</td>\n",
       "      <td>27.92</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Vancomycin in Blood</td>\n",
       "      <td>26.05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Lipase in Blood</td>\n",
       "      <td>25.95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Troponin T in Blood</td>\n",
       "      <td>25.53</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Chloride, Whole Blood in Blood</td>\n",
       "      <td>25.39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>RBC, Pleural in Pleural</td>\n",
       "      <td>25.27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Granular Casts in Urine</td>\n",
       "      <td>25.25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Lymphocytes in Pleural</td>\n",
       "      <td>25.17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Polys in Pleural</td>\n",
       "      <td>25.14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Haptoglobin in Blood</td>\n",
       "      <td>25.03</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>WBC, Pleural in Pleural</td>\n",
       "      <td>24.40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Eosinophils in Blood</td>\n",
       "      <td>24.24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Sedimentation Rate in Blood</td>\n",
       "      <td>23.52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Lactate Dehydrogenase (LD) in Blood</td>\n",
       "      <td>21.91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Hyaline Casts in Urine</td>\n",
       "      <td>21.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Triglycerides in Blood</td>\n",
       "      <td>20.93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Absolute A1c in Blood</td>\n",
       "      <td>20.93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Monocytes in Blood</td>\n",
       "      <td>20.61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Osmolality, Measured in Blood</td>\n",
       "      <td>20.19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>WBC in Urine</td>\n",
       "      <td>20.18</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           Order  Score\n",
       "0                          Macrophage in Ascites  57.87\n",
       "1                Lymphocytes in Other Body Fluid  57.69\n",
       "2                      Polys in Other Body Fluid  53.77\n",
       "3                         Lymphocytes in Ascites  52.82\n",
       "4                        RBC, Ascites in Ascites  51.48\n",
       "5                        WBC, Ascites in Ascites  50.71\n",
       "6                           Monocytes in Ascites  49.68\n",
       "7                               Polys in Ascites  48.77\n",
       "8              Protein/Creatinine Ratio in Urine  48.01\n",
       "9                                    pH in Urine  44.46\n",
       "10  Calculated Bicarbonate, Whole Blood in Blood  42.64\n",
       "11                       Protein, Total in Blood  37.49\n",
       "12                             NTproBNP in Blood  32.45\n",
       "13          Thyroid Stimulating Hormone in Blood  31.22\n",
       "14                              Amylase in Blood  29.50\n",
       "15                   C-Reactive Protein in Blood  28.02\n",
       "16            Gamma Glutamyltransferase in Blood  27.92\n",
       "17                           Vancomycin in Blood  26.05\n",
       "18                               Lipase in Blood  25.95\n",
       "19                           Troponin T in Blood  25.53\n",
       "20                Chloride, Whole Blood in Blood  25.39\n",
       "21                       RBC, Pleural in Pleural  25.27\n",
       "22                       Granular Casts in Urine  25.25\n",
       "23                        Lymphocytes in Pleural  25.17\n",
       "24                              Polys in Pleural  25.14\n",
       "25                          Haptoglobin in Blood  25.03\n",
       "26                       WBC, Pleural in Pleural  24.40\n",
       "27                          Eosinophils in Blood  24.24\n",
       "28                   Sedimentation Rate in Blood  23.52\n",
       "29           Lactate Dehydrogenase (LD) in Blood  21.91\n",
       "30                        Hyaline Casts in Urine  21.00\n",
       "31                        Triglycerides in Blood  20.93\n",
       "32                         Absolute A1c in Blood  20.93\n",
       "33                            Monocytes in Blood  20.61\n",
       "34                 Osmolality, Measured in Blood  20.19\n",
       "35                                  WBC in Urine  20.18"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_lab"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "9c89371b-5174-48fd-8516-9183a58f580b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hemodialysis</td>\n",
       "      <td>69.13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Venous catheterization for renal dialysis</td>\n",
       "      <td>64.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Other endoscopy of small intestine</td>\n",
       "      <td>24.70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Closed [endoscopic] biopsy of bronchus</td>\n",
       "      <td>23.03</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Venous catheterization, not elsewhere classified</td>\n",
       "      <td>21.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Transfusion of packed cells</td>\n",
       "      <td>21.29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Insertion of endotracheal tube</td>\n",
       "      <td>20.16</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              Order  Score\n",
       "0                                      Hemodialysis  69.13\n",
       "1         Venous catheterization for renal dialysis  64.32\n",
       "2                Other endoscopy of small intestine  24.70\n",
       "3            Closed [endoscopic] biopsy of bronchus  23.03\n",
       "4  Venous catheterization, not elsewhere classified  21.32\n",
       "5                       Transfusion of packed cells  21.29\n",
       "6                    Insertion of endotracheal tube  20.16"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_procedure"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
