{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "2b52634a-f573-4d72-a5d1-a2c241283757",
   "metadata": {},
   "source": [
    "# Virtualized Patient Population"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5701f88b-c58b-469a-9da6-1055e6b93639",
   "metadata": {},
   "source": [
    "To-Do:\n",
    "- Incorporate ICD diagnoses into problems\n",
    "- Incorporate ICD procedures into treatments\n",
    "- Create OCCURS_WITH relationships between entities of interest that have z-scores or odds ratios\n",
    "- Figure out how to add timedeltas between problems and the change in z-scores for labs or the occurrance of prescriptions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "1f733621-b233-4472-9966-28bc7dd1215b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "from progressbar import ProgressBar\n",
    "import pandas as pd\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "93bbac78-1362-4ee4-b6ed-bd6e111e9da3",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j','NikeshIsCool'))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "77e3cdb0-c2d8-4b28-b720-5d5e390d0f95",
   "metadata": {},
   "source": [
    "Entities of interest:\n",
    "- Caregivers\n",
    "- Patients\n",
    "- Problem\n",
    "- Prescriptions -> Concept\n",
    "- Labevents -> D_Labitems -> Concept\n",
    "- Diagnoses_Icd -> D_Icd_Diagnoses -> Concept (timedelta of limited utility, since ICD codes pertain to entire admission)\n",
    "- Procedures_Icd -> D_Icd_Procedures -> Concept (timedelta of limited utility, since ICD codes pertain to entire admission)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9507212d-6d21-4e00-8f5d-a46622915002",
   "metadata": {},
   "source": [
    "Relationships to create between entities of interest:\n",
    "![virtualized relationships](images/Virtual_relationship_schema.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7e1d71c-440a-459b-8b5e-c00c4cd01f81",
   "metadata": {},
   "source": [
    "We'll start with these relationships to improve performance on our current use cases:  \n",
    "(:Problem) - [:INSTANCE_OF] -> (:Concept) - [:OCCURS_WITH {odds_ratio: __, source: 'MIMIC-III v1.4', updated: timestamp}] - (:Concept) <- [:INSTANCE_OF] - (:Prescriptions)  \n",
    "(:Problem) - [:INSTANCE_OF] -> (:Concept) - [:OCCURS_WITH {odds_ratio: __, z_score: __, source: 'MIMIC-III v1.4', updated: timestamp}] - (:Concept) <- [:INSTANCE_OF] - (:Labevents)  "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2d569796-53a2-437d-aa68-3dddf323e5de",
   "metadata": {},
   "source": [
    "## Probability of a prescription-problem pair occuring together vs separately"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "882e3e58-de76-4710-9474-160d9850dbcf",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(ad)) AS probTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability, Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "ORDER BY problem_gen_pop_probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "25aa9a68-87c1-4eaf-99e1-4d8a406f80b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each prescription in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD]-(rx:Prescriptions)-[:INSTANCE_OF]->(b:Concept)\n",
    "WITH b.cui AS Rx_CUI, count(distinct(ad)) AS RxTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Rx_CUI, toFloat(RxTotal)/ptTotal AS RxProbability\n",
    "ORDER BY RxProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Rx_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "b0807c7f-13b3-4df5-b528-e7135338e121",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of prescription and problem\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients), (p:Problem)<-[:HAD_PROBLEM]-(Pt)-[:HAD]-(rx:Prescriptions)-[:INSTANCE_OF]->(c:Concept)\n",
    "WITH p.cui AS Problem_CUI, c.cui AS Rx_CUI, count(distinct(ad)) AS RxProbTotal, ptTotal, count(distinct(Pt)) AS Pts\n",
    "WHERE Pts > 20\n",
    "RETURN Problem_CUI, Rx_CUI, toFloat(RxProbTotal)/ptTotal AS Rx_Problem_Probability\n",
    "ORDER BY Rx_Problem_Probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Rx_Problem_Probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "a2e2c3bf-ca44-4347-8acf-9d9788c65d45",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "465\n",
      "946\n",
      "11073\n"
     ]
    }
   ],
   "source": [
    "print(len(problem_gen_pop_probability))\n",
    "print(len(Rx_gen_pop_probability))\n",
    "print(len(Rx_Problem_Probability))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "7ebd724a-ed20-4a2f-98e1-11c57e6e9558",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>RxProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.008665</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.022833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.007698</td>\n",
       "      <td>0.008427</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.020343</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.007291</td>\n",
       "      <td>0.007902</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.019295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.006664</td>\n",
       "      <td>0.007138</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.017670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>C0977439</td>\n",
       "      <td>0.006613</td>\n",
       "      <td>0.007003</td>\n",
       "      <td>0.369981</td>\n",
       "      <td>0.017541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11068</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0980635</td>\n",
       "      <td>0.001882</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.031708</td>\n",
       "      <td>0.053314</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11069</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001713</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.096743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11070</th>\n",
       "      <td>C0236663</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001543</td>\n",
       "      <td>0.001797</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.097015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11071</th>\n",
       "      <td>C1321878</td>\n",
       "      <td>C0354080</td>\n",
       "      <td>0.000899</td>\n",
       "      <td>0.002120</td>\n",
       "      <td>0.028639</td>\n",
       "      <td>0.029217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11072</th>\n",
       "      <td>C0014867</td>\n",
       "      <td>C0689706</td>\n",
       "      <td>0.001085</td>\n",
       "      <td>0.001611</td>\n",
       "      <td>0.018499</td>\n",
       "      <td>0.053963</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>11073 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability  \\\n",
       "0        C0022661  C0977439                0.008665   \n",
       "1        C0020517  C0977439                0.007698   \n",
       "2        C0011860  C0977439                0.007291   \n",
       "3        C2830004  C0977439                0.006664   \n",
       "4        C0039239  C0977439                0.006613   \n",
       "...           ...       ...                     ...   \n",
       "11068    C0085762  C0980635                0.001882   \n",
       "11069    C0085762  C0688559                0.001713   \n",
       "11070    C0236663  C0688559                0.001543   \n",
       "11071    C1321878  C0354080                0.000899   \n",
       "11072    C0014867  C0689706                0.001085   \n",
       "\n",
       "       problem_gen_pop_probability  RxProbability  co_occurrance_probability  \n",
       "0                         0.009495       0.369981                   0.022833  \n",
       "1                         0.008427       0.369981                   0.020343  \n",
       "2                         0.007902       0.369981                   0.019295  \n",
       "3                         0.007138       0.369981                   0.017670  \n",
       "4                         0.007003       0.369981                   0.017541  \n",
       "...                            ...            ...                        ...  \n",
       "11068                     0.003595       0.031708                   0.053314  \n",
       "11069                     0.003595       0.014107                   0.096743  \n",
       "11070                     0.001797       0.014107                   0.097015  \n",
       "11071                     0.002120       0.028639                   0.029217  \n",
       "11072                     0.001611       0.018499                   0.053963  \n",
       "\n",
       "[11073 rows x 6 columns]"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability_merged = pd.merge(Rx_Problem_Probability, problem_gen_pop_probability, on=['Problem_CUI'])\n",
    "Rx_Problem_Probability_merged = pd.merge(Rx_Problem_Probability_merged, Rx_gen_pop_probability, on=['Rx_CUI'])\n",
    "Rx_Problem_Probability_merged['co_occurrance_probability'] = Rx_Problem_Probability_merged.Rx_Problem_Probability / (Rx_Problem_Probability_merged.problem_gen_pop_probability + Rx_Problem_Probability_merged.RxProbability)\n",
    "Rx_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "9b0d4d27-86ba-4af5-9274-a0d8e80794ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Rx_CUI</th>\n",
       "      <th>Rx_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>RxProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>11020</th>\n",
       "      <td>C0021400</td>\n",
       "      <td>C0875805</td>\n",
       "      <td>0.003306</td>\n",
       "      <td>0.006409</td>\n",
       "      <td>0.012361</td>\n",
       "      <td>0.176152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11060</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1584819</td>\n",
       "      <td>0.002052</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.014582</td>\n",
       "      <td>0.113829</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9713</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0975120</td>\n",
       "      <td>0.002577</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.014023</td>\n",
       "      <td>0.109589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9385</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C1967412</td>\n",
       "      <td>0.002899</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.017634</td>\n",
       "      <td>0.106875</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9538</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.002798</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.017583</td>\n",
       "      <td>0.103319</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11070</th>\n",
       "      <td>C0236663</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001543</td>\n",
       "      <td>0.001797</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.097015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11069</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0688559</td>\n",
       "      <td>0.001713</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.014107</td>\n",
       "      <td>0.096743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11049</th>\n",
       "      <td>C0036572</td>\n",
       "      <td>C1739168</td>\n",
       "      <td>0.002425</td>\n",
       "      <td>0.005087</td>\n",
       "      <td>0.022179</td>\n",
       "      <td>0.088930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11045</th>\n",
       "      <td>C0036572</td>\n",
       "      <td>C0875827</td>\n",
       "      <td>0.002577</td>\n",
       "      <td>0.005087</td>\n",
       "      <td>0.026197</td>\n",
       "      <td>0.082385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11064</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0690704</td>\n",
       "      <td>0.000882</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.007545</td>\n",
       "      <td>0.080247</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9716</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0706911</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.022789</td>\n",
       "      <td>0.079307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9541</th>\n",
       "      <td>C0022658</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.005629</td>\n",
       "      <td>0.017583</td>\n",
       "      <td>0.078159</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11051</th>\n",
       "      <td>C0014544</td>\n",
       "      <td>C1739168</td>\n",
       "      <td>0.002001</td>\n",
       "      <td>0.003832</td>\n",
       "      <td>0.022179</td>\n",
       "      <td>0.076923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7564</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C4082775</td>\n",
       "      <td>0.004188</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.045425</td>\n",
       "      <td>0.076258</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9540</th>\n",
       "      <td>C0302148</td>\n",
       "      <td>C1951501</td>\n",
       "      <td>0.001831</td>\n",
       "      <td>0.006935</td>\n",
       "      <td>0.017583</td>\n",
       "      <td>0.074689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11055</th>\n",
       "      <td>C0745138</td>\n",
       "      <td>C0978059</td>\n",
       "      <td>0.002340</td>\n",
       "      <td>0.003679</td>\n",
       "      <td>0.027757</td>\n",
       "      <td>0.074434</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11026</th>\n",
       "      <td>C0004604</td>\n",
       "      <td>C0689665</td>\n",
       "      <td>0.001797</td>\n",
       "      <td>0.005511</td>\n",
       "      <td>0.019805</td>\n",
       "      <td>0.070998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10048</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0710995</td>\n",
       "      <td>0.002374</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.023942</td>\n",
       "      <td>0.070994</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11005</th>\n",
       "      <td>C0206698</td>\n",
       "      <td>C1329616</td>\n",
       "      <td>0.001984</td>\n",
       "      <td>0.005121</td>\n",
       "      <td>0.023315</td>\n",
       "      <td>0.069767</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10782</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0978650</td>\n",
       "      <td>0.001390</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.016990</td>\n",
       "      <td>0.068050</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Problem_CUI    Rx_CUI  Rx_Problem_Probability  \\\n",
       "11020    C0021400  C0875805                0.003306   \n",
       "11060    C0085605  C1584819                0.002052   \n",
       "9713     C0022661  C0975120                0.002577   \n",
       "9385     C0022661  C1967412                0.002899   \n",
       "9538     C0022661  C1951501                0.002798   \n",
       "11070    C0236663  C0688559                0.001543   \n",
       "11069    C0085762  C0688559                0.001713   \n",
       "11049    C0036572  C1739168                0.002425   \n",
       "11045    C0036572  C0875827                0.002577   \n",
       "11064    C0085605  C0690704                0.000882   \n",
       "9716     C0022661  C0706911                0.002560   \n",
       "9541     C0022658  C1951501                0.001814   \n",
       "11051    C0014544  C1739168                0.002001   \n",
       "7564     C0022661  C4082775                0.004188   \n",
       "9540     C0302148  C1951501                0.001831   \n",
       "11055    C0745138  C0978059                0.002340   \n",
       "11026    C0004604  C0689665                0.001797   \n",
       "10048    C0022661  C0710995                0.002374   \n",
       "11005    C0206698  C1329616                0.001984   \n",
       "10782    C0085605  C0978650                0.001390   \n",
       "\n",
       "       problem_gen_pop_probability  RxProbability  co_occurrance_probability  \n",
       "11020                     0.006409       0.012361                   0.176152  \n",
       "11060                     0.003442       0.014582                   0.113829  \n",
       "9713                      0.009495       0.014023                   0.109589  \n",
       "9385                      0.009495       0.017634                   0.106875  \n",
       "9538                      0.009495       0.017583                   0.103319  \n",
       "11070                     0.001797       0.014107                   0.097015  \n",
       "11069                     0.003595       0.014107                   0.096743  \n",
       "11049                     0.005087       0.022179                   0.088930  \n",
       "11045                     0.005087       0.026197                   0.082385  \n",
       "11064                     0.003442       0.007545                   0.080247  \n",
       "9716                      0.009495       0.022789                   0.079307  \n",
       "9541                      0.005629       0.017583                   0.078159  \n",
       "11051                     0.003832       0.022179                   0.076923  \n",
       "7564                      0.009495       0.045425                   0.076258  \n",
       "9540                      0.006935       0.017583                   0.074689  \n",
       "11055                     0.003679       0.027757                   0.074434  \n",
       "11026                     0.005511       0.019805                   0.070998  \n",
       "10048                     0.009495       0.023942                   0.070994  \n",
       "11005                     0.005121       0.023315                   0.069767  \n",
       "10782                     0.003442       0.016990                   0.068050  "
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Rx_Problem_Probability_merged.sort_values(by='co_occurrance_probability', ascending=False, inplace=True)\n",
    "Rx_Problem_Probability_merged.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "32f042f5-9aa7-4386-b548-cc86194fdd05",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%d_%H-%M-%S\")\n",
    "filename = 'Rx_Problem_co_occurrance_probability_'+timestamp+'.csv'\n",
    "Rx_Problem_Probability_merged.loc[:,['Problem_CUI', 'Rx_CUI', 'co_occurrance_probability']].to_csv(filename, index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d4a3f3fd-c735-486c-a7c3-c2e5815b907d",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "2ff9a494-97ae-40db-aa00-ca61a25a427b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f6e96d6cd30>"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H:%M:%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{filename}\" AS COLUMN\n",
    "MATCH (prob:Concept)\n",
    "WHERE prob.cui = COLUMN.Problem_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "MATCH (rx:Concept)\n",
    "WHERE rx.cui = COLUMN.Rx_CUI AND rx.cui_pref_term IS NOT NULL\n",
    "CREATE (prob)<-[r:OCCURS_WITH {{co_occurrance_probability:toFloat(COLUMN.co_occurrance_probability), source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(rx)\n",
    "'''.format(timestamp=timestamp, filename=filename)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ff464f64-d750-4139-895b-695441343bd3",
   "metadata": {},
   "source": [
    "## Probability of a prescription-problem pair occuring together vs separately"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "c89cc1d2-e7ea-44d4-af68-c1d8a443a39d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each Problem in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD_PROBLEM]-(b:Problem)\n",
    "WITH b.cui AS Problem_CUI, count(distinct(ad)) AS probTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WITH Problem_CUI, toFloat(probTotal)/ptTotal AS problem_gen_pop_probability, Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Problem_CUI, problem_gen_pop_probability\n",
    "ORDER BY problem_gen_pop_probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "problem_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "777cd618-dfea-45fc-bec4-be584008394c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of each abnormal lab in the general population\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients)-[:HAD]-(lab:Labevents)-[:INSTANCE_OF]->(b:Concept)\n",
    "WHERE lab.flag IS NOT NULL\n",
    "WITH b.cui AS Lab_CUI, count(distinct(ad)) AS LabTotal, ptTotal, count(distinct(Pt)) AS Pt\n",
    "WHERE Pt > 20\n",
    "RETURN Lab_CUI, toFloat(LabTotal)/ptTotal AS LabAbnormalProbability\n",
    "ORDER BY LabAbnormalProbability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Lab_gen_pop_probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "id": "d2e6e089-9047-41a2-9728-51766263ab17",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the probability of a specific pair of abnormal lab and problem\n",
    "query = '''\n",
    "MATCH (ptTotal:Admissions)\n",
    "WITH count(ptTotal) AS ptTotal\n",
    "MATCH (ad:Admissions)<-[:HAD]-(Pt:Patients), (p:Problem)<-[:HAD_PROBLEM]-(Pt)-[:HAD]-(lab:Labevents)-[:INSTANCE_OF]->(c:Concept)\n",
    "WHERE lab.flag IS NOT NULL\n",
    "WITH p.cui AS Problem_CUI, c.cui AS Lab_CUI, count(distinct(ad)) AS LabProbTotal, ptTotal, count(distinct(Pt)) AS Pts\n",
    "WHERE Pts > 30\n",
    "RETURN Problem_CUI, Lab_CUI, toFloat(LabProbTotal)/ptTotal AS Lab_Problem_Probability\n",
    "ORDER BY Lab_Problem_Probability DESC\n",
    "'''\n",
    "data = session.run(query)\n",
    "Lab_Problem_Probability = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 138,
   "id": "99cb3711-89a3-4dda-aadb-44fb6cb59fe9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>0.008427</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>0.007902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>0.007138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>0.007003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>460</th>\n",
       "      <td>C0085669</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>461</th>\n",
       "      <td>C0017086</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>462</th>\n",
       "      <td>C0155626</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>463</th>\n",
       "      <td>C0575090</td>\n",
       "      <td>0.000577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>464</th>\n",
       "      <td>C0683278</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>465 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Problem_CUI  problem_gen_pop_probability\n",
       "0      C0022661                     0.009495\n",
       "1      C0020517                     0.008427\n",
       "2      C0011860                     0.007902\n",
       "3      C2830004                     0.007138\n",
       "4      C0039239                     0.007003\n",
       "..          ...                          ...\n",
       "460    C0085669                     0.000577\n",
       "461    C0017086                     0.000577\n",
       "462    C0155626                     0.000577\n",
       "463    C0575090                     0.000577\n",
       "464    C0683278                     0.000560\n",
       "\n",
       "[465 rows x 2 columns]"
      ]
     },
     "execution_count": 138,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "problem_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "id": "fac224e4-c39c-4e46-9ee6-63f22c0edc7f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>LabAbnormalProbability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0362923</td>\n",
       "      <td>0.921595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0366777</td>\n",
       "      <td>0.901265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.877916</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0362934</td>\n",
       "      <td>0.812636</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0362978</td>\n",
       "      <td>0.755358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>174</th>\n",
       "      <td>C1114256</td>\n",
       "      <td>0.001017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>175</th>\n",
       "      <td>C0801528</td>\n",
       "      <td>0.000763</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>176</th>\n",
       "      <td>C0943517</td>\n",
       "      <td>0.000712</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>177</th>\n",
       "      <td>C0365157</td>\n",
       "      <td>0.000560</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>178</th>\n",
       "      <td>C0483101</td>\n",
       "      <td>0.000543</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>179 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Lab_CUI  LabAbnormalProbability\n",
       "0    C0362923                0.921595\n",
       "1    C0366777                0.901265\n",
       "2    C0362910                0.877916\n",
       "3    C0362934                0.812636\n",
       "4    C0362978                0.755358\n",
       "..        ...                     ...\n",
       "174  C1114256                0.001017\n",
       "175  C0801528                0.000763\n",
       "176  C0943517                0.000712\n",
       "177  C0365157                0.000560\n",
       "178  C0483101                0.000543\n",
       "\n",
       "[179 rows x 2 columns]"
      ]
     },
     "execution_count": 139,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Lab_gen_pop_probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "id": "ea12e9ce-b8b2-49bd-9191-a861acc41d55",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>Lab_Problem_Probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0366777</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0362923</td>\n",
       "      <td>0.009495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0364096</td>\n",
       "      <td>0.009241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0364133</td>\n",
       "      <td>0.009224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8027</th>\n",
       "      <td>C0085616</td>\n",
       "      <td>C0362947</td>\n",
       "      <td>0.000746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8028</th>\n",
       "      <td>C0268398</td>\n",
       "      <td>C0363885</td>\n",
       "      <td>0.000729</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8029</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>C0362947</td>\n",
       "      <td>0.000712</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8030</th>\n",
       "      <td>C0026771</td>\n",
       "      <td>C1369594</td>\n",
       "      <td>0.000712</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8031</th>\n",
       "      <td>C3263723</td>\n",
       "      <td>C0550246</td>\n",
       "      <td>0.000695</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>8032 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Problem_CUI   Lab_CUI  Lab_Problem_Probability\n",
       "0       C0022661  C0362910                 0.009495\n",
       "1       C0022661  C0366777                 0.009495\n",
       "2       C0022661  C0362923                 0.009495\n",
       "3       C0022661  C0364096                 0.009241\n",
       "4       C0022661  C0364133                 0.009224\n",
       "...          ...       ...                      ...\n",
       "8027    C0085616  C0362947                 0.000746\n",
       "8028    C0268398  C0363885                 0.000729\n",
       "8029    C0026771  C0362947                 0.000712\n",
       "8030    C0026771  C1369594                 0.000712\n",
       "8031    C3263723  C0550246                 0.000695\n",
       "\n",
       "[8032 rows x 3 columns]"
      ]
     },
     "execution_count": 140,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Lab_Problem_Probability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "id": "62280649-0ded-4e25-bdc4-00825c7e759f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>Lab_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>LabAbnormalProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.877916</td>\n",
       "      <td>0.010700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0020517</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.008308</td>\n",
       "      <td>0.008427</td>\n",
       "      <td>0.877916</td>\n",
       "      <td>0.009374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0011860</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.007868</td>\n",
       "      <td>0.007902</td>\n",
       "      <td>0.877916</td>\n",
       "      <td>0.008882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.007105</td>\n",
       "      <td>0.007138</td>\n",
       "      <td>0.877916</td>\n",
       "      <td>0.008027</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0039239</td>\n",
       "      <td>C0362910</td>\n",
       "      <td>0.006884</td>\n",
       "      <td>0.007003</td>\n",
       "      <td>0.877916</td>\n",
       "      <td>0.007779</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8027</th>\n",
       "      <td>C0003962</td>\n",
       "      <td>C0942478</td>\n",
       "      <td>0.001594</td>\n",
       "      <td>0.002560</td>\n",
       "      <td>0.033963</td>\n",
       "      <td>0.043640</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8028</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0942450</td>\n",
       "      <td>0.001899</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.030097</td>\n",
       "      <td>0.056623</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8029</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1544491</td>\n",
       "      <td>0.001882</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.028300</td>\n",
       "      <td>0.059295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8030</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1114285</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.026095</td>\n",
       "      <td>0.061424</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8031</th>\n",
       "      <td>C0031039</td>\n",
       "      <td>C0942431</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.021619</td>\n",
       "      <td>0.074825</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>8032 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Problem_CUI   Lab_CUI  Lab_Problem_Probability  \\\n",
       "0       C0022661  C0362910                 0.009495   \n",
       "1       C0020517  C0362910                 0.008308   \n",
       "2       C0011860  C0362910                 0.007868   \n",
       "3       C2830004  C0362910                 0.007105   \n",
       "4       C0039239  C0362910                 0.006884   \n",
       "...          ...       ...                      ...   \n",
       "8027    C0003962  C0942478                 0.001594   \n",
       "8028    C0085605  C0942450                 0.001899   \n",
       "8029    C0085605  C1544491                 0.001882   \n",
       "8030    C0085605  C1114285                 0.001814   \n",
       "8031    C0031039  C0942431                 0.001814   \n",
       "\n",
       "      problem_gen_pop_probability  LabAbnormalProbability  \\\n",
       "0                        0.009495                0.877916   \n",
       "1                        0.008427                0.877916   \n",
       "2                        0.007902                0.877916   \n",
       "3                        0.007138                0.877916   \n",
       "4                        0.007003                0.877916   \n",
       "...                           ...                     ...   \n",
       "8027                     0.002560                0.033963   \n",
       "8028                     0.003442                0.030097   \n",
       "8029                     0.003442                0.028300   \n",
       "8030                     0.003442                0.026095   \n",
       "8031                     0.002628                0.021619   \n",
       "\n",
       "      co_occurrance_probability  \n",
       "0                      0.010700  \n",
       "1                      0.009374  \n",
       "2                      0.008882  \n",
       "3                      0.008027  \n",
       "4                      0.007779  \n",
       "...                         ...  \n",
       "8027                   0.043640  \n",
       "8028                   0.056623  \n",
       "8029                   0.059295  \n",
       "8030                   0.061424  \n",
       "8031                   0.074825  \n",
       "\n",
       "[8032 rows x 6 columns]"
      ]
     },
     "execution_count": 141,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Lab_Problem_Probability_merged = pd.merge(Lab_Problem_Probability, problem_gen_pop_probability, on=['Problem_CUI'])\n",
    "Lab_Problem_Probability_merged = pd.merge(Lab_Problem_Probability_merged, Lab_gen_pop_probability, on=['Lab_CUI'])\n",
    "Lab_Problem_Probability_merged['co_occurrance_probability'] = Lab_Problem_Probability_merged.Lab_Problem_Probability / (Lab_Problem_Probability_merged.problem_gen_pop_probability + Lab_Problem_Probability_merged.LabAbnormalProbability)\n",
    "Lab_Problem_Probability_merged"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "id": "42977c87-50be-448d-9f4f-a158f6da3e7c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Problem_CUI</th>\n",
       "      <th>Lab_CUI</th>\n",
       "      <th>Lab_Problem_Probability</th>\n",
       "      <th>problem_gen_pop_probability</th>\n",
       "      <th>LabAbnormalProbability</th>\n",
       "      <th>co_occurrance_probability</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>8031</th>\n",
       "      <td>C0031039</td>\n",
       "      <td>C0942431</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.021619</td>\n",
       "      <td>0.074825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8009</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C1544494</td>\n",
       "      <td>0.002866</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.033030</td>\n",
       "      <td>0.073606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8010</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C1114284</td>\n",
       "      <td>0.002645</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.031623</td>\n",
       "      <td>0.070493</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8007</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C0942424</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.044849</td>\n",
       "      <td>0.067825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8005</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C0942443</td>\n",
       "      <td>0.003459</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.046409</td>\n",
       "      <td>0.066126</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8006</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C0942432</td>\n",
       "      <td>0.003459</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.048189</td>\n",
       "      <td>0.063950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8008</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C0942477</td>\n",
       "      <td>0.003340</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.046493</td>\n",
       "      <td>0.063754</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8011</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C1315831</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.035743</td>\n",
       "      <td>0.063111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8030</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1114285</td>\n",
       "      <td>0.001814</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.026095</td>\n",
       "      <td>0.061424</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8029</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C1544491</td>\n",
       "      <td>0.001882</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.028300</td>\n",
       "      <td>0.059295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8020</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0799525</td>\n",
       "      <td>0.002103</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.032929</td>\n",
       "      <td>0.057809</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8028</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0942450</td>\n",
       "      <td>0.001899</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.030097</td>\n",
       "      <td>0.056623</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8012</th>\n",
       "      <td>C0032227</td>\n",
       "      <td>C1114241</td>\n",
       "      <td>0.001272</td>\n",
       "      <td>0.005901</td>\n",
       "      <td>0.017024</td>\n",
       "      <td>0.055473</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8025</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0942444</td>\n",
       "      <td>0.002001</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.034166</td>\n",
       "      <td>0.053201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8023</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0942425</td>\n",
       "      <td>0.002035</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.035302</td>\n",
       "      <td>0.052516</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8019</th>\n",
       "      <td>C0085762</td>\n",
       "      <td>C0367799</td>\n",
       "      <td>0.002120</td>\n",
       "      <td>0.003595</td>\n",
       "      <td>0.036896</td>\n",
       "      <td>0.052345</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8026</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0942478</td>\n",
       "      <td>0.001950</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.033963</td>\n",
       "      <td>0.052131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8021</th>\n",
       "      <td>C0085605</td>\n",
       "      <td>C0945358</td>\n",
       "      <td>0.002052</td>\n",
       "      <td>0.003442</td>\n",
       "      <td>0.035981</td>\n",
       "      <td>0.052043</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7998</th>\n",
       "      <td>C0031039</td>\n",
       "      <td>C0549816</td>\n",
       "      <td>0.002170</td>\n",
       "      <td>0.002628</td>\n",
       "      <td>0.041356</td>\n",
       "      <td>0.049345</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7632</th>\n",
       "      <td>C0022661</td>\n",
       "      <td>C0365034</td>\n",
       "      <td>0.004307</td>\n",
       "      <td>0.009495</td>\n",
       "      <td>0.080219</td>\n",
       "      <td>0.048006</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Problem_CUI   Lab_CUI  Lab_Problem_Probability  \\\n",
       "8031    C0031039  C0942431                 0.001814   \n",
       "8009    C0032227  C1544494                 0.002866   \n",
       "8010    C0032227  C1114284                 0.002645   \n",
       "8007    C0032227  C0942424                 0.003442   \n",
       "8005    C0032227  C0942443                 0.003459   \n",
       "8006    C0032227  C0942432                 0.003459   \n",
       "8008    C0032227  C0942477                 0.003340   \n",
       "8011    C0032227  C1315831                 0.002628   \n",
       "8030    C0085605  C1114285                 0.001814   \n",
       "8029    C0085605  C1544491                 0.001882   \n",
       "8020    C0085605  C0799525                 0.002103   \n",
       "8028    C0085605  C0942450                 0.001899   \n",
       "8012    C0032227  C1114241                 0.001272   \n",
       "8025    C0085605  C0942444                 0.002001   \n",
       "8023    C0085605  C0942425                 0.002035   \n",
       "8019    C0085762  C0367799                 0.002120   \n",
       "8026    C0085605  C0942478                 0.001950   \n",
       "8021    C0085605  C0945358                 0.002052   \n",
       "7998    C0031039  C0549816                 0.002170   \n",
       "7632    C0022661  C0365034                 0.004307   \n",
       "\n",
       "      problem_gen_pop_probability  LabAbnormalProbability  \\\n",
       "8031                     0.002628                0.021619   \n",
       "8009                     0.005901                0.033030   \n",
       "8010                     0.005901                0.031623   \n",
       "8007                     0.005901                0.044849   \n",
       "8005                     0.005901                0.046409   \n",
       "8006                     0.005901                0.048189   \n",
       "8008                     0.005901                0.046493   \n",
       "8011                     0.005901                0.035743   \n",
       "8030                     0.003442                0.026095   \n",
       "8029                     0.003442                0.028300   \n",
       "8020                     0.003442                0.032929   \n",
       "8028                     0.003442                0.030097   \n",
       "8012                     0.005901                0.017024   \n",
       "8025                     0.003442                0.034166   \n",
       "8023                     0.003442                0.035302   \n",
       "8019                     0.003595                0.036896   \n",
       "8026                     0.003442                0.033963   \n",
       "8021                     0.003442                0.035981   \n",
       "7998                     0.002628                0.041356   \n",
       "7632                     0.009495                0.080219   \n",
       "\n",
       "      co_occurrance_probability  \n",
       "8031                   0.074825  \n",
       "8009                   0.073606  \n",
       "8010                   0.070493  \n",
       "8007                   0.067825  \n",
       "8005                   0.066126  \n",
       "8006                   0.063950  \n",
       "8008                   0.063754  \n",
       "8011                   0.063111  \n",
       "8030                   0.061424  \n",
       "8029                   0.059295  \n",
       "8020                   0.057809  \n",
       "8028                   0.056623  \n",
       "8012                   0.055473  \n",
       "8025                   0.053201  \n",
       "8023                   0.052516  \n",
       "8019                   0.052345  \n",
       "8026                   0.052131  \n",
       "8021                   0.052043  \n",
       "7998                   0.049345  \n",
       "7632                   0.048006  "
      ]
     },
     "execution_count": 142,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Lab_Problem_Probability_merged.sort_values(by='co_occurrance_probability', ascending=False, inplace=True)\n",
    "Lab_Problem_Probability_merged.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "08eed70a-1b78-4289-ba76-46c85fe4e2bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%d_%H-%M-%S\")\n",
    "filename = 'LabAbnormal_Problem_co_occurrance_probability_'+timestamp+'.csv'\n",
    "Lab_Problem_Probability_merged.loc[:,['Problem_CUI', 'Lab_CUI', 'co_occurrance_probability']].to_csv(filename, index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b36a183f-5b1e-4894-bb66-1ca1f0145294",
   "metadata": {},
   "source": [
    "Move the CSV into the database's Import folder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "54c1a13f-e31d-4d9c-956a-f2209832c7d7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f0c33e0ab80>"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import the co-occurance probabilities into the database\n",
    "timestamp = datetime.now().strftime(\"%Y-%m-%dT%H:%M:%S\")\n",
    "\n",
    "command = '''\n",
    "USING PERIODIC COMMIT 100000 LOAD CSV WITH HEADERS FROM \"file:///{filename}\" AS COLUMN\n",
    "MATCH (prob:Concept)\n",
    "WHERE prob.cui = COLUMN.Problem_CUI AND prob.cui_pref_term IS NOT NULL\n",
    "MATCH (lab:Concept)\n",
    "WHERE lab.cui = COLUMN.Lab_CUI AND lab.cui_pref_term IS NOT NULL\n",
    "CREATE (prob)<-[r:OCCURS_WITH {{co_occurrance_probability:toFloat(COLUMN.co_occurrance_probability), source:'MIMIC-III v1.4', updated:'{timestamp}'}}]-(lab)\n",
    "'''.format(timestamp=timestamp, filename=filename)\n",
    "\n",
    "session.run(command)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0b3a255d-c1be-4722-a2a1-9928d553a9bf",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "b0c98bf9-a011-467c-979a-96eff1b43d6f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def LikelyOrders(cui_prob_list):\n",
    "        \n",
    "    query = '''\n",
    "    MATCH p=(rx:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list}\n",
    "    WITH round(r.co_occurrance_probability, 3)*1000 AS Score, rx, r\n",
    "    WHERE Score > 1\n",
    "    RETURN rx.term AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    LikelyOrders = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    return LikelyOrders"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "aa407520-7d1e-4507-883b-d45cc6f0a5c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.015894651412963867 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>rifaximin 200 MG Oral Tablet [XIFAXAN]</td>\n",
       "      <td>67.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>50 ML albumin human, USP 250 MG/ML Injection</td>\n",
       "      <td>19.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ceftriaxone 1000 MG Injection</td>\n",
       "      <td>12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1000 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>100 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>pantoprazole 40 MG Injection [Protonix]</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>200 ML vancomycin 5 MG/ML Injection</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1000 ML Sodium Chloride 9 MG/ML Injection</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>500 ML Sodium Chloride 9 MG/ML Injection</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>heparin sodium, porcine 5000 UNT/ML Injectable...</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>pantoprazole 40 MG Delayed Release Oral Tablet...</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>50 ML Magnesium Sulfate 40 MG/ML Injection</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>250 ML Sodium Chloride 9 MG/ML Injection</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>50 ML potassium chloride 0.4 MEQ/ML Injection</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>100 ML Sodium Chloride 9 MG/ML Injection</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>250 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                Order  Score\n",
       "0              rifaximin 200 MG Oral Tablet [XIFAXAN]   67.0\n",
       "1        50 ML albumin human, USP 250 MG/ML Injection   19.0\n",
       "2                       Ceftriaxone 1000 MG Injection   12.0\n",
       "3                  1000 ML Glucose 50 MG/ML Injection    6.0\n",
       "4                   100 ML Glucose 50 MG/ML Injection    5.0\n",
       "5             pantoprazole 40 MG Injection [Protonix]    4.0\n",
       "6                 200 ML vancomycin 5 MG/ML Injection    3.0\n",
       "7           1000 ML Sodium Chloride 9 MG/ML Injection    3.0\n",
       "8            500 ML Sodium Chloride 9 MG/ML Injection    3.0\n",
       "9   heparin sodium, porcine 5000 UNT/ML Injectable...    3.0\n",
       "10  pantoprazole 40 MG Delayed Release Oral Tablet...    3.0\n",
       "11         50 ML Magnesium Sulfate 40 MG/ML Injection    3.0\n",
       "12           250 ML Sodium Chloride 9 MG/ML Injection    3.0\n",
       "13      50 ML potassium chloride 0.4 MEQ/ML Injection    3.0\n",
       "14           100 ML Sodium Chloride 9 MG/ML Injection    2.0\n",
       "15                  250 ML Glucose 50 MG/ML Injection    2.0"
      ]
     },
     "execution_count": 117,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "cui_prob_list = ['C0019151']\n",
    "orders_likely = LikelyOrders(cui_prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "orders_likely"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9a7c190c-a4b3-4f8c-b483-e03c8ea6deb4",
   "metadata": {},
   "outputs": [],
   "source": [
    "def LikelyAbnormalLabs(cui_prob_list):\n",
    "        \n",
    "    query = '''\n",
    "    MATCH (prob1:Problem)-[:INSTANCE_OF]->(:Concept)-[r:OCCURS_WITH]-(c:Concept)<-[:INSTANCE_OF]-(:Labevents)\n",
    "    WHERE prob1.cui in {cui_prob_list} AND OddsRatio > 1.5\n",
    "    RETURN c.term as Lab, r.odds_ratio as `OddsAbnormal`, r.z_score as `ZScore`\n",
    "    ORDER BY OddsAbnormal DESC\n",
    "    LIMIT 10\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    LikelyAbnormalLabs = session.run(query)\n",
    "    LikelyAbnormalLabs = pd.DataFrame([dict(record) for record in LikelyAbnormalLabs])\n",
    "    \n",
    "    return LikelyAbnormalLabs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "5fff69ee-b7bd-49aa-a728-86fae786f838",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3504\n",
      "        CUI  Number\n",
      "0  C0011860    1725\n",
      "1  C0085605    1224\n",
      "2  C0220983    1172\n"
     ]
    }
   ],
   "source": [
    "# Get a list of all problems in the database\n",
    "query = '''\n",
    "MATCH (n:Problem) \n",
    "WITH n.cui AS CUI, count(n.cui) AS Number\n",
    "RETURN CUI, Number\n",
    "ORDER BY Number DESC'''\n",
    "data = session.run(query)\n",
    "problem_CUIs = pd.DataFrame([dict(record) for record in data])\n",
    "print(len(problem_CUIs))\n",
    "print(problem_CUIs[:3])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "0ba796b9-bbf5-4cbe-a748-b725ec4dfea1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['C0011860', 'C0085605', 'C0220983', 'C0039239']"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "prob_CUI_list = problem_CUIs.CUI.to_list()\n",
    "prob_CUI_list[:4]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "4e48b3c9-9ec2-4d9b-84b3-1845db86a5c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1557\n",
      "        CUI  Number\n",
      "0  C4082777   76067\n",
      "1  C4282051   66104\n",
      "2  C4282061   60177\n"
     ]
    }
   ],
   "source": [
    "# Get a list of all prescriptions in the database\n",
    "query = '''\n",
    "MATCH (rx:Prescriptions)-[:INSTANCE_OF]->(c:Concept)\n",
    "WITH c.cui AS CUI, count(rx) AS Number\n",
    "RETURN CUI, Number\n",
    "ORDER BY Number DESC'''\n",
    "data = session.run(query)\n",
    "rx_CUIs = pd.DataFrame([dict(record) for record in data])\n",
    "print(len(rx_CUIs))\n",
    "print(rx_CUIs[:3]) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "dbcc131f-fc69-4e45-99f2-baf2932af5fb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['C4082777', 'C4282051', 'C4282061']"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_rx_CUI_list = rx_CUIs.CUI[:3].to_list()\n",
    "test_rx_CUI_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "3e0166ed-9fa8-4094-8fbb-40038a4f0ea0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "489\n",
      "        CUI  Number\n",
      "0  C0366777  881764\n",
      "1  C0362923  845947\n",
      "2  C0364968  845737\n"
     ]
    }
   ],
   "source": [
    "# Get a list of all labs in the database\n",
    "query = '''\n",
    "MATCH (lab:Labevents)-[:INSTANCE_OF]->(c:Concept)\n",
    "WITH c.cui AS CUI, count(lab) AS Number\n",
    "RETURN CUI, Number\n",
    "ORDER BY Number DESC'''\n",
    "data = session.run(query)\n",
    "rx_CUIs = pd.DataFrame([dict(record) for record in data])\n",
    "print(len(rx_CUIs))\n",
    "print(rx_CUIs[:3]) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "ca5978d0-29e1-4118-9a71-76d8da9c2b37",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['C0366777', 'C0362923', 'C0364968']"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_lab_CUI_list = rx_CUIs.CUI[:3].to_list()\n",
    "test_lab_CUI_list"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
