{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "603d49da-151d-4a92-8f08-8e58abff1b78",
   "metadata": {},
   "source": [
    "# Mockup Version 1\n",
    "\n",
    "- Mock-up the workflow from MIS global summit in an environment like EvidenceCare's Epic App. Due January 1.\n",
    "    - â˜‘ï¸ List content for our app (Due by Nov 23) TJM\n",
    "    - â˜‘ï¸ Define the workflow between user, website, and service (Due by Nov 23) TJM & NS workshop session\n",
    "    - â˜‘ï¸ Define interface between UI and service (Due by Nov 30) TJM & NS workshop session\n",
    "    - ðŸŸ¢ Include procedures predictor (Due by Dec 14) TJM\n",
    "    - ðŸŸ¢ Write a dummy function that returns assessment and plan in JSON format (Due by Dec 14) TJM\n",
    "    - â˜‘ï¸ Create a static page layout (Due by Dec 7) NS\n",
    "    - â˜‘ï¸ Flask configuration (due by Dec 1) TJM \n",
    "    - Tim send Nikesh screenshot of Epic data\n",
    "    - Nikesh will send code to incorporate into fetchData and app.y \n",
    "    - Write & test the code for webpage (Due by Dec 23) TJM & NS\n",
    "    - Provide instructions, documentation, supporting information to make it (Due by Dec 23) BED"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "df7ba2c1-5fa2-40a1-af9c-c17ab614cfb8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0b4cce4c-b692-461a-9c6c-52de423ebdfe",
   "metadata": {},
   "outputs": [],
   "source": [
    "# import getpass\n",
    "# password = getpass.getpass(\"\\nPlease enter the Neo4j database password to continue \\n\")\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j','NikeshIsCool'))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e70e22dc-bdfa-4d3b-b37e-602cbb3dbc96",
   "metadata": {},
   "outputs": [],
   "source": [
    "# get a CSV of all problems in the database that have enough data to potentially return robust results\n",
    "query = '''\n",
    "MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r, c\n",
    "WHERE Score > 20\n",
    "RETURN distinct(c.term) AS Problem, c.cui'''\n",
    "data = session.run(query)\n",
    "\n",
    "# Convert the neo4j object into a dataframe\n",
    "common_problems_df = pd.DataFrame([dict(record) for record in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b22b925d-5588-4f43-b4c4-4c6a651683d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Abnormally opaque structure (morphologic abnormality)',\n",
       " 'Acidosis',\n",
       " 'Acidosis, Lactic',\n",
       " 'Acidosis, Respiratory',\n",
       " 'Actinic cheilitis',\n",
       " 'Acute respiratory failure',\n",
       " 'Aggressive Periodontitis',\n",
       " 'Agitation',\n",
       " 'Alcohol Withdrawal Delirium',\n",
       " 'Alcohol abuse',\n",
       " 'Alcohol withdrawal syndrome',\n",
       " 'Alkalosis, Respiratory',\n",
       " 'Aneurysm',\n",
       " 'Apnea',\n",
       " 'Ascites',\n",
       " 'Back Pain',\n",
       " 'Blood Clot',\n",
       " 'Bronchospasm',\n",
       " 'Cardiac Arrhythmia',\n",
       " 'Cerebrovascular accident',\n",
       " 'Chest Pain',\n",
       " 'Cholangiocarcinoma',\n",
       " 'Chronic Kidney Diseases',\n",
       " 'Chronic back pain',\n",
       " 'Confusion',\n",
       " 'Contraction (finding)',\n",
       " 'Coughing',\n",
       " 'Dentatorubral-Pallidoluysian Atrophy',\n",
       " 'Desmoplastic infantile ganglioglioma',\n",
       " 'Diabetes Mellitus, Non-Insulin-Dependent',\n",
       " 'Diabetic Ketoacidosis',\n",
       " 'Diastolic dysfunction',\n",
       " 'Disease',\n",
       " 'Disease Progression',\n",
       " 'Dry skin',\n",
       " 'Dyspnea',\n",
       " 'Encephalitis',\n",
       " 'Epilepsy',\n",
       " 'Esophageal Varices',\n",
       " 'Fatigue',\n",
       " 'Febrile Neutropenia',\n",
       " 'Flare',\n",
       " 'Fluid overload',\n",
       " 'Gastrointestinal Hemorrhage',\n",
       " 'Gastroparesis',\n",
       " 'Headache',\n",
       " 'Hematemesis',\n",
       " 'Hematoma, Subdural',\n",
       " 'Hematuria',\n",
       " 'Hemorrhage',\n",
       " 'Hepatic Encephalopathy',\n",
       " 'Hydrocephalus, Normal Pressure',\n",
       " 'Hyperglycemia',\n",
       " 'Hypersensitivity',\n",
       " 'Hypertensive urgency',\n",
       " 'Hypocalcemia',\n",
       " 'INFECTIOUS PROCESS',\n",
       " 'Ileus',\n",
       " 'Infarction',\n",
       " 'Infection',\n",
       " 'Influenza',\n",
       " 'Kidney Diseases',\n",
       " 'Kidney Failure, Chronic',\n",
       " 'Lethargy',\n",
       " 'Liver Failure',\n",
       " 'Liver diseases',\n",
       " 'Mental status changes',\n",
       " 'Metabolic alkalosis',\n",
       " 'Multiple Myeloma',\n",
       " 'Neoplasms',\n",
       " 'Normocytic anemia',\n",
       " 'Nutritional Deficiency',\n",
       " 'Obstruction',\n",
       " 'Oliguria',\n",
       " 'POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE',\n",
       " 'Paroxysmal atrial fibrillation',\n",
       " 'Pathological Dilatation',\n",
       " 'Pathology processes',\n",
       " 'Pericardial effusion',\n",
       " 'Pleural effusion disorder',\n",
       " 'Pneumothorax',\n",
       " 'Polysubstance abuse',\n",
       " 'Pressure Ulcer',\n",
       " 'Pulmonary Edema',\n",
       " 'Renal Insufficiency',\n",
       " 'Seizures',\n",
       " 'Sepsis due to urinary tract infection',\n",
       " 'Shock',\n",
       " 'Shock, Cardiogenic',\n",
       " 'Sinus Tachycardia',\n",
       " 'Somnolence',\n",
       " 'Sore to touch',\n",
       " 'Toxic effect',\n",
       " 'Ulcer',\n",
       " 'Uremia',\n",
       " 'Urinary tract infection',\n",
       " 'Vomiting',\n",
       " 'Wheezing',\n",
       " 'Xanthomatosis, Cerebrotendinous',\n",
       " 'diastolic congestive heart failure',\n",
       " 'gastrointestinal gas',\n",
       " 'physiologic resolution']"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "common_problems_df.sort_values(by='Problem', inplace=True)\n",
    "common_problems_df.Problem.to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "8692c0ca-8e3b-4533-b54f-da4ece1f29a8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Trim out problems that seem to be spurious\n",
    "spurious = ['Abnormally opaque structure (morphologic abnormality)', 'Actinic cheilitis', 'Aggressive Periodontitis', 'Dentatorubral-Pallidoluysian Atrophy', 'Desmoplastic infantile ganglioglioma',  'Disease', 'Disease Progression', 'Flare', 'Obstruction', 'POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE',  'Pathological Dilatation', 'Pathology processes', 'Sore to touch', 'Xanthomatosis, Cerebrotendinous',  'diastolic congestive heart failure', 'gastrointestinal gas', 'physiologic resolution']\n",
    "common_problems_df = common_problems_df[~common_problems_df.Problem.isin(spurious)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "84225b8d-d07b-42c4-a47f-6e36660b4517",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write out to CSV\n",
    "common_problems_df.to_csv('common_problems.csv', index=False, encoding='utf-8')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "216368ad-b8d5-415c-b23a-91bf039df33f",
   "metadata": {},
   "source": [
    "## Modify existing functions for the new data model\n",
    "### Input a list of CUIs for known problems, output possible additional problems with their CUIs and odds ratios in a dataframe\n",
    "Note: This query relies on the OCCURS_WITH relationship, which was created in the [Virtual_Population](Documents/P2_Prototype/Virtual_Population.ipynb) notebook under the section \"Using Conditional Probability instead of Odds Ratio.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "91c2d2ea-71fe-4a9c-ac30-805351261a88",
   "metadata": {},
   "outputs": [],
   "source": [
    "def PotentialComorbidities(cui_prob_list):\n",
    "    \n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Pathologic Function']\", \"['Disease or Syndrome']\", \"['Mental or Behavioral Dysfunction']\", \"['Sign or Symptom']\", \"['Injury or Poisoning']\", \"['Neoplastic Process']\"]\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.cui AS `CUI`, ord.term AS `Problem`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    likely_comorbidities = pd.DataFrame([dict(record) for record in data])\n",
    "    \n",
    "    return likely_comorbidities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "49fabae8-92fa-47d3-b4b6-edbf8c2a5342",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.049037933349609375 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>CUI</th>\n",
       "      <th>Problem</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0220982</td>\n",
       "      <td>Ketoacidosis</td>\n",
       "      <td>155.34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0149521</td>\n",
       "      <td>Pancreatitis, Chronic</td>\n",
       "      <td>143.31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0151723</td>\n",
       "      <td>Hypomagnesemia</td>\n",
       "      <td>130.16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0236663</td>\n",
       "      <td>Alcohol withdrawal syndrome</td>\n",
       "      <td>128.93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C1963823</td>\n",
       "      <td>Hyperlipasaemia</td>\n",
       "      <td>118.59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0438696</td>\n",
       "      <td>Suicidal</td>\n",
       "      <td>116.84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0747752</td>\n",
       "      <td>Polysubstance abuse</td>\n",
       "      <td>115.94</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0162316</td>\n",
       "      <td>Iron deficiency anemia</td>\n",
       "      <td>111.78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C3159311</td>\n",
       "      <td>BORNHOLM EYE DISEASE</td>\n",
       "      <td>108.70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C0232498</td>\n",
       "      <td>Abdominal tenderness</td>\n",
       "      <td>107.26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>C0162429</td>\n",
       "      <td>Malnutrition</td>\n",
       "      <td>105.10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>C0948268</td>\n",
       "      <td>Hemodynamic instability</td>\n",
       "      <td>96.27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>C4761312</td>\n",
       "      <td>Nutritional Deficiency</td>\n",
       "      <td>91.89</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>C0442874</td>\n",
       "      <td>Neuropathy</td>\n",
       "      <td>87.18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>C0338908</td>\n",
       "      <td>Mixed anxiety and depressive disorder</td>\n",
       "      <td>84.93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>C0677042</td>\n",
       "      <td>Pathology processes</td>\n",
       "      <td>71.43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>C0394996</td>\n",
       "      <td>Acute alcoholic intoxication</td>\n",
       "      <td>62.73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>C0600688</td>\n",
       "      <td>Toxic effect</td>\n",
       "      <td>59.68</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>C2826321</td>\n",
       "      <td>Refractory Thrombocytopenia</td>\n",
       "      <td>53.33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>C0232493</td>\n",
       "      <td>Epigastric pain</td>\n",
       "      <td>37.74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>C2830004</td>\n",
       "      <td>Somnolence</td>\n",
       "      <td>35.94</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>C1849718</td>\n",
       "      <td>POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE</td>\n",
       "      <td>32.56</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>C3714514</td>\n",
       "      <td>Infection</td>\n",
       "      <td>30.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>C0154298</td>\n",
       "      <td>Acute posthaemorrhagic anaemia</td>\n",
       "      <td>30.30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>C0751781</td>\n",
       "      <td>Dentatorubral-Pallidoluysian Atrophy</td>\n",
       "      <td>29.13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>C2183328</td>\n",
       "      <td>diastolic congestive heart failure</td>\n",
       "      <td>27.92</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>C1140999</td>\n",
       "      <td>Contraction (finding)</td>\n",
       "      <td>27.64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>C0344315</td>\n",
       "      <td>Depressed mood</td>\n",
       "      <td>25.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>C0496892</td>\n",
       "      <td>Benign neoplasm of kidney</td>\n",
       "      <td>24.17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>C0151908</td>\n",
       "      <td>Dry skin</td>\n",
       "      <td>24.10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>C0860062</td>\n",
       "      <td>Anion gap acidosis</td>\n",
       "      <td>23.42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>C1861101</td>\n",
       "      <td>THYROID HORMONE PLASMA MEMBRANE TRANSPORT DEFECT</td>\n",
       "      <td>23.17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>C0596601</td>\n",
       "      <td>gastrointestinal gas</td>\n",
       "      <td>22.84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>C0238052</td>\n",
       "      <td>Xanthomatosis, Cerebrotendinous</td>\n",
       "      <td>22.73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>C0948824</td>\n",
       "      <td>Anemia due to blood loss</td>\n",
       "      <td>21.02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>C0497010</td>\n",
       "      <td>Toxic effect of ketones</td>\n",
       "      <td>20.98</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>C0220983</td>\n",
       "      <td>Metabolic alkalosis</td>\n",
       "      <td>20.64</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         CUI                                           Problem   Score\n",
       "0   C0220982                                      Ketoacidosis  155.34\n",
       "1   C0149521                             Pancreatitis, Chronic  143.31\n",
       "2   C0151723                                    Hypomagnesemia  130.16\n",
       "3   C0236663                       Alcohol withdrawal syndrome  128.93\n",
       "4   C1963823                                   Hyperlipasaemia  118.59\n",
       "5   C0438696                                          Suicidal  116.84\n",
       "6   C0747752                               Polysubstance abuse  115.94\n",
       "7   C0162316                            Iron deficiency anemia  111.78\n",
       "8   C3159311                              BORNHOLM EYE DISEASE  108.70\n",
       "9   C0232498                              Abdominal tenderness  107.26\n",
       "10  C0162429                                      Malnutrition  105.10\n",
       "11  C0948268                           Hemodynamic instability   96.27\n",
       "12  C4761312                            Nutritional Deficiency   91.89\n",
       "13  C0442874                                        Neuropathy   87.18\n",
       "14  C0338908             Mixed anxiety and depressive disorder   84.93\n",
       "15  C0677042                               Pathology processes   71.43\n",
       "16  C0394996                      Acute alcoholic intoxication   62.73\n",
       "17  C0600688                                      Toxic effect   59.68\n",
       "18  C2826321                       Refractory Thrombocytopenia   53.33\n",
       "19  C0232493                                   Epigastric pain   37.74\n",
       "20  C2830004                                        Somnolence   35.94\n",
       "21  C1849718         POPLITEAL PTERYGIUM SYNDROME, LETHAL TYPE   32.56\n",
       "22  C3714514                                         Infection   30.77\n",
       "23  C0154298                    Acute posthaemorrhagic anaemia   30.30\n",
       "24  C0751781              Dentatorubral-Pallidoluysian Atrophy   29.13\n",
       "25  C2183328                diastolic congestive heart failure   27.92\n",
       "26  C1140999                             Contraction (finding)   27.64\n",
       "27  C0344315                                    Depressed mood   25.77\n",
       "28  C0496892                         Benign neoplasm of kidney   24.17\n",
       "29  C0151908                                          Dry skin   24.10\n",
       "30  C0860062                                Anion gap acidosis   23.42\n",
       "31  C1861101  THYROID HORMONE PLASMA MEMBRANE TRANSPORT DEFECT   23.17\n",
       "32  C0596601                              gastrointestinal gas   22.84\n",
       "33  C0238052                   Xanthomatosis, Cerebrotendinous   22.73\n",
       "34  C0948824                          Anemia due to blood loss   21.02\n",
       "35  C0497010                           Toxic effect of ketones   20.98\n",
       "36  C0220983                               Metabolic alkalosis   20.64"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Test the function\n",
    "start_time = time.time()\n",
    "\n",
    "cui_prob_list = ['C1565489', 'C0085762']\n",
    "PotentialComorbidities = PotentialComorbidities(cui_prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")\n",
    "PotentialComorbidities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bef509fe-94f1-417f-8ff9-a696cb4afb8a",
   "metadata": {},
   "source": [
    "### Input 1 problem, output the most likely orders\n",
    "Note: This query relies on the OCCURS_WITH relationship, which was created in the [Virtual_Population](Documents/P2_Prototype/Virtual_Population.ipynb) notebook under the section \"Using Conditional Probability instead of Odds Ratio.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "ef2d8b50-e0bd-4fc1-ab0a-5c8bf9333d5f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def LikelyOrders(cui_prob_list):\n",
    "    \n",
    "    # Find prescriptions associated with the input problem    \n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Drug']\"]\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.cui AS `Code`, ord.term AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_rx = pd.DataFrame([dict(record) for record in data]).head(10)\n",
    "    \n",
    "    # Find abnormal labs associated with the input problem\n",
    "    query = '''\n",
    "    MATCH p=(ord:Concept)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list} AND ord.semantic_type IN [\"['Clinical Attribute']\"]\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.cui AS `Code`, ord.description AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_lab = pd.DataFrame([dict(record) for record in data]).head(10)\n",
    "    \n",
    "    # Find procedures associated with the input problem\n",
    "    query = '''\n",
    "    MATCH p=(ord:D_Icd_Procedures)-[r:OCCURS_WITH]->(c:Concept) \n",
    "    WHERE c.cui IN {cui_prob_list}\n",
    "    WITH round(r.co_occurrance_probability, 5)*1000 AS Score, ord, r\n",
    "    WHERE Score > 20\n",
    "    RETURN ord.icd9_code AS `Code`, ord.long_title AS `Order`, Score\n",
    "    ORDER BY r.co_occurrance_probability DESC\n",
    "    '''.format(cui_prob_list=cui_prob_list)\n",
    "    data = session.run(query)\n",
    "    orders_likely_procedure = pd.DataFrame([dict(record) for record in data]).head(10)\n",
    "    \n",
    "    return orders_likely_rx, orders_likely_lab, orders_likely_procedure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6674e54d-f32a-40d8-b836-9a77421a2e48",
   "metadata": {},
   "outputs": [],
   "source": [
    "MATCH (source:Concept {cui:'C0022661'})\n",
    "MATCH (destination:Concept {cui:'C0975120'})\n",
    "CALL gds.alpha.shortestPath.stream({\n",
    "    startNode: source,\n",
    "    endNode: destination,\n",
    "    nodeProjection: \n",
    "})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "173f99af-4cd7-4b2c-9cd4-9bfb2a0bac0a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total runtime: 0.014989852905273438 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "\n",
    "cui_prob_list = ['C0022661']\n",
    "orders_likely_rx, orders_likely_lab, orders_likely_procedure = LikelyOrders(cui_prob_list)\n",
    "\n",
    "print(\"Total runtime:\", time.time() - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "32b56beb-a602-487a-a162-83db287dd2ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C0975120</td>\n",
       "      <td>calcitriol 0.00025 MG Oral Capsule</td>\n",
       "      <td>109.59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C1967412</td>\n",
       "      <td>sevelamer carbonate 800 MG Oral Tablet [Renvela]</td>\n",
       "      <td>106.88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C1951501</td>\n",
       "      <td>sodium polystyrene sulfonate 250 MG/ML Oral Su...</td>\n",
       "      <td>103.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0706911</td>\n",
       "      <td>1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]</td>\n",
       "      <td>79.31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C4082775</td>\n",
       "      <td>150 ML Glucose 50 MG/ML Injection</td>\n",
       "      <td>76.26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0710995</td>\n",
       "      <td>purified protein derivative of tuberculin 50 U...</td>\n",
       "      <td>70.99</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0691839</td>\n",
       "      <td>sodium bicarbonate 650 MG Oral Tablet</td>\n",
       "      <td>66.74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0978650</td>\n",
       "      <td>midodrine hydrochloride 5 MG Oral Tablet</td>\n",
       "      <td>64.02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C1169852</td>\n",
       "      <td>piperacillin 2000 MG / tazobactam 250 MG Injec...</td>\n",
       "      <td>62.86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C0975350</td>\n",
       "      <td>cefepime 1000 MG Injection</td>\n",
       "      <td>60.51</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Code                                              Order   Score\n",
       "0  C0975120                 calcitriol 0.00025 MG Oral Capsule  109.59\n",
       "1  C1967412   sevelamer carbonate 800 MG Oral Tablet [Renvela]  106.88\n",
       "2  C1951501  sodium polystyrene sulfonate 250 MG/ML Oral Su...  103.32\n",
       "3  C0706911  1 ML epoetin alfa 4000 UNT/ML Injection [Procrit]   79.31\n",
       "4  C4082775                  150 ML Glucose 50 MG/ML Injection   76.26\n",
       "5  C0710995  purified protein derivative of tuberculin 50 U...   70.99\n",
       "6  C0691839              sodium bicarbonate 650 MG Oral Tablet   66.74\n",
       "7  C0978650           midodrine hydrochloride 5 MG Oral Tablet   64.02\n",
       "8  C1169852  piperacillin 2000 MG / tazobactam 250 MG Injec...   62.86\n",
       "9  C0975350                         cefepime 1000 MG Injection   60.51"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_rx"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "8cbe6cc3-f3c3-44d8-8150-e94ee560db1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C1544491</td>\n",
       "      <td>Macrophage in Ascites</td>\n",
       "      <td>57.87</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C0549816</td>\n",
       "      <td>Lymphocytes in Other Body Fluid</td>\n",
       "      <td>57.69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C0942476</td>\n",
       "      <td>Polys in Other Body Fluid</td>\n",
       "      <td>53.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C0942444</td>\n",
       "      <td>Lymphocytes in Ascites</td>\n",
       "      <td>52.82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C0942425</td>\n",
       "      <td>RBC, Ascites in Ascites</td>\n",
       "      <td>51.48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C0945358</td>\n",
       "      <td>WBC, Ascites in Ascites</td>\n",
       "      <td>50.71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C0942450</td>\n",
       "      <td>Monocytes in Ascites</td>\n",
       "      <td>49.68</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C0942478</td>\n",
       "      <td>Polys in Ascites</td>\n",
       "      <td>48.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C0365034</td>\n",
       "      <td>Protein/Creatinine Ratio in Urine</td>\n",
       "      <td>48.01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C0368042</td>\n",
       "      <td>pH in Urine</td>\n",
       "      <td>44.46</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Code                              Order  Score\n",
       "0  C1544491              Macrophage in Ascites  57.87\n",
       "1  C0549816    Lymphocytes in Other Body Fluid  57.69\n",
       "2  C0942476          Polys in Other Body Fluid  53.77\n",
       "3  C0942444             Lymphocytes in Ascites  52.82\n",
       "4  C0942425            RBC, Ascites in Ascites  51.48\n",
       "5  C0945358            WBC, Ascites in Ascites  50.71\n",
       "6  C0942450               Monocytes in Ascites  49.68\n",
       "7  C0942478                   Polys in Ascites  48.77\n",
       "8  C0365034  Protein/Creatinine Ratio in Urine  48.01\n",
       "9  C0368042                        pH in Urine  44.46"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_lab"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "f07e36d8-a1fa-447e-bffa-c2d0e6799c55",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Code</th>\n",
       "      <th>Order</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3995</td>\n",
       "      <td>Hemodialysis</td>\n",
       "      <td>69.13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3895</td>\n",
       "      <td>Venous catheterization for renal dialysis</td>\n",
       "      <td>64.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>4513</td>\n",
       "      <td>Other endoscopy of small intestine</td>\n",
       "      <td>24.70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3324</td>\n",
       "      <td>Closed [endoscopic] biopsy of bronchus</td>\n",
       "      <td>23.03</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3893</td>\n",
       "      <td>Venous catheterization, not elsewhere classified</td>\n",
       "      <td>21.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>9904</td>\n",
       "      <td>Transfusion of packed cells</td>\n",
       "      <td>21.29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>9604</td>\n",
       "      <td>Insertion of endotracheal tube</td>\n",
       "      <td>20.16</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Code                                             Order  Score\n",
       "0  3995                                      Hemodialysis  69.13\n",
       "1  3895         Venous catheterization for renal dialysis  64.32\n",
       "2  4513                Other endoscopy of small intestine  24.70\n",
       "3  3324            Closed [endoscopic] biopsy of bronchus  23.03\n",
       "4  3893  Venous catheterization, not elsewhere classified  21.32\n",
       "5  9904                       Transfusion of packed cells  21.29\n",
       "6  9604                    Insertion of endotracheal tube  20.16"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders_likely_procedure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fe13a9d6-1588-43a2-af6e-f6fa77e16e1c",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
